[
  {
    "id": "12382822239",
    "userName": "bschiller17",
    "userUrl": "https://itunes.apple.com/us/reviews/id409701764",
    "version": "1.0.9",
    "score": 5,
    "title": "Five stars, best time blocking app I’ve ever used",
    "text": "I would pay for this app every year and I am even considering switching to the family plan so my wife can join in with me. It has cured my TikTok addiction. And the fact that I can unblock an application based on completing my workout for the day has got to be the top feature for me 👍\n\nThe app is simple, intuitive and easy to use! I use for both my Mac and iPhone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12378237936",
    "userName": "Doublebubbs",
    "userUrl": "https://itunes.apple.com/us/reviews/id524855503",
    "version": "1.8.31",
    "score": 5,
    "title": "Skeptic at first but sold",
    "text": "Wow! I thought I was just gonna try this out for 3 days and cancel my subscription. But boy no! This app has changed my habits for the better. I used to spend hours doomscrolling on social media but even since I started using Jomo, I find myself using that time on more productive learning like podcasts and reading. I like the easy to use interface. Highly recommend this to anyone trying to cut down on mindless scrolling!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12378114656",
    "userName": "kbizz12",
    "userUrl": "https://itunes.apple.com/us/reviews/id148112200",
    "version": "1.0.9",
    "score": 5,
    "title": "Clearly About Helping People Over Profit",
    "text": "This app has genuinely improved my life. \n\nThis team/company clearly values actually helping people. \n\nFirst, the app (on Mac and iOS) works far more consistently than numerous others I've tried. Second, it's obvious this isn't a group of people just further capitalizing on the attention economy under the guise of benevolence. The price structure is much more reasonable (esp. with the lifetime option which I'm switching to soon) than most other apps. And again, it works really seamlessly.\n\nDoes it have some glitches, sure. I blame that more on Apple's enigmatic Screentime system that Jomo has mostly wrangled very well.\n\nThe strict modes and break options literally thread a needle of being really strict but also allowing JUST enough slack in case you really need to check something, or even just reward yourself with a quick doom scroll.\n\nIt's as flexible as you really could need it to be and thus feels like a companion for mindful screentime rather than a judgemental chastity belt for your device and how you use it.\n\nBravo team! You're genuinely making a difference in people's lives.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12363495067",
    "userName": "Tlm2010",
    "userUrl": "https://itunes.apple.com/us/reviews/id85974261",
    "version": "1.8.31",
    "score": 5,
    "title": "Saving me from myself",
    "text": "Social media is draining our brains. Having breaks to focus on life is fabulous. Turns out this is also great for those No Buy/No Social Media blackouts days.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12354927002",
    "userName": "nndv1234",
    "userUrl": "https://itunes.apple.com/us/reviews/id1255625596",
    "version": "1.8.31",
    "score": 5,
    "title": "Love this app",
    "text": "this app works so well and i also love the little tips it gives when your screen time is up i definitely recommend it",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12308837011",
    "userName": "ChaiGuy22",
    "userUrl": "https://itunes.apple.com/us/reviews/id1630983462",
    "version": "1.8.30",
    "score": 5,
    "title": "Simple and Effective",
    "text": "This app has been wonderful in helping me achieve my goals of getting offline more and staying off of certain apps. The easy to use UI and strict modes make it frustratingly effective, which I can’t complain about.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12290207179",
    "userName": "Kgarboski",
    "userUrl": "https://itunes.apple.com/us/reviews/id1272704539",
    "version": "1.8.30",
    "score": 5,
    "title": "So good",
    "text": "I tested a bunch of web blocker apps but I like this one the best. It looks great with an awesome UI/UX, but doesn't solely rely on that unlike some other apps which focus on style over functionality. The functionality is here as well.\n\nI have it set up to be so annoying to use certain apps and that's a good thing. Throughout the day, as I use the apps that kill my attention, Jomo increases how long I have to wait to unlock the apps. What's also great is the feature where you have to type in a long complex passcode which gives you time to reconsider using the app.\n\nI'm happy with giving them my money, it's a well made app and it's helping me cut down on stuff that is fighting for my attention.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12287047705",
    "userName": "Mus1cfantast1c",
    "userUrl": "https://itunes.apple.com/us/reviews/id812827456",
    "version": "1.8.30",
    "score": 3,
    "title": "Screen time malfunction",
    "text": "I really like this app, its functions, and easy layout. It’s one of the best screen time blockers I’ve had so far. I really love the little messages that give other tasks instead of getting on blocked apps, it really helps when I’m struggling for ideas on things to do. However, recently there has been an issue where the app counts that I’ve been on an app for so long when I haven’t. For an example, today when I had to take a standardized test, I had to power down my phone. But for some reason Jomo thought I was on Google all of that time, even though my phone was never on. It has been doing this with my bank app and other apps as well. Like I’ve said I really do like this app, I just won’t continue to use it if it keeps counting screen time even when I’m not using my phone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12283020060",
    "userName": "Ane-ue",
    "userUrl": "https://itunes.apple.com/us/reviews/id296598425",
    "version": "1.8.30",
    "score": 4,
    "title": "Landscape tablet mode",
    "text": "Landscape tablet mode please.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12278151952",
    "userName": "anisjdnfodns id ff",
    "userUrl": "https://itunes.apple.com/us/reviews/id1197307426",
    "version": "1.8.30",
    "score": 1,
    "title": "Lost my account",
    "text": "Purchased a year and then my account was deleted",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12262775591",
    "userName": "arcticmonkeysssss",
    "userUrl": "https://itunes.apple.com/us/reviews/id389437139",
    "version": "1.8.29",
    "score": 5,
    "title": "Perfectly designed",
    "text": "I’m so impressed with this app, it has every feature that other productivity and app-blocking apps fail to have. I’ve probably reduced my screen time by like 80% using this in conjunction with One Sec, which I also recommend.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12256874304",
    "userName": "Thomasejfud",
    "userUrl": "https://itunes.apple.com/us/reviews/id1638204665",
    "version": "1.0.9",
    "score": 5,
    "title": "Great app free!",
    "text": "Great app is free helps a lot",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12249492789",
    "userName": "ashy.aspen",
    "userUrl": "https://itunes.apple.com/us/reviews/id945677189",
    "version": "1.8.29",
    "score": 5,
    "title": "Jomo is great for routine!!!!",
    "text": "Love Jomo. So much better than other screen time apps. Has ability to schedule rules but also incorporates actions and rules to force you to use healthier apps first or mark certain tasks as done which has been a huge help in reinforcing and making sure i keep track on routine. Shortcuts integration is also really great!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12245587700",
    "userName": "Chris",
    "userUrl": "https://itunes.apple.com/us/reviews/id41606737",
    "version": "1.0.9",
    "score": 5,
    "title": "Best screen time control app!!!",
    "text": "I’m a user of both the Jomo desktop and mobile app and can confidently say that this is the best app to use on both platforms! The Mac app is great, with support for all major browsers including Firefox, which most/all other screen time control apps lack. Jomo is clearly a well considered digital app, with attention paid to many small details. It really works!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12244919556",
    "userName": "Chris",
    "userUrl": "https://itunes.apple.com/us/reviews/id41606737",
    "version": "1.8.28",
    "score": 5,
    "title": "The best screen time control app out there!",
    "text": "Jomo is absolutely the best screen time blocking app, and I’ll tell you why. I came from an app named like a gem (starting with the letter O) that worked pretty well, but left much to be desired. Jomo fills in all those gaps and then some. Here are some things I love about it (also this is not sponsored, I just really like it):\n-Cross platform between iOS and MacOS. Both platform apps are extremely comprehensive and well built, and support almost all browsers INCLUDING FIREFOX\n-Really tough blocking. “Other” apps are too simple to disable blocks/rules that you set. Jomo has some hardcore features that really make it tough to break through\n-Highly customizable configurations. With a Plus account, you can really customize block times, amounts, unlocks, etc. It’s very detailed and allows you to set it how you like\n-Super reasonable price! “Other” apps charged a CRAZY amount; Jomo has super reasonable pricing, especially with the annual subscription, or even the lifetime pass\n-Responsive support! The team was super responsive to some questions I had, and it’s clear they really care about building and maintaining this app\n\nShout out to Jomo and the team behind it; they really thought of everything. I’m really excited to get it dialed in, and can’t wait to see what the future of this app brings!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12241754074",
    "userName": "CasualCapybara",
    "userUrl": "https://itunes.apple.com/us/reviews/id219577267",
    "version": "1.8.28",
    "score": 3,
    "title": "Great app when it works",
    "text": "The app keeps disconnecting from Apple ScreenTime, which causes apps to either be blocked or unblocked when you don’t intend. \n\nWhen it is working, though, it’s great! \n\nIt could be improved if either this bug was fixed, or if the app exposed the reset interface on the main page.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12237603542",
    "userName": "SugerRae",
    "userUrl": "https://itunes.apple.com/us/reviews/id24091810",
    "version": "1.8.28",
    "score": 2,
    "title": "Frustrating",
    "text": "Just purchased this app so my whole family could detox from screens. I’m trying to set it up and am so frustrated that I want to just toss my phone across the room. Maybe that’s how this app works. Frustrate you until you throw your phone and break it, and viola, no more screen time. Every time I try and select the apps for blocking, or allowing etc, there is an error and I have to reload. This is happening over and over again. I try and use the search bar or the mic in the search bar as suggested, and the same thing happens.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12230023480",
    "userName": "emiily56",
    "userUrl": "https://itunes.apple.com/us/reviews/id539877819",
    "version": "1.8.28",
    "score": 2,
    "title": "Glitchy - especially the notification feature",
    "text": "The banner notification pops up even if the app you have open doesn’t add to the screen time - annoying when I’m driving. I get notifications for rules that I’ve deleted. And the app consistently needs to be opened and refreshed to calculate screen time. Not worth the $",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12229850304",
    "userName": "johnedq",
    "userUrl": "https://itunes.apple.com/us/reviews/id44042879",
    "version": "1.8.28",
    "score": 5,
    "title": "Best app blocker on App Store",
    "text": "Definitely the best I’ve used, and I’ve used several. It seems like the team is dedicated. I hope they succeed.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12219705012",
    "userName": "specseries",
    "userUrl": "https://itunes.apple.com/us/reviews/id1041325416",
    "version": "1.0.8",
    "score": 5,
    "title": "love it!",
    "text": "been using jomo for about a year now and its awesome. love the app design layout and features. i've lessened my screentime considerably and this app acts as a great study tool. thanks JOMO!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12217399936",
    "userName": "Coolgirlcore",
    "userUrl": "https://itunes.apple.com/us/reviews/id1205588038",
    "version": "1.8.28",
    "score": 5,
    "title": "App gave me my life back!!",
    "text": "I’m now able to study, focus on hobbies, and learn how social media impacts me. This app is amazing it’s provides amazing articles to teach you, allows you to set unlimited limits. I have the paid version but even the free is as affective. Yes you have to pay they deserve to get paid for their craft.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12214190430",
    "userName": "lia ( ᵔᴥᵔ )",
    "userUrl": "https://itunes.apple.com/us/reviews/id1701273759",
    "version": "1.8.28",
    "score": 5,
    "title": "Works as described so far. Recommend",
    "text": "I was looking for a screen time app on IOS that could block specific websites, and this one was perfect! I’ve tried other screen time apps and they either required a subscription or didn’t work the way I wanted them to. If you are in the same situation that I was, I definitely think you should download this app!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12209684506",
    "userName": "Pinkscourge",
    "userUrl": "https://itunes.apple.com/us/reviews/id142428495",
    "version": "1.8.28",
    "score": 1,
    "title": "Too many requests to rate",
    "text": "Too many requests to rate",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12200995606",
    "userName": "Russdc88",
    "userUrl": "https://itunes.apple.com/us/reviews/id170010753",
    "version": "1.8.27",
    "score": 1,
    "title": "Erased all my setting",
    "text": "Got on and told me that I had to restart my account and restore my purchase. Erased all my settings that I had. I don’t know why that would happened. Very frustrating.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12198615789",
    "userName": "Frodonny",
    "userUrl": "https://itunes.apple.com/us/reviews/id402415946",
    "version": "1.8.27",
    "score": 2,
    "title": "App Crash, Lost Data",
    "text": "App crashed and somehow wiped all the data in the app. Had to rebuild everything. I’m subscribed and apparently I didn’t have an account so I need to start over. Pretty lame.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12198205531",
    "userName": "chunk reviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id1226414886",
    "version": "1.8.27",
    "score": 5,
    "title": "The Best App Ever. Period.",
    "text": "I never review apps — but Jomo truly deserves it. I used to use Opal, which is no longer even comparable. Jomo is very affordable and fair, and the features are perfect. I will warn — it took me a couple minutes to figure out how to cancel strict mode, but it wasn’t an issue. This app has helped me a lot, and I’ve ordered NFC tags to allow me to unlock my phone from different locations. Truly a 5 star app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12195852967",
    "userName": "sim1hsu",
    "userUrl": "https://itunes.apple.com/us/reviews/id1614017123",
    "version": "1.8.25",
    "score": 5,
    "title": "Life-changing app",
    "text": "This app turned my screen-time struggles around (50% decrease in social media usage and 25% decrease in screen time overall). Beautiful UI/UX is a bonus!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12195332046",
    "userName": "__ryans__opinion",
    "userUrl": "https://itunes.apple.com/us/reviews/id838361863",
    "version": "1.8.26",
    "score": 5,
    "title": "This one works",
    "text": "I have tried numerous different solutions. \n\nJomo is the first and only one that had all the right pieces to work for me. \n\nIt's simple, easy, and best of all it's made by real people who care about their mission and their users. \n\nI recommend it to everyone!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12193902600",
    "userName": "maddy texas",
    "userUrl": "https://itunes.apple.com/us/reviews/id801273964",
    "version": "1.8.26",
    "score": 2,
    "title": "frustrated by bugginess",
    "text": "I’m a Jomo plus subscriber. After 3 months of using Jomo, the app just kicked me out deleted all of my progress tracking and settings I’ve been tweaking for months. This is a problem they are aware of- app has a pop up that suggests “to avoid this happening again, make an account!” I assumed that because I have a subscription I automatically have an account, how am I supposed to know that’s not the case if you don’t tell me otherwise? I was already feeling annoyed by other bugs and I think this pushed me over the edge. This app helps me with screen time, but there are plenty of alternatives I’m going to be looking into.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12193458776",
    "userName": "Handy_Andy2024",
    "userUrl": "https://itunes.apple.com/us/reviews/id1708307674",
    "version": "1.8.26",
    "score": 1,
    "title": "Took my money & ran",
    "text": "Loved the app at first. It was simple and worked. Then about a week after I renewed for the year, I get kicked off the app, can’t log in, and now tells me “you don’t have an account”. They had no problem taking my money, so I clearly do have an account. Request a refund and move on to a less shady company!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12173498384",
    "userName": "catgirl28",
    "userUrl": "https://itunes.apple.com/us/reviews/id107814109",
    "version": "1.8.24",
    "score": 5,
    "title": "This app is SO AWESOME",
    "text": "I really love this app for keeping me in alignment with my intentions. I'm re-reading Atomic Habits and it's just reiterating what a great tool this is. Love it- thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12153340313",
    "userName": "Amandagronewold",
    "userUrl": "https://itunes.apple.com/us/reviews/id483240388",
    "version": "1.0.8",
    "score": 4,
    "title": "Just needs syncing of rules between devices",
    "text": "I have ADHD and the attention span and executive function of a toddler, and this helps tremendously. It does everything I need but I really wish there was the option to sync rules between devices. Would also appreciate more granular scheduling, e.g. from 8am-noon and 1pm-5pm. Would like ability to duplicate a rule (for when you want a rule very similar to another) too. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12148348368",
    "userName": "martyamark",
    "userUrl": "https://itunes.apple.com/us/reviews/id635137628",
    "version": "1.8.24",
    "score": 5,
    "title": "Might be my favorite app",
    "text": "This app gave me some control over my phone usage. I started to feel like my phone usage was too much and was having trouble stopping. Turning off my phone or putting my phone in another room never worked. This app finally gave me some control. And establish the boundaries to stop mindlessly scrolling and just experience boring things. Which honestly, is great. I feel less like “I’m missing something online”. It feels like I can just sit back and relax.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12146031400",
    "userName": "buncraft",
    "userUrl": "https://itunes.apple.com/us/reviews/id925847933",
    "version": "1.8.24",
    "score": 5,
    "title": "Huge Impact in 2 Days",
    "text": "Was rec'd this app by a friend and honestly it dropped my social media doomscrolling to almost 0 in 2 days. Being able to block major scroll tendencies like Instagram, Facebook, etc was helpful and then having to \"unlock\" them for certain periods of time helps you be more present in your use. I also like that the wait time to unlock increases with each break. I find myself automatically going to the app but the 10 second+ wait time to open stops my instant gratification. Love the app, might work on streaming usage at some point too!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12135886013",
    "userName": "Brooke E T",
    "userUrl": "https://itunes.apple.com/us/reviews/id1246782132",
    "version": "1.8.24",
    "score": 5,
    "title": "Fantastic App with a Personal Touch!!",
    "text": "JOMO is such a well-designed and effective screen time app! It doesn’t just limit your usage—it encourages healthy, intentional habits with creative redirection ideas that are both helpful and customizable. The premade limits are also a great feature, making it super easy to get started without feeling overwhelmed.\n\nWhat sets JOMO apart is the personal touch. It’s run by a small team, and their dedication really shows. When I reached out for help, the support team responded quickly and made sure my questions were fully answered.\n\nOverall, this app has been a game-changer for me. It’s thoughtful, intuitive, and a joy to use. Highly recommend it to anyone looking to take control of their screen time!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12124503767",
    "userName": "Dav+Liz1125",
    "userUrl": "https://itunes.apple.com/us/reviews/id856892123",
    "version": "1.8.24",
    "score": 5,
    "title": "Password needed in order to use app?",
    "text": "I was able to use Jomo perfectly fine without any problems on my iPhone 13 Pro max that didn’t require me to have a password on my phone but now that I have the iPhone 16 pro max i can’t use Jomo without having a password on my phone which is pretty weird because it then unblocks all my apps when i remove my password from my phone. Please help me with this problem!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12121343004",
    "userName": "kbizz12",
    "userUrl": "https://itunes.apple.com/us/reviews/id148112200",
    "version": "1.8.24",
    "score": 5,
    "title": "Total sleeper among others!",
    "text": "This app was buried among the other promoted and more popular (hopefully only for now) screen time apps. But this is absolutely the least buggy and feature-rich of the many I’ve tried.\n\nThe prompts at the block screens are also really insightful. It’s not laden with fluffy quotes (a select few maybe), but rather legit research excerpts and thoughtful perspectives from vetted authors on the attention economy and more.\n\nAnother way I’d put it, is that in a very short time (two days) the app went from feeling like a gatekeeping tool (like others do) to more of a personal companion to help me be more mindful.\n\nThe UI and overall feel of the app is actually appealing. Not bloated but not a lifeless settings interface.\n\nStrongly considering the lifetime purchase… a worthy investment in myself considering how phones and apps are only going to get more addicting.\n\nBravo Jomo team! <3",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12120772182",
    "userName": "CCCFFFCFReviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id1399649774",
    "version": "1.8.24",
    "score": 5,
    "title": "The only thing that works for me!",
    "text": "I’m so grateful to the makers of this app - both the great UX and great functionality mean I use it and I abide by it. The copy is the exact right mix of encouraging and firm. So glad I found it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12104563741",
    "userName": "JuanMartinez Munoz",
    "userUrl": "https://itunes.apple.com/us/reviews/id1522220543",
    "version": "1.8.23",
    "score": 5,
    "title": "Joni Screen Time Block",
    "text": "Self Control & Focus",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12095749129",
    "userName": "/05Knives",
    "userUrl": "https://itunes.apple.com/us/reviews/id538452917",
    "version": "1.8.23",
    "score": 5,
    "title": "it actually works",
    "text": "This app is packed with features, and the developers have obviously put a lot of thoughts into it. I’m actually able to tweak it and make it tailored to my needs. Probably the best block app in dec 2024",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12089930091",
    "userName": "jasperpwu",
    "userUrl": "https://itunes.apple.com/us/reviews/id1110226001",
    "version": "1.0.8",
    "score": 1,
    "title": "Doesn't work and lets you know many resources..",
    "text": "Lol doesn't block at all and tells me a bunch of adult sites to explore :D even worse..",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12089133806",
    "userName": "LAtoATX",
    "userUrl": "https://itunes.apple.com/us/reviews/id168236369",
    "version": "1.8.23",
    "score": 5,
    "title": "Getting my life back!",
    "text": "Screen time apps tend to be buggy by nature, but Jomo hasn’t been at all. It’s made it easy for me to set custom rules, and the thoughtful intentionality behind how breaks work and whether they’re unlimited or set to a certain amount, has truly transformed some of my crippling overusage of my phone. Really love using this app and have recommended it to so many people I know!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12075993630",
    "userName": "vtc_",
    "userUrl": "https://itunes.apple.com/us/reviews/id1528276913",
    "version": "1.0.8",
    "score": 5,
    "title": "Life changing",
    "text": "As someone who used to be a chronic procrastinator, Jomo has utterly revolutionized how I think about my screen time and has reduced my total daily average across devices from 10 hours to 2 over the course of six months. There’s no other screen time app free tier that offers as many helpful features as Jomo’s. Just download it, trust bro!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12053619499",
    "userName": "treeestreees",
    "userUrl": "https://itunes.apple.com/us/reviews/id1556168483",
    "version": "1.0.8",
    "score": 5,
    "title": "i never write reviews, but this app is GREAT!",
    "text": "for those who are sick and tired of spending time on their phone, get this app!\n\nthe app is super intuitive, and the design is super cute!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12053593129",
    "userName": "ih8detriot",
    "userUrl": "https://itunes.apple.com/us/reviews/id1212947902",
    "version": "1.8.23",
    "score": 5,
    "title": "Best free screen time reducing app",
    "text": "Really affordable premium version, has all the features you could need, and most useful , it has a feature to track your friends screen times to hold them accountable. Kudos",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12051405030",
    "userName": "AnonReviewr",
    "userUrl": "https://itunes.apple.com/us/reviews/id1079514584",
    "version": "1.8.23",
    "score": 5,
    "title": "The BEST!???!!",
    "text": "Yeah!!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12033627906",
    "userName": "Shlyakhter",
    "userUrl": "https://itunes.apple.com/us/reviews/id371031616",
    "version": "1.0.8",
    "score": 5,
    "title": "Your Productivity Agent",
    "text": "Must install app if you want to stay focused and not distracted. Even free version gives you so much usability. Tru it - thank me later",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11999528261",
    "userName": "mir g.s",
    "userUrl": "https://itunes.apple.com/us/reviews/id815833533",
    "version": "1.8.22",
    "score": 5,
    "title": "Life Changing!",
    "text": "The ability to not delete the app, Jomo, nor other apps during a session has been the biggest game changer from other app blockers I’ve used. \nThe design of the app is clear and direct. Simple to create a routine and session. And the messages that pop up when you attempt to open an app is definitely something that helps as well. \n\nOverall this app has made me develop more self awareness of my phone screen time and be more focused on what matters. \n\nThanks Jomo! :D",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11996840862",
    "userName": "Amybamy86",
    "userUrl": "https://itunes.apple.com/us/reviews/id437364942",
    "version": "1.8.22",
    "score": 4,
    "title": "Love it!",
    "text": "I love love love this app - I have so many rules in place on my phone to help with screen time. But recently it isn’t getting the memo that I’m on social media to block it at its limit and I have to do a manual refresh on the Jomo app to get it to realize I’m way over my limit. It was a nice indulgence on the first day but it keeps happening and I’d like it to work properly as I’m an ADHD scrolling addict.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11994963368",
    "userName": "Raju93",
    "userUrl": "https://itunes.apple.com/us/reviews/id144708397",
    "version": "1.8.22",
    "score": 5,
    "title": "Best app for building healthy habits",
    "text": "This app saved me a lot of time that was spent on apps that I would open unnecessarily multiple times a day. It would reduce my productivity and I wouldn't get through a proper day's work. After installing this, I have to be very intentional about when I want to open the apps and websites that I used to open. This changed my habits. The premiumization is designed very cleverly and can be worth it for someone who has lesser mental control than myself. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12382822239",
    "userName": "bschiller17",
    "userUrl": "https://itunes.apple.com/us/reviews/id409701764",
    "version": "1.0.9",
    "score": 5,
    "title": "Five stars, best time blocking app I’ve ever used",
    "text": "I would pay for this app every year and I am even considering switching to the family plan so my wife can join in with me. It has cured my TikTok addiction. And the fact that I can unblock an application based on completing my workout for the day has got to be the top feature for me 👍\n\nThe app is simple, intuitive and easy to use! I use for both my Mac and iPhone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12378237936",
    "userName": "Doublebubbs",
    "userUrl": "https://itunes.apple.com/us/reviews/id524855503",
    "version": "1.8.31",
    "score": 5,
    "title": "Skeptic at first but sold",
    "text": "Wow! I thought I was just gonna try this out for 3 days and cancel my subscription. But boy no! This app has changed my habits for the better. I used to spend hours doomscrolling on social media but even since I started using Jomo, I find myself using that time on more productive learning like podcasts and reading. I like the easy to use interface. Highly recommend this to anyone trying to cut down on mindless scrolling!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12378114656",
    "userName": "kbizz12",
    "userUrl": "https://itunes.apple.com/us/reviews/id148112200",
    "version": "1.0.9",
    "score": 5,
    "title": "Clearly About Helping People Over Profit",
    "text": "This app has genuinely improved my life. \n\nThis team/company clearly values actually helping people. \n\nFirst, the app (on Mac and iOS) works far more consistently than numerous others I've tried. Second, it's obvious this isn't a group of people just further capitalizing on the attention economy under the guise of benevolence. The price structure is much more reasonable (esp. with the lifetime option which I'm switching to soon) than most other apps. And again, it works really seamlessly.\n\nDoes it have some glitches, sure. I blame that more on Apple's enigmatic Screentime system that Jomo has mostly wrangled very well.\n\nThe strict modes and break options literally thread a needle of being really strict but also allowing JUST enough slack in case you really need to check something, or even just reward yourself with a quick doom scroll.\n\nIt's as flexible as you really could need it to be and thus feels like a companion for mindful screentime rather than a judgemental chastity belt for your device and how you use it.\n\nBravo team! You're genuinely making a difference in people's lives.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12363495067",
    "userName": "Tlm2010",
    "userUrl": "https://itunes.apple.com/us/reviews/id85974261",
    "version": "1.8.31",
    "score": 5,
    "title": "Saving me from myself",
    "text": "Social media is draining our brains. Having breaks to focus on life is fabulous. Turns out this is also great for those No Buy/No Social Media blackouts days.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12354927002",
    "userName": "nndv1234",
    "userUrl": "https://itunes.apple.com/us/reviews/id1255625596",
    "version": "1.8.31",
    "score": 5,
    "title": "Love this app",
    "text": "this app works so well and i also love the little tips it gives when your screen time is up i definitely recommend it",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12308837011",
    "userName": "ChaiGuy22",
    "userUrl": "https://itunes.apple.com/us/reviews/id1630983462",
    "version": "1.8.30",
    "score": 5,
    "title": "Simple and Effective",
    "text": "This app has been wonderful in helping me achieve my goals of getting offline more and staying off of certain apps. The easy to use UI and strict modes make it frustratingly effective, which I can’t complain about.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12290207179",
    "userName": "Kgarboski",
    "userUrl": "https://itunes.apple.com/us/reviews/id1272704539",
    "version": "1.8.30",
    "score": 5,
    "title": "So good",
    "text": "I tested a bunch of web blocker apps but I like this one the best. It looks great with an awesome UI/UX, but doesn't solely rely on that unlike some other apps which focus on style over functionality. The functionality is here as well.\n\nI have it set up to be so annoying to use certain apps and that's a good thing. Throughout the day, as I use the apps that kill my attention, Jomo increases how long I have to wait to unlock the apps. What's also great is the feature where you have to type in a long complex passcode which gives you time to reconsider using the app.\n\nI'm happy with giving them my money, it's a well made app and it's helping me cut down on stuff that is fighting for my attention.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12287047705",
    "userName": "Mus1cfantast1c",
    "userUrl": "https://itunes.apple.com/us/reviews/id812827456",
    "version": "1.8.30",
    "score": 3,
    "title": "Screen time malfunction",
    "text": "I really like this app, its functions, and easy layout. It’s one of the best screen time blockers I’ve had so far. I really love the little messages that give other tasks instead of getting on blocked apps, it really helps when I’m struggling for ideas on things to do. However, recently there has been an issue where the app counts that I’ve been on an app for so long when I haven’t. For an example, today when I had to take a standardized test, I had to power down my phone. But for some reason Jomo thought I was on Google all of that time, even though my phone was never on. It has been doing this with my bank app and other apps as well. Like I’ve said I really do like this app, I just won’t continue to use it if it keeps counting screen time even when I’m not using my phone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12283020060",
    "userName": "Ane-ue",
    "userUrl": "https://itunes.apple.com/us/reviews/id296598425",
    "version": "1.8.30",
    "score": 4,
    "title": "Landscape tablet mode",
    "text": "Landscape tablet mode please.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12278151952",
    "userName": "anisjdnfodns id ff",
    "userUrl": "https://itunes.apple.com/us/reviews/id1197307426",
    "version": "1.8.30",
    "score": 1,
    "title": "Lost my account",
    "text": "Purchased a year and then my account was deleted",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12262775591",
    "userName": "arcticmonkeysssss",
    "userUrl": "https://itunes.apple.com/us/reviews/id389437139",
    "version": "1.8.29",
    "score": 5,
    "title": "Perfectly designed",
    "text": "I’m so impressed with this app, it has every feature that other productivity and app-blocking apps fail to have. I’ve probably reduced my screen time by like 80% using this in conjunction with One Sec, which I also recommend.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12256874304",
    "userName": "Thomasejfud",
    "userUrl": "https://itunes.apple.com/us/reviews/id1638204665",
    "version": "1.0.9",
    "score": 5,
    "title": "Great app free!",
    "text": "Great app is free helps a lot",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12249492789",
    "userName": "ashy.aspen",
    "userUrl": "https://itunes.apple.com/us/reviews/id945677189",
    "version": "1.8.29",
    "score": 5,
    "title": "Jomo is great for routine!!!!",
    "text": "Love Jomo. So much better than other screen time apps. Has ability to schedule rules but also incorporates actions and rules to force you to use healthier apps first or mark certain tasks as done which has been a huge help in reinforcing and making sure i keep track on routine. Shortcuts integration is also really great!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12245587700",
    "userName": "Chris",
    "userUrl": "https://itunes.apple.com/us/reviews/id41606737",
    "version": "1.0.9",
    "score": 5,
    "title": "Best screen time control app!!!",
    "text": "I’m a user of both the Jomo desktop and mobile app and can confidently say that this is the best app to use on both platforms! The Mac app is great, with support for all major browsers including Firefox, which most/all other screen time control apps lack. Jomo is clearly a well considered digital app, with attention paid to many small details. It really works!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12244919556",
    "userName": "Chris",
    "userUrl": "https://itunes.apple.com/us/reviews/id41606737",
    "version": "1.8.28",
    "score": 5,
    "title": "The best screen time control app out there!",
    "text": "Jomo is absolutely the best screen time blocking app, and I’ll tell you why. I came from an app named like a gem (starting with the letter O) that worked pretty well, but left much to be desired. Jomo fills in all those gaps and then some. Here are some things I love about it (also this is not sponsored, I just really like it):\n-Cross platform between iOS and MacOS. Both platform apps are extremely comprehensive and well built, and support almost all browsers INCLUDING FIREFOX\n-Really tough blocking. “Other” apps are too simple to disable blocks/rules that you set. Jomo has some hardcore features that really make it tough to break through\n-Highly customizable configurations. With a Plus account, you can really customize block times, amounts, unlocks, etc. It’s very detailed and allows you to set it how you like\n-Super reasonable price! “Other” apps charged a CRAZY amount; Jomo has super reasonable pricing, especially with the annual subscription, or even the lifetime pass\n-Responsive support! The team was super responsive to some questions I had, and it’s clear they really care about building and maintaining this app\n\nShout out to Jomo and the team behind it; they really thought of everything. I’m really excited to get it dialed in, and can’t wait to see what the future of this app brings!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12241754074",
    "userName": "CasualCapybara",
    "userUrl": "https://itunes.apple.com/us/reviews/id219577267",
    "version": "1.8.28",
    "score": 3,
    "title": "Great app when it works",
    "text": "The app keeps disconnecting from Apple ScreenTime, which causes apps to either be blocked or unblocked when you don’t intend. \n\nWhen it is working, though, it’s great! \n\nIt could be improved if either this bug was fixed, or if the app exposed the reset interface on the main page.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12237603542",
    "userName": "SugerRae",
    "userUrl": "https://itunes.apple.com/us/reviews/id24091810",
    "version": "1.8.28",
    "score": 2,
    "title": "Frustrating",
    "text": "Just purchased this app so my whole family could detox from screens. I’m trying to set it up and am so frustrated that I want to just toss my phone across the room. Maybe that’s how this app works. Frustrate you until you throw your phone and break it, and viola, no more screen time. Every time I try and select the apps for blocking, or allowing etc, there is an error and I have to reload. This is happening over and over again. I try and use the search bar or the mic in the search bar as suggested, and the same thing happens.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12230023480",
    "userName": "emiily56",
    "userUrl": "https://itunes.apple.com/us/reviews/id539877819",
    "version": "1.8.28",
    "score": 2,
    "title": "Glitchy - especially the notification feature",
    "text": "The banner notification pops up even if the app you have open doesn’t add to the screen time - annoying when I’m driving. I get notifications for rules that I’ve deleted. And the app consistently needs to be opened and refreshed to calculate screen time. Not worth the $",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12229850304",
    "userName": "johnedq",
    "userUrl": "https://itunes.apple.com/us/reviews/id44042879",
    "version": "1.8.28",
    "score": 5,
    "title": "Best app blocker on App Store",
    "text": "Definitely the best I’ve used, and I’ve used several. It seems like the team is dedicated. I hope they succeed.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12219705012",
    "userName": "specseries",
    "userUrl": "https://itunes.apple.com/us/reviews/id1041325416",
    "version": "1.0.8",
    "score": 5,
    "title": "love it!",
    "text": "been using jomo for about a year now and its awesome. love the app design layout and features. i've lessened my screentime considerably and this app acts as a great study tool. thanks JOMO!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12217399936",
    "userName": "Coolgirlcore",
    "userUrl": "https://itunes.apple.com/us/reviews/id1205588038",
    "version": "1.8.28",
    "score": 5,
    "title": "App gave me my life back!!",
    "text": "I’m now able to study, focus on hobbies, and learn how social media impacts me. This app is amazing it’s provides amazing articles to teach you, allows you to set unlimited limits. I have the paid version but even the free is as affective. Yes you have to pay they deserve to get paid for their craft.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12214190430",
    "userName": "lia ( ᵔᴥᵔ )",
    "userUrl": "https://itunes.apple.com/us/reviews/id1701273759",
    "version": "1.8.28",
    "score": 5,
    "title": "Works as described so far. Recommend",
    "text": "I was looking for a screen time app on IOS that could block specific websites, and this one was perfect! I’ve tried other screen time apps and they either required a subscription or didn’t work the way I wanted them to. If you are in the same situation that I was, I definitely think you should download this app!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12209684506",
    "userName": "Pinkscourge",
    "userUrl": "https://itunes.apple.com/us/reviews/id142428495",
    "version": "1.8.28",
    "score": 1,
    "title": "Too many requests to rate",
    "text": "Too many requests to rate",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12200995606",
    "userName": "Russdc88",
    "userUrl": "https://itunes.apple.com/us/reviews/id170010753",
    "version": "1.8.27",
    "score": 1,
    "title": "Erased all my setting",
    "text": "Got on and told me that I had to restart my account and restore my purchase. Erased all my settings that I had. I don’t know why that would happened. Very frustrating.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12198615789",
    "userName": "Frodonny",
    "userUrl": "https://itunes.apple.com/us/reviews/id402415946",
    "version": "1.8.27",
    "score": 2,
    "title": "App Crash, Lost Data",
    "text": "App crashed and somehow wiped all the data in the app. Had to rebuild everything. I’m subscribed and apparently I didn’t have an account so I need to start over. Pretty lame.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12198205531",
    "userName": "chunk reviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id1226414886",
    "version": "1.8.27",
    "score": 5,
    "title": "The Best App Ever. Period.",
    "text": "I never review apps — but Jomo truly deserves it. I used to use Opal, which is no longer even comparable. Jomo is very affordable and fair, and the features are perfect. I will warn — it took me a couple minutes to figure out how to cancel strict mode, but it wasn’t an issue. This app has helped me a lot, and I’ve ordered NFC tags to allow me to unlock my phone from different locations. Truly a 5 star app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12195852967",
    "userName": "sim1hsu",
    "userUrl": "https://itunes.apple.com/us/reviews/id1614017123",
    "version": "1.8.25",
    "score": 5,
    "title": "Life-changing app",
    "text": "This app turned my screen-time struggles around (50% decrease in social media usage and 25% decrease in screen time overall). Beautiful UI/UX is a bonus!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12195332046",
    "userName": "__ryans__opinion",
    "userUrl": "https://itunes.apple.com/us/reviews/id838361863",
    "version": "1.8.26",
    "score": 5,
    "title": "This one works",
    "text": "I have tried numerous different solutions. \n\nJomo is the first and only one that had all the right pieces to work for me. \n\nIt's simple, easy, and best of all it's made by real people who care about their mission and their users. \n\nI recommend it to everyone!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12193902600",
    "userName": "maddy texas",
    "userUrl": "https://itunes.apple.com/us/reviews/id801273964",
    "version": "1.8.26",
    "score": 2,
    "title": "frustrated by bugginess",
    "text": "I’m a Jomo plus subscriber. After 3 months of using Jomo, the app just kicked me out deleted all of my progress tracking and settings I’ve been tweaking for months. This is a problem they are aware of- app has a pop up that suggests “to avoid this happening again, make an account!” I assumed that because I have a subscription I automatically have an account, how am I supposed to know that’s not the case if you don’t tell me otherwise? I was already feeling annoyed by other bugs and I think this pushed me over the edge. This app helps me with screen time, but there are plenty of alternatives I’m going to be looking into.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12193458776",
    "userName": "Handy_Andy2024",
    "userUrl": "https://itunes.apple.com/us/reviews/id1708307674",
    "version": "1.8.26",
    "score": 1,
    "title": "Took my money & ran",
    "text": "Loved the app at first. It was simple and worked. Then about a week after I renewed for the year, I get kicked off the app, can’t log in, and now tells me “you don’t have an account”. They had no problem taking my money, so I clearly do have an account. Request a refund and move on to a less shady company!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12173498384",
    "userName": "catgirl28",
    "userUrl": "https://itunes.apple.com/us/reviews/id107814109",
    "version": "1.8.24",
    "score": 5,
    "title": "This app is SO AWESOME",
    "text": "I really love this app for keeping me in alignment with my intentions. I'm re-reading Atomic Habits and it's just reiterating what a great tool this is. Love it- thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12153340313",
    "userName": "Amandagronewold",
    "userUrl": "https://itunes.apple.com/us/reviews/id483240388",
    "version": "1.0.8",
    "score": 4,
    "title": "Just needs syncing of rules between devices",
    "text": "I have ADHD and the attention span and executive function of a toddler, and this helps tremendously. It does everything I need but I really wish there was the option to sync rules between devices. Would also appreciate more granular scheduling, e.g. from 8am-noon and 1pm-5pm. Would like ability to duplicate a rule (for when you want a rule very similar to another) too. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12148348368",
    "userName": "martyamark",
    "userUrl": "https://itunes.apple.com/us/reviews/id635137628",
    "version": "1.8.24",
    "score": 5,
    "title": "Might be my favorite app",
    "text": "This app gave me some control over my phone usage. I started to feel like my phone usage was too much and was having trouble stopping. Turning off my phone or putting my phone in another room never worked. This app finally gave me some control. And establish the boundaries to stop mindlessly scrolling and just experience boring things. Which honestly, is great. I feel less like “I’m missing something online”. It feels like I can just sit back and relax.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12146031400",
    "userName": "buncraft",
    "userUrl": "https://itunes.apple.com/us/reviews/id925847933",
    "version": "1.8.24",
    "score": 5,
    "title": "Huge Impact in 2 Days",
    "text": "Was rec'd this app by a friend and honestly it dropped my social media doomscrolling to almost 0 in 2 days. Being able to block major scroll tendencies like Instagram, Facebook, etc was helpful and then having to \"unlock\" them for certain periods of time helps you be more present in your use. I also like that the wait time to unlock increases with each break. I find myself automatically going to the app but the 10 second+ wait time to open stops my instant gratification. Love the app, might work on streaming usage at some point too!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12135886013",
    "userName": "Brooke E T",
    "userUrl": "https://itunes.apple.com/us/reviews/id1246782132",
    "version": "1.8.24",
    "score": 5,
    "title": "Fantastic App with a Personal Touch!!",
    "text": "JOMO is such a well-designed and effective screen time app! It doesn’t just limit your usage—it encourages healthy, intentional habits with creative redirection ideas that are both helpful and customizable. The premade limits are also a great feature, making it super easy to get started without feeling overwhelmed.\n\nWhat sets JOMO apart is the personal touch. It’s run by a small team, and their dedication really shows. When I reached out for help, the support team responded quickly and made sure my questions were fully answered.\n\nOverall, this app has been a game-changer for me. It’s thoughtful, intuitive, and a joy to use. Highly recommend it to anyone looking to take control of their screen time!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12124503767",
    "userName": "Dav+Liz1125",
    "userUrl": "https://itunes.apple.com/us/reviews/id856892123",
    "version": "1.8.24",
    "score": 5,
    "title": "Password needed in order to use app?",
    "text": "I was able to use Jomo perfectly fine without any problems on my iPhone 13 Pro max that didn’t require me to have a password on my phone but now that I have the iPhone 16 pro max i can’t use Jomo without having a password on my phone which is pretty weird because it then unblocks all my apps when i remove my password from my phone. Please help me with this problem!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12121343004",
    "userName": "kbizz12",
    "userUrl": "https://itunes.apple.com/us/reviews/id148112200",
    "version": "1.8.24",
    "score": 5,
    "title": "Total sleeper among others!",
    "text": "This app was buried among the other promoted and more popular (hopefully only for now) screen time apps. But this is absolutely the least buggy and feature-rich of the many I’ve tried.\n\nThe prompts at the block screens are also really insightful. It’s not laden with fluffy quotes (a select few maybe), but rather legit research excerpts and thoughtful perspectives from vetted authors on the attention economy and more.\n\nAnother way I’d put it, is that in a very short time (two days) the app went from feeling like a gatekeeping tool (like others do) to more of a personal companion to help me be more mindful.\n\nThe UI and overall feel of the app is actually appealing. Not bloated but not a lifeless settings interface.\n\nStrongly considering the lifetime purchase… a worthy investment in myself considering how phones and apps are only going to get more addicting.\n\nBravo Jomo team! <3",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12120772182",
    "userName": "CCCFFFCFReviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id1399649774",
    "version": "1.8.24",
    "score": 5,
    "title": "The only thing that works for me!",
    "text": "I’m so grateful to the makers of this app - both the great UX and great functionality mean I use it and I abide by it. The copy is the exact right mix of encouraging and firm. So glad I found it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12104563741",
    "userName": "JuanMartinez Munoz",
    "userUrl": "https://itunes.apple.com/us/reviews/id1522220543",
    "version": "1.8.23",
    "score": 5,
    "title": "Joni Screen Time Block",
    "text": "Self Control & Focus",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12095749129",
    "userName": "/05Knives",
    "userUrl": "https://itunes.apple.com/us/reviews/id538452917",
    "version": "1.8.23",
    "score": 5,
    "title": "it actually works",
    "text": "This app is packed with features, and the developers have obviously put a lot of thoughts into it. I’m actually able to tweak it and make it tailored to my needs. Probably the best block app in dec 2024",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12089930091",
    "userName": "jasperpwu",
    "userUrl": "https://itunes.apple.com/us/reviews/id1110226001",
    "version": "1.0.8",
    "score": 1,
    "title": "Doesn't work and lets you know many resources..",
    "text": "Lol doesn't block at all and tells me a bunch of adult sites to explore :D even worse..",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12089133806",
    "userName": "LAtoATX",
    "userUrl": "https://itunes.apple.com/us/reviews/id168236369",
    "version": "1.8.23",
    "score": 5,
    "title": "Getting my life back!",
    "text": "Screen time apps tend to be buggy by nature, but Jomo hasn’t been at all. It’s made it easy for me to set custom rules, and the thoughtful intentionality behind how breaks work and whether they’re unlimited or set to a certain amount, has truly transformed some of my crippling overusage of my phone. Really love using this app and have recommended it to so many people I know!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12075993630",
    "userName": "vtc_",
    "userUrl": "https://itunes.apple.com/us/reviews/id1528276913",
    "version": "1.0.8",
    "score": 5,
    "title": "Life changing",
    "text": "As someone who used to be a chronic procrastinator, Jomo has utterly revolutionized how I think about my screen time and has reduced my total daily average across devices from 10 hours to 2 over the course of six months. There’s no other screen time app free tier that offers as many helpful features as Jomo’s. Just download it, trust bro!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12053619499",
    "userName": "treeestreees",
    "userUrl": "https://itunes.apple.com/us/reviews/id1556168483",
    "version": "1.0.8",
    "score": 5,
    "title": "i never write reviews, but this app is GREAT!",
    "text": "for those who are sick and tired of spending time on their phone, get this app!\n\nthe app is super intuitive, and the design is super cute!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12053593129",
    "userName": "ih8detriot",
    "userUrl": "https://itunes.apple.com/us/reviews/id1212947902",
    "version": "1.8.23",
    "score": 5,
    "title": "Best free screen time reducing app",
    "text": "Really affordable premium version, has all the features you could need, and most useful , it has a feature to track your friends screen times to hold them accountable. Kudos",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12051405030",
    "userName": "AnonReviewr",
    "userUrl": "https://itunes.apple.com/us/reviews/id1079514584",
    "version": "1.8.23",
    "score": 5,
    "title": "The BEST!???!!",
    "text": "Yeah!!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "12033627906",
    "userName": "Shlyakhter",
    "userUrl": "https://itunes.apple.com/us/reviews/id371031616",
    "version": "1.0.8",
    "score": 5,
    "title": "Your Productivity Agent",
    "text": "Must install app if you want to stay focused and not distracted. Even free version gives you so much usability. Tru it - thank me later",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11999528261",
    "userName": "mir g.s",
    "userUrl": "https://itunes.apple.com/us/reviews/id815833533",
    "version": "1.8.22",
    "score": 5,
    "title": "Life Changing!",
    "text": "The ability to not delete the app, Jomo, nor other apps during a session has been the biggest game changer from other app blockers I’ve used. \nThe design of the app is clear and direct. Simple to create a routine and session. And the messages that pop up when you attempt to open an app is definitely something that helps as well. \n\nOverall this app has made me develop more self awareness of my phone screen time and be more focused on what matters. \n\nThanks Jomo! :D",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11996840862",
    "userName": "Amybamy86",
    "userUrl": "https://itunes.apple.com/us/reviews/id437364942",
    "version": "1.8.22",
    "score": 4,
    "title": "Love it!",
    "text": "I love love love this app - I have so many rules in place on my phone to help with screen time. But recently it isn’t getting the memo that I’m on social media to block it at its limit and I have to do a manual refresh on the Jomo app to get it to realize I’m way over my limit. It was a nice indulgence on the first day but it keeps happening and I’d like it to work properly as I’m an ADHD scrolling addict.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11994963368",
    "userName": "Raju93",
    "userUrl": "https://itunes.apple.com/us/reviews/id144708397",
    "version": "1.8.22",
    "score": 5,
    "title": "Best app for building healthy habits",
    "text": "This app saved me a lot of time that was spent on apps that I would open unnecessarily multiple times a day. It would reduce my productivity and I wouldn't get through a proper day's work. After installing this, I have to be very intentional about when I want to open the apps and websites that I used to open. This changed my habits. The premiumization is designed very cleverly and can be worth it for someone who has lesser mental control than myself. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11987165254",
    "userName": "asdoueuwj",
    "userUrl": "https://itunes.apple.com/us/reviews/id658011351",
    "version": "1.8.22",
    "score": 4,
    "title": "Won’t block Pinterest",
    "text": "It’s a really awesome app, but for some reason won’t block Pinterest. I restarted my phone and deleted and redownloaded the app and it still won’t block Pinterest.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11978850321",
    "userName": "Tolsdork",
    "userUrl": "https://itunes.apple.com/us/reviews/id1714501016",
    "version": "1.8.22",
    "score": 4,
    "title": "Love the app, but a few problems",
    "text": "I love the app, it has helped me cut my screen time down dramatically, but there are a few problems. As I write this review, it is 8:30 in the morning, and Jomo says I’ve been on my screen for 15 hours now. I understand that I fell asleep with my phone on on accident, so that could up the screen time, but it hasn’t been 15 hours in the day so far. Even my apple screen time is only showing a third of that. Is there any way to fix this? Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11966306309",
    "userName": "NeverFlyingUnited",
    "userUrl": "https://itunes.apple.com/us/reviews/id547103353",
    "version": "1.8.21",
    "score": 5,
    "title": "Really Great!",
    "text": "This is cheaper than competitors like opal and has novel features like getting sunlight before unlocking apps! I love the team behind the apps commitment to their values (no ads on big social media platforms) and I really do believe in their mission. While I’m here reviewing I’d just like to make a feature request. It would be nice to able to track things like phone pick ups and also have a widget that shows your streak of hitting your screen time goal for motivation. Anyways, great app, keep up the good work!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11962484798",
    "userName": "Charlottekac",
    "userUrl": "https://itunes.apple.com/us/reviews/id979929630",
    "version": "1.8.21",
    "score": 5,
    "title": "The BEST app",
    "text": "I love this app. Specifically, I like the “strict mode.” \nOne feature I think would be helpful is a “reminder” - similar to how the active actions require checking off a task, there should be a feature that gives you a reminder each time you open the app (either each time or during specific hours).\nWhen I open my most used app, I would love to have a reminder to take a sip of water before I use it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11950642355",
    "userName": "nu_oviosa",
    "userUrl": "https://itunes.apple.com/us/reviews/id1110190653",
    "version": "1.8.21",
    "score": 5,
    "title": "Amazing! The best app.",
    "text": "This fulfills all the things I need to avoid rotting on my phone! I’ve tried a few others but this one is the best!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11946089555",
    "userName": "Jay789543",
    "userUrl": "https://itunes.apple.com/us/reviews/id560258846",
    "version": "1.8.21",
    "score": 5,
    "title": "Jomo I love you and I hate you",
    "text": "It’s incredibly effective, the quotes and reminders on the block screen really make all the difference. I’ve even started Stolen Focus, one of books it frequently quotes from. I hate it because it works and I can’t get my little dopamine hit, that’s why I’m here writing a review instead because I’m blocked from Facebook, like I asked to be :( \n\nI hope this rolls out on Android so I can recommend it to others I know who aren’t on iPhone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11945170057",
    "userName": "Grace25250",
    "userUrl": "https://itunes.apple.com/us/reviews/id1168078538",
    "version": "1.8.21",
    "score": 2,
    "title": "Laggy, so laggy",
    "text": "I love the concept and “strict mode” that prevents you from worming your way out of a blocked social media period. However, this is so incredibly laggy and glitchy on my iPhone. It’s very frustrating having to spend minutes trying to navigate an unresponsive app, and I haven’t seen any improvements since I first started using Jomo in May.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11934085615",
    "userName": "84-2-3103",
    "userUrl": "https://itunes.apple.com/us/reviews/id40323799",
    "version": "1.0.7",
    "score": 5,
    "title": "Wonderful!",
    "text": "Best blocking app I've found to date.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11931004468",
    "userName": "clytemnestra",
    "userUrl": "https://itunes.apple.com/us/reviews/id32336977",
    "version": "1.0.7",
    "score": 5,
    "title": "THE BEST",
    "text": "I almost never review apps, but this is absoutely the best of its kind and is exactly what I've been waiting for. They succeed where lots of others have failed.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11916248381",
    "userName": "doij790",
    "userUrl": "https://itunes.apple.com/us/reviews/id573515503",
    "version": "1.0.7",
    "score": 1,
    "title": "Keeps crashing",
    "text": "It had a lot of potential, but for some reason as I try to add a new website to block, it keeps on crashing. Also you can easily turn off Jomo to just get on the websites that you wanted to block.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11915433048",
    "userName": "Chromakopiatylerthecreator",
    "userUrl": "https://itunes.apple.com/us/reviews/id1706417341",
    "version": "1.8.21",
    "score": 4,
    "title": "Confusing",
    "text": "It’s a bit confusing, but the app is still good.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11906713977",
    "userName": "Ez6767",
    "userUrl": "https://itunes.apple.com/us/reviews/id102388443",
    "version": "1.0.7",
    "score": 5,
    "title": "LOVE THIS APP!",
    "text": "Leaving a review to help the devs. THANK YOU for making an affordable, functionally, and constantly improving app blocker. This has changed my relationship with tech for the better. Love it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11906573287",
    "userName": "Ez6767",
    "userUrl": "https://itunes.apple.com/us/reviews/id102388443",
    "version": "1.8.21",
    "score": 5,
    "title": "Best Screen Blocker, hands down",
    "text": "I did a lot of research on all these types of apps, and this is by far the best one. I love that it focuses on the emotional connection over just strict blocking. \n\nI’ve had many convos with my step daughter about how hundreds of PhDs at social media websites are paid a lot of money to make their apps as addictive as possible, and that’s why it’s hard for us normal people to regulate. We’ve both started using JOMO to our benefit. I’m so glad that we have this tool to help us. I’m in grad school so I tried out the yearly version for $15, and next year I will purchase the lifetime and share it with my family. Thank you so much for making this amazing app at an accessible price, love that I’m supporting an indie team and not VC funders.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11906440198",
    "userName": "bbh best boy enthusiast",
    "userUrl": "https://itunes.apple.com/us/reviews/id674832909",
    "version": "1.8.21",
    "score": 3,
    "title": "Started crashing",
    "text": "I was using the app for a little over a week and it was going so well. It really helped me lower my screen time. \nI have my social media apps blocked 24/7 and only unblock them for 5 minutes at a time as a way to make sure I don’t end up doom scrolling. However, Jomo started crashing when I tried to  unblock my app today multiple times and would not allow me to unblock them.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11888804723",
    "userName": "Jonathan Piedrasanta",
    "userUrl": "https://itunes.apple.com/us/reviews/id475887428",
    "version": "1.8.21",
    "score": 5,
    "title": "Great Improvement!",
    "text": "I first heard of this app on Reddit when I was looking for a screen/app limit blocker. It worked well for what it is but over time I found lots of glitches and issues. The UI was clunky and confusing. So even though i had subscribed for a year, i set it to cancel and not renew. I looked for other apps to replace it, and tried mainly the high rated/top downloaded suggestions in the App Store. However those seemed to be worse than Jomo. I was surprised given Jomo is a small team. So anyway I reinstalled this app and just accepted its quirks. Suddenly I saw an update was available! This was the first ever update I had experienced. I actually thought this team had given up on the app and would never update it. So it was a pleasant surprise! Then I saw more and more updates (dare I saw regular updates)? Now I am ready to renew my subscription again! I am in love with the new UI and the fixes to bugs, and improvements based on feedback (I.e lock screens being made simple and dark). I want this app to succeed and get even better!! I am thankful to this app for improving my phone abuse and lowering my screen time. Thank you JOMO TEAM!!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11886592128",
    "userName": "jambalayajetson",
    "userUrl": "https://itunes.apple.com/us/reviews/id37852824",
    "version": "1.0.7",
    "score": 5,
    "title": "great app",
    "text": "really great default blocking options that make it simple to set up and operate. finding it helpful!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11867933751",
    "userName": "hehdbcjsjd",
    "userUrl": "https://itunes.apple.com/us/reviews/id686027004",
    "version": "1.8.21",
    "score": 5,
    "title": "Exactly what I was looking for",
    "text": "You could tell there was a lot of passion put into this app, thank you for creating it and helping many like me.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11847764454",
    "userName": "johnny8462",
    "userUrl": "https://itunes.apple.com/us/reviews/id645993109",
    "version": "1.0.6",
    "score": 5,
    "title": "Mind Blowingly Awesome",
    "text": "I’ve used several softwares for similar kinds of tasks and am only starting to use Jomo. So far I couldn’t be more thrilled. It seems like Jomo could be the best ever. Thanks so much Jomo and anyone in Jomo reviewing this review. I couldn’t be more excited to get started!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11841214405",
    "userName": "Aw2233",
    "userUrl": "https://itunes.apple.com/us/reviews/id284412726",
    "version": "1.0.6",
    "score": 5,
    "title": "Actually SO helpful!!!",
    "text": "I recently transitioned into a phase where I can work at my own pace, and I quickly realized that I struggle with self-control when I'm on my laptop. *Enter Jomo stage left*. I’ve tried many screen management tools, but Jomo is by far the easiest to use. It works on both apps and websites (I’m looking at you, Facebook!).\n\nOne of the features I appreciate the most is the tips and tricks it offers when I attempt to access a blocked site or app. They make me pause and reconsider why I even clicked in the first place, which has made me more intentional about my choices. Another great feature is the \"break timer\" delay. The five-second pause before starting the break often helps me realize I don’t really need to disrupt my workflow just because something challenging came up and it’s easier to scroll than to deal with it.\n\nOverall, it’s the little things—along with the bigger features—that have made a difference. Not only has Jomo helped me manage my time more effectively, but it's also improved my self-discipline in a way that I hadn't expected.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11830656573",
    "userName": "KenanSha",
    "userUrl": "https://itunes.apple.com/us/reviews/id504582462",
    "version": "1.8.20",
    "score": 1,
    "title": "Could have been so good, but no…",
    "text": "I needed an app to limit my time on apps and this one seemed promising. It’s easy to set rules and time limits. I even splurged for the pro mode so I can be even more strict. But it constantly gets my number of minutes wrong on restricted apps! Then finally it catches up and I’m way past the limit I set. The timer is constantly freezing and this makes the app basically useless. I wish I had never spent money on it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11814991577",
    "userName": "Coat-Tea64",
    "userUrl": "https://itunes.apple.com/us/reviews/id1081960048",
    "version": "1.8.20",
    "score": 5,
    "title": "Best app blocker on the market",
    "text": "It was between either Jomo or Opal and I’m glad I went with Jomo because it’s clearly created with a lot of passion and the creator’s mission to build the best productivity app on the market at an affordable price. My productivity has drastically improved since installing it and I don’t doom scroll as often anymore with their app unblocking feature being a bit cumbersome, which is a good thing cause it deters me away from opening social media often throughout the day to focus on what really matters.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11814511051",
    "userName": "johnzzzx20",
    "userUrl": "https://itunes.apple.com/us/reviews/id373714994",
    "version": "1.8.20",
    "score": 5,
    "title": "Premium is really good",
    "text": "Jomo plus is definitely worth it. This is the best screen time app i have used",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11764857725",
    "userName": "sd128d",
    "userUrl": "https://itunes.apple.com/us/reviews/id125985913",
    "version": "1.8.20",
    "score": 5,
    "title": "Great App!",
    "text": "Has really helped me get control of my social media usage.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11757859941",
    "userName": "Ruthie the Magma Cube",
    "userUrl": "https://itunes.apple.com/us/reviews/id542954141",
    "version": "1.8.20",
    "score": 5,
    "title": "Amazing!!",
    "text": "I’ve been using this app for a couple months and I can’t imagine iPhone life without it! I can finally keep up with my friends on social media or keep up with my favorite YouTube videos while managing studies! Previously my only option was to delete the distracting apps. Now I have freedom to use the apps the way I want instead of the apps using me. I started off with the $6/mo subscription but I love this app so much, I’m planning to buy the $100 one-time purchase.  If you’re hesitant, just try it!! I searched practically every other screen time app on the AppStore and none of them came close to this one. Get it!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11755708498",
    "userName": "阿啊啊啊啊煩",
    "userUrl": "https://itunes.apple.com/us/reviews/id874708655",
    "version": "1.8.20",
    "score": 5,
    "title": ".",
    "text": "..",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11754374989",
    "userName": "StupidFilms10",
    "userUrl": "https://itunes.apple.com/us/reviews/id223299574",
    "version": "1.8.20",
    "score": 5,
    "title": "Super helpful",
    "text": "It’s great that you can exclude apps such as navigation, where I’m not actually looking at the screen",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11744979705",
    "userName": "Fight Against Brain Rot",
    "userUrl": "https://itunes.apple.com/us/reviews/id1254097186",
    "version": "1.8.20",
    "score": 5,
    "title": "I am SUPER upset….",
    "text": "I’m upset I didn’t find Jomo sooner! I’ve tried everything to stop doomscrolling and take back my time—Brick, Opal, grayscale screens, deleting apps—you name it. It finally clicked for me: we live in a time where your attention is money. If you’re mindlessly giving away your attention, you’re just a monkey scrolling, feeding into this dopamine trap.\n\nBut enough with the negative stuff—Jomo saved my life. I can’t thank the creators enough because this app is truly a game changer. Before you complain, “Oh, it’s $30 a year,” just think: that’s like two drinks at a bar. And honestly, they should charge more because I want them to have the funds to take this even further (although it’s already incredible as is).\n\nJomo has completely changed my sleep, ended my doomscrolling, and improved my mental health. The best part? Squads. If you’re competitive like me, you’ll love the leaderboards where you can compete with friends and hold each other accountable. It’s fun, and we even have a group chat to stay on top of each other! (Hint hint, Team Jomo 👀)\n\nSeriously, thank you to the Jomo team for creating something that actually helps fight against the endless scrolling. I can’t wait to see this app take off—it’s the only one I truly believe can beat brain rot.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11742449186",
    "userName": "Leausm",
    "userUrl": "https://itunes.apple.com/us/reviews/id36125192",
    "version": "1.8.20",
    "score": 5,
    "title": "This app is my saving grace",
    "text": "Sometimes self discipline is making a choice to face fewer difficult choices. I love the customization of the time and days - I’m locked out of my dangerous apps all the time except 7 - 8 pm every day and Saturday evenings. I started with a hard lock out, and now I have enough self control that a 70-character random string is enough to keep me out except for “emergencies”. It took my brain not being drenched in Reddit and TikTok and YouTube to see that they’re actually more enjoyable in small doses. It won’t fix your life alone, but it is an incredible tool. I’ve communicated with both Laureline and Thomas about different things and they were  responsive and helpful. I’m about to renew my annual subscription, and I’m going get the lifetime option when I can swing it. Thanks y’all!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11736478261",
    "userName": "luck.harris",
    "userUrl": "https://itunes.apple.com/us/reviews/id604404717",
    "version": "1.0.3",
    "score": 5,
    "title": "Not a Game Changer, a LIFE Changer",
    "text": "If you download one app, ever, make it this one. \n\nIt will buy you back time, freedom, peace of mind, happiness, mental wellbeing, energy, creativity, human connection, and anything else your life has sacrificed to the digital gods. \n\nThis app and its iOS companion app are the single most powerful tools I've encountered to change your habits, tech usage, and by extension, your life. \n\nTry it out. I encourage you to try hard rules to see just how much you've come to crave digital distraction. It's humbling, and sobering. It makes you realize how necessary it is to change these patterns and habits to make technology serve us rather than the other way around. \n\nMy phone use got out of control during the pandemic, with screen time regularly above 4 hours a day (some days were 7, 8, 9).\n\nWith Jomo and some other life changes, it's around 35 minutes a day. Which is how it should be. \n\nWe were not meant to doomscroll. We were not meant to check notifications every few minutes. We were not meant to have to update the world every time we scratch our nose. \n\nTruly, without exaggeration, this app will change your life if you let it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11736166737",
    "userName": "Jine519",
    "userUrl": "https://itunes.apple.com/us/reviews/id1038200148",
    "version": "1.8.20",
    "score": 5,
    "title": "Do it.",
    "text": "This app is freaking awesome and its cross compatible with IPad. The time you get back makes this app well worth the cost. It’s also a lot cheaper than competitors. Do it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11735706719",
    "userName": "Ugh inhibitory",
    "userUrl": "https://itunes.apple.com/us/reviews/id371622080",
    "version": "1.8.20",
    "score": 2,
    "title": "Isn’t working",
    "text": "Hasn’t been working lately. I set a 20 min limit on Instagram but it allows me to go over and is not working right now. Maybe app needs an update",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11695801016",
    "userName": "kikster .",
    "userUrl": "https://itunes.apple.com/us/reviews/id458062950",
    "version": "1.8.18",
    "score": 5,
    "title": "Great App for a Fair Price",
    "text": "Jomo does everything you want a screen time app to do and has a lot of ways you can customize your limits and create temporary blocks for limited amounts of time. The best part is though it’s priced more fair than other popular apps that do the same thing.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11693139737",
    "userName": "eflo11",
    "userUrl": "https://itunes.apple.com/us/reviews/id1255381070",
    "version": "1.8.18",
    "score": 3,
    "title": "Good, but doesn’t always work.",
    "text": "I really like and have been greatly helped by this app on a grand scale! That said, whatever problem their is with the app’s synchronization needs to be fixed. It doesn’t work to use intentional breaks / limit screen time when the blocking feature doesn’t turn off when it’s supposed to. \nIf I’ve spent hours focused and can’t have my little break because the app won’t recognize I have one initiated, it leaves a bad taste in my mouth and defeats the purpose. I can’t get onto any of the apps on my phone I want to right now, and have opened and closed all apps and jomo several times. And this happens OFTEN. Please fix this bug, because I don’t want to have to delete this (otherwise very helpful) app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11685075807",
    "userName": "Bunhearts",
    "userUrl": "https://itunes.apple.com/us/reviews/id303775010",
    "version": "1.8.17",
    "score": 4,
    "title": "Nice app but simpler isn’t always better design wise",
    "text": "I REALLY appreciated the apps really neat design, from the icon to the blocking banners. Now it’s just so…boring? It had such a fun energy to it and it really stood out to me amongst all these apps trying to be more “modern”. Great app, but I think the design change was a misstep? Maybe it’ll grow on me, but it had so much character before. Kinda feels like it got neutered.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11675319821",
    "userName": "nicknametopostreviewz",
    "userUrl": "https://itunes.apple.com/us/reviews/id1695705233",
    "version": "1.8.16",
    "score": 4,
    "title": "great stuff but it keeps disconnecting for me!",
    "text": "Title says it all.  I like it enough to keep experimenting with it and to buy the lifetime stuff, but jomo struggles to connect to the screentime blocker on my ipad sometimes.  it's very frustrating since i either have to refresh the app to get back the connection or restart the device itself.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11671299711",
    "userName": "JohnsPearUsername",
    "userUrl": "https://itunes.apple.com/us/reviews/id371497448",
    "version": "1.8.16",
    "score": 5,
    "title": "Download the app if you actually want to limit screen time.",
    "text": "The 2 developers live in France. They respond to any feedback and answer your questions.\n\nIt’s a really great app. Very customizable and they have the emergency setting in case you “need to check” Instagram at 7pm on a Wednesday night. \n\nDownload it and customize it to your liking. It’s really a great app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11666269323",
    "userName": "Lucas2114",
    "userUrl": "https://itunes.apple.com/us/reviews/id154206536",
    "version": "1.0.2",
    "score": 4,
    "title": "Brilliant!",
    "text": "I am deleting my earlier review",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11649198694",
    "userName": "AllyG1213",
    "userUrl": "https://itunes.apple.com/us/reviews/id42858089",
    "version": "1.0.2",
    "score": 5,
    "title": "Absolutely changed my life for the better",
    "text": "I have ADHD and it was taking over my life for the worse. I couldn't concentrate. The Jomo team is incredibly innovative creating such a customizable app based on goals whether that is being active, meditation, work, spending time with loved ones etc. I don't know any other blocking app that ties blocking conditions to Apple Health. Something so simple but genius. The customer support is AMAZING. Very responsive. I have given them ideas to improve the app and see it implemented. Because of Jomo I've been meditating everyday for a month, which is a huge deal for me. Thank you <3",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11632123483",
    "userName": "Starr Rokk",
    "userUrl": "https://itunes.apple.com/us/reviews/id42897603",
    "version": "1.0.2",
    "score": 5,
    "title": "Great website blocker",
    "text": "I've tried a few website blockers and I think this is my favorite so far.  I love the messages you get when you try to visit a blocked site redirecting you to better endeavors.  I love that a subscription covers all your devices, and if you really need to get through, you can take \"breaks\".  I just wish my desktop website rules synced with my mobile website rules!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11629156333",
    "userName": "Shazkar",
    "userUrl": "https://itunes.apple.com/us/reviews/id18129088",
    "version": "1.8.16",
    "score": 5,
    "title": "Best I’ve tried - tons of customization",
    "text": "I never ever write reviews but this deserves it. I started simple here, a few time blocks. But you can go all in with rules, like I need to have meditated for 8 minutes to unlock any of my social media apps. The blocks can have a certain number of breaks and you can set the max time limit for the break. You can set the delay before taking a break. You can push a button to disable all apps except for the essential ones (eg phone and GPS) for a period of time. Really lets you nail in your ideal balance of friction and restrictiveness. Makes it way easier to cut back on scrolling than trying willpower or trying to cold turkey it. I know I can check IG if I want to… after my work day is done, and after I’ve meditated. If I really feel I need to check my IG messages for 5 minutes, I can do that twice during my block period. \n\nStellar. And it seems the developer is responsive and cares a lot.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11618700250",
    "userName": "Karalopez",
    "userUrl": "https://itunes.apple.com/us/reviews/id284829437",
    "version": "1.8.16",
    "score": 5,
    "title": "Great app",
    "text": "Loving it so far. I’m sticking to my screen time goals and it is easy to use.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11600333623",
    "userName": "Adalis14",
    "userUrl": "https://itunes.apple.com/us/reviews/id401375055",
    "version": "1.0.2",
    "score": 1,
    "title": "paying membership for strict mode useless",
    "text": "even when paying, app doesn't allow you to turn on strict mode on apps, websites, and adult content so you can always delete the session. Notfication saying \"strict mode cannot be enabled because session is always on\" Yet you can always just delete the session to turn it off. \n\nstrict mode only works for a limited time so you'd have to keep setting it up every single day giving you the option to simply not set it up.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11584882984",
    "userName": "oi hi lolsjajjss",
    "userUrl": "https://itunes.apple.com/us/reviews/id547994288",
    "version": "1.8.16",
    "score": 2,
    "title": "Its okay",
    "text": "Its a good app but the ‘suggested screentime’ keeps failing so its greatly frustrating when I need it to track how much screentime I have so its basically useless in the end so I deleted it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11539618802",
    "userName": "Kkk354",
    "userUrl": "https://itunes.apple.com/us/reviews/id269076984",
    "version": "1.8.16",
    "score": 5,
    "title": "Great app for saving some screen time",
    "text": "This app is user-friendly and surpasses the native screen time feature. It allows you to exclude productivity apps from screen time calculations, so you don't feel guilty about spending time on audio books. Additionally, you can add more friction to social media apps. It's impressive that a two-person team developed such a smooth and simple-to-use app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11535833770",
    "userName": "GeneralPlasma",
    "userUrl": "https://itunes.apple.com/us/reviews/id231509220",
    "version": "1.8.16",
    "score": 5,
    "title": "AMAZING AND USEFUL app",
    "text": "Has almost everything I need, I find writing down why I’m using an app especially useful, along with the block groups.\n\nA suggestion is that I’d also appreciate having a history of reasons why I open apps.\n\nVery good app!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11535066541",
    "userName": "joshua.icp",
    "userUrl": "https://itunes.apple.com/us/reviews/id932769001",
    "version": "1.0.2",
    "score": 5,
    "title": "It made me almost cry happy tears.",
    "text": "Subconsciously, I felt powerless against technology. This is a product clearly made with love, that I can use to protect myself.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11533545819",
    "userName": "SkittsMcGee",
    "userUrl": "https://itunes.apple.com/us/reviews/id1413592710",
    "version": "1.8.16",
    "score": 5,
    "title": "So far I like it",
    "text": "After not getting the results on AppBlock, I wanted to try something new once that subscription ran out. So far I think it’s amazing. I like the template that forces me to do something good prior to accessing any apps. I’ll be using that to make sure I get my daily devotional done. My fave feature is being able to set up strict mode for individual schedules which is something you can’t do on AppBlock. I was always able to disable strict mode and bypass all the schedules that way. Jomo has changed that for me. Once my trial is over I will be getting a year subscription.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11531690061",
    "userName": "Robobobert",
    "userUrl": "https://itunes.apple.com/us/reviews/id1512345923",
    "version": "1.8.16",
    "score": 2,
    "title": "Frequent glitches",
    "text": "The limits works most of the time but not every time, even with the paid version.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11490465635",
    "userName": "Fitzgerald2125",
    "userUrl": "https://itunes.apple.com/us/reviews/id410616660",
    "version": "1.8.15",
    "score": 5,
    "title": "I like it a lot! A few suggestions",
    "text": "I’ve been looking around for a while and I think this is my favorite one of these types of apps. I just wish you could manually add screen time from external sources. I would want to count watching TV or using my windows laptop as screen time, but the app doesn’t connect so I can’t count it. If I could manually add other screens and say I watched TV for an hour and add that to the total screen time, then it would be more accurate in my opinion. Also, I think the analytics could be better / more intuitive, as in being able to graph over time the pick ups vs screen time vs notifications etc., making a pie chart of your usage over a given period of time, or being able to filter the data to see how much of the last week or month has been taken up by certain categories. It would also be nice to choose the time period you can see rather than just a week or 28 days, and really just making the analytic section more user friendly and robust in general. For some reason it’s not graphing the data I had previous to getting the app even though it shows up in the daily Home Screen. Anyway, just some thoughts, but regardless it’s a great app and will be getting premium :)",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11489625641",
    "userName": "skasiba",
    "userUrl": "https://itunes.apple.com/us/reviews/id158680192",
    "version": "1.0.2",
    "score": 5,
    "title": "terrific app",
    "text": "I really like the way the jomo team sweats the small stuff and gets a lot of fine details right in their app design. I think the idea of explicitly writing out intentions when you use an app is amazing. I like to leave my messages and internet under a constant block, which I can take a break from by writing an intention. It makes sure I'm using the app with a goal in mind rather than just ambiently!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11486582589",
    "userName": "Taylor Hancock",
    "userUrl": "https://itunes.apple.com/us/reviews/id39304740",
    "version": "1.8.15",
    "score": 5,
    "title": "Life changing",
    "text": "Best screen limiting app, period, that’s before you even factor the affordability of their premium features.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11475373805",
    "userName": "Djjazzy101",
    "userUrl": "https://itunes.apple.com/us/reviews/id134943725",
    "version": "1.8.15",
    "score": 5,
    "title": "I don’t leave many reviews but this app is too good",
    "text": "Dude I love it. The strict settings help me not be distracted at work & I can put limits on how late I can use the apps. It’s helped a lot in my effort to reduce overall screen time & idk maybe read books or look out of my window every once in a while",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11475297070",
    "userName": "Ishmerai1",
    "userUrl": "https://itunes.apple.com/us/reviews/id575308705",
    "version": "1.8.15",
    "score": 5,
    "title": "Better than Opal",
    "text": "I love love love that you can do a one-time payment for a lifetime subscription with Jomo. It does the same things as Opal (except the leaderboards I think) but you don’t have to drop $99 every year.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11471903839",
    "userName": "BenjiSTK",
    "userUrl": "https://itunes.apple.com/us/reviews/id1479550187",
    "version": "1.8.15",
    "score": 5,
    "title": "Best screen time app",
    "text": "Well designed, cheap, effective.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11465268151",
    "userName": "YSman126",
    "userUrl": "https://itunes.apple.com/us/reviews/id295686208",
    "version": "1.0.2",
    "score": 5,
    "title": "Great App",
    "text": "Very user friendly. Thomas answered very quickly after I had a question. Very helpful! Download it now",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11444959210",
    "userName": "Lazy lifter",
    "userUrl": "https://itunes.apple.com/us/reviews/id383870057",
    "version": "1.8.15",
    "score": 5,
    "title": "Better & cheaper than Opal",
    "text": "I was a reluctant Opal user but did not like the UI and construction of rules. JOMO is also a bit difficult to use just because of complexity of the rulemaking, but it’s easier than Opal. It’s also cheaper and the blocks work reliably which was not the case with Opal.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11437555459",
    "userName": "Florp_the_second",
    "userUrl": "https://itunes.apple.com/us/reviews/id311390600",
    "version": "1.8.15",
    "score": 5,
    "title": "Very Straightforward to Use and Excellent Support",
    "text": "Jomo is very straightforward to use. The app provides a number of customizable App Limit templates based on your specific goals. For me, I simply select the apps I would like to limit (Reddit, Instagram, Twitter) and set a time limit. I like Jomo a lot more than the default Apple App Limits setting because the interface is easier to use, and it does not allow you to easily extend or eliminate the limit you have set for yourself.\n\nWhen I had a minor issue with the Reddit website not being picked up by Apple’s screen time logging (which Jomo uses to determine limits), the developers responded within 12 hours with a fix that worked (installing the Reddit app and adding it to the Block List).\n\nI would highly recommend Jomo as a tool for eliminating distractions, boosting productivity, and ultimately spending less time on your phone.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11430787861",
    "userName": "ghnhamed",
    "userUrl": "https://itunes.apple.com/us/reviews/id1577616590",
    "version": "1.8.13",
    "score": 5,
    "title": "Great app",
    "text": "It really helped me control my social media usage (no more doomscrolling)",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11427490328",
    "userName": "anderscarey",
    "userUrl": "https://itunes.apple.com/us/reviews/id203365031",
    "version": "1.8.13",
    "score": 2,
    "title": "Doesn’t work anymore",
    "text": "Jomo was worth the price when it worked, but unfortunately blocking no longer works properly. When pausing  blocking session, apps won’t actually be unblocked until you re-open Jomo, and worse, the blocking session won’t resume unless you re-open Jomo. This breaks the purpose of eliminating mindless opening of other apps as they’ll just stay available all day long.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11426609793",
    "userName": "rxbaez99",
    "userUrl": "https://itunes.apple.com/us/reviews/id192839147",
    "version": "1.8.13",
    "score": 1,
    "title": "Apple users BEWARE",
    "text": "The app is not Apple friendly designed application. I ended up deleting the app and uninstalled and canceled my subscription. I was unaware of some highly technically instructions that need to be followed by Apple users beforehand to prevent a glitch that will happen to Apple users from having their apps permanently locked without a way to remedy this. Apparently according to Jomo website guidelines, I will now have to contact the Apple store to have various apps that I use on the daily unlocked.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11416214208",
    "userName": "riship2_",
    "userUrl": "https://itunes.apple.com/us/reviews/id959093507",
    "version": "1.8.12",
    "score": 5,
    "title": "Great app for iPhone management",
    "text": "This app has helped me significantly to be intentional with my device usage, especially when I’m working, and gain back hours of my day. Before, I was using my phone upwards of 5.5 hours a day, mostly on social media. This meant I wasn’t spending much quality time with people or getting tasks done. With about 20 minutes of setting this app up exactly the way I want it, I can now make sure that I have time to enjoy social media while also using my phone as a tool for work and experiencing the world. It’s reasonably priced, offers a student discount, has great support, and has been very effective. Already recommended it to multiple people, I love this app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11411501964",
    "userName": "Jonfilion",
    "userUrl": "https://itunes.apple.com/us/reviews/id310136079",
    "version": "1.8.12",
    "score": 1,
    "title": "Scam, will take your money",
    "text": "They give you a \"trial\" and say they will notify you so you don't get charged. They never notified. Then when you ask for a refund they say you're not eligible. They will just take your money for an app that doesn't offer much.\n\nThe app itself isn't even worth it because there are free versions of the same on the app store already. Just get the free version if you need it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11399871706",
    "userName": "lying sellers",
    "userUrl": "https://itunes.apple.com/us/reviews/id1066508195",
    "version": "1.8.12",
    "score": 5,
    "title": "Best I’ve ever downloaded",
    "text": "Seriously, the title says it all! I feel so much more present and don’t just mindlessly scroll!! My social media time was cut in a THIRDDD since I’ve downloaded Jomo, and I feel better, and that’s not a coincidence!! 👏",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11399707580",
    "userName": "Yishayyy",
    "userUrl": "https://itunes.apple.com/us/reviews/id33027080",
    "version": "1.8.12",
    "score": 5,
    "title": "epic",
    "text": "epic app with epic support and epic tutorials. the best! much more affordable than opal too.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11394689518",
    "userName": "Dianasvet25",
    "userUrl": "https://itunes.apple.com/us/reviews/id745094367",
    "version": "1.8.12",
    "score": 5,
    "title": "Decreased my usage from 6hr to 1hr daily",
    "text": "Jomo is the best. You cannot override it, I love the little quotes that pop up every time I open the forbidden website, the tracking is accurate and nice. Great job guys!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11380812017",
    "userName": "Super funn-ness",
    "userUrl": "https://itunes.apple.com/us/reviews/id269939638",
    "version": "1.8.12",
    "score": 5,
    "title": "Glitchy but my screen time is down",
    "text": "The app is a little glitchy after the last iPhone update. But since installation my screen time is down by an average of two hours a day.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11379048952",
    "userName": "KingAzion",
    "userUrl": "https://itunes.apple.com/us/reviews/id353025126",
    "version": "1.0.2",
    "score": 5,
    "title": "So good. Beautiful UI, Amazing Customer Service",
    "text": "I've been a user of the mobile app for the last 6 months and just downloaded their mac app. \n\nFor starters their UI is beautiful. Threre are definitely some improvements that can be made but I trust that it will improve given time. \n\nThe power couple running it doing the design and engineering are very kind and on top of things. I look forward to seeing what they have in store and will definitely be purchasing a lifetime subscription eventually. I bought cold turkey recently before realizing they had a mac app and am so sad I did. Their app puts cold turkey (which is the OG mac management app) to shame. \n\nCheers!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11374636216",
    "userName": "ijyaaaaaaaaa",
    "userUrl": "https://itunes.apple.com/us/reviews/id287287483",
    "version": "1.8.12",
    "score": 5,
    "title": "Great mission and app!",
    "text": "I just got this app based on a friend’s recommendation. The UI / UX is great and it’s really beneficial that you can’t ignore the screen time limits. I read a bit about the founders and liked the mission / their stance on advertising on social media!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11371745336",
    "userName": "Aolany G",
    "userUrl": "https://itunes.apple.com/us/reviews/id599090918",
    "version": "1.8.12",
    "score": 5,
    "title": "Stop your research! This is it!",
    "text": "I did so much research before finding the right app. This is it: the design, user friendly app, at an affordable price JOMO is the one.it allowed me to gain my focus and stay super productive with a very demanding schedule. I have been telling all my friends about it !!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11367134165",
    "userName": "The Feet of a Statue",
    "userUrl": "https://itunes.apple.com/us/reviews/id506165417",
    "version": "1.8.12",
    "score": 5,
    "title": "$3 a month, highly customizable",
    "text": "i like it a lot, it’s a great price compared to (other) screen time apps. Total price rn is $36 per year or $3 a month. The app has like 10 different conditions for screen time usage. My favorite rn is the “opens” conditions. I have it set to 24 so that if i open my apps more than 24 times in a day then it locks me out of them. Very cool and budget friendly app! 👍😎👍",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11360574446",
    "userName": "Vic9289",
    "userUrl": "https://itunes.apple.com/us/reviews/id1010440277",
    "version": "1.8.12",
    "score": 1,
    "title": "Great app, disappointed though",
    "text": "I got this app to help with my phone addiction and it was great, until I found a feature to remove all blocking. Now everyone I get an urge I use the emergency mode. Wish the app did not have this, and instead have us contact support if needed for a block removal, adding a block of time between urges.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11347824524",
    "userName": "LoukasC",
    "userUrl": "https://itunes.apple.com/us/reviews/id508850306",
    "version": "1.8.12",
    "score": 5,
    "title": "Massive help, superior to Opal",
    "text": "I highly recommend this app to anyone who struggles controlling their screen time. Since I started using this app I have halved my daily screen time and feel much less distracted by my phone overall. There are so many great features that allow you to customize your blocks in the most effective way possible, all while being a fraction of the cost of competitors such as Opal.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11347652898",
    "userName": "aohxbnsosh",
    "userUrl": "https://itunes.apple.com/us/reviews/id1084001116",
    "version": "1.8.12",
    "score": 5,
    "title": "Come from Opal and did not regret",
    "text": "UI/UX so much better, great customer service, great features.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11346327481",
    "userName": "jdub812",
    "userUrl": "https://itunes.apple.com/us/reviews/id29891674",
    "version": "1.8.12",
    "score": 5,
    "title": "Not sure how you could go with anything else!!",
    "text": "This app is top notch!!! I spent a few months with Opal but for what it gives and the ridiculous cost they require to open up a few extra capabilities it was tough for me to pull the trigger on the app blocker. I found out about JOMO on a YouTube review about productivity and I am shocked how robust the features are and how this team continues to add relevant features. I don’t see how any one would use another app with the value this one provides. It does everything the top apps in this space do and way more. Don’t hesitate, download the app and subscribe, you will not regret it.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11320275601",
    "userName": "whyareallthesetaken",
    "userUrl": "https://itunes.apple.com/us/reviews/id446489933",
    "version": "1.8.11",
    "score": 5,
    "title": "Amazing app",
    "text": "Better than Opal. Clean, easy, and very customizable. Has everything I needed and more.. plus it’s a great price for the pro features compared to Opal who charges way too much money.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11319397064",
    "userName": "dndhdiiernnrennejeskoddkjd",
    "userUrl": "https://itunes.apple.com/us/reviews/id1073495212",
    "version": "1.8.11",
    "score": 5,
    "title": "Great app",
    "text": "Lots of customization options and powerful configuration for helping you reduce your screen time. Worth the subscription when you consider how much of your most valuable resource (time) Jomo helps you claw back from mindless phone usage.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11301851391",
    "userName": "Wastee",
    "userUrl": "https://itunes.apple.com/us/reviews/id110080760",
    "version": "1.0.2",
    "score": 4,
    "title": "Very good app, with some requests for improvement",
    "text": "All in all, this is a very good app and generally does what it says it will do. It's one of those apps that requires willpower, but once you build it into your practice it becomes part of your daily flow.\n\nA few comments thus far:\n1. I have noticed that on my phone, triggering a break doesn't open apps back up nearly half the time I do it. This seems like a bug that should be addressed.\n2. Request: add calendar integration so that I can dynamically trigger sessions based on events.\n3. Request: Enable full size on Mac. When using the app on my main monitor, it is pretty small and the size cannot be adjusted.\n4. Request: enable sync between devices. Understand the limitations, but perhaps allow it for sessions that specifically filter webpages.\n\nI do still recommend this app and look forward to its continued development. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11295917108",
    "userName": "boble60",
    "userUrl": "https://itunes.apple.com/us/reviews/id546897315",
    "version": "1.8.11",
    "score": 2,
    "title": "you can just turn it off by disabling “screen time restrictions” in settings",
    "text": "it was a 5 star before my kid found out about this. i would have no problem putting it back at a 5 star if theres a way to actually lock that in place. looked on the website and couldn’t find anything about it. uhg.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11289245065",
    "userName": "True Nugget",
    "userUrl": "https://itunes.apple.com/us/reviews/id31603820",
    "version": "1.8.11",
    "score": 5,
    "title": "Favorite Screen Time Tracking App",
    "text": "I’ve previously tried many screen time/blocking apps and ended up deleting them almost immediately. Jomo is simple to use but with quite a bit of functionality to make it fit my needs and habits. Simple things like Being able to not count certain apps has made a huge difference!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11277927419",
    "userName": "Lauren Lives Again",
    "userUrl": "https://itunes.apple.com/us/reviews/id451682871",
    "version": "1.8.10",
    "score": 3,
    "title": "It’s good but maybe I’m not using it properly",
    "text": "I’m enjoying the app. I love that it dims distracting apps on my phone so I know I can’t access them. Couple things I’ve noted in my use:\n\n• Not sure if there was a proper walkthrough of each restriction option when I got the free trial, but I found I stuck to “Conscious Break” because that’s the first one I tried and didn’t know how the others worked. A pop up walkthrough would definitely encourage me to use more features\n\n• I wish I could personalize the timer on how long I have to wait to take a conscious break. So, it starts at 5-6 seconds, but I need that to be at least 15 in order for me to give up and go back to my task (for a truly conscious break). Worried it created a bad habit where I just set my phone down and wait for the longer countdowns and take an unconscious break because the 5-6 second unlock time was too easy to get through\n\n• I’m really not sure if there’s anything you can do about this one 😆 but when using the intention unlock feature, I’ve just typed a random letter to unlock it. Sometimes I use it properly—that helps my ADHD brain stay focused for sure. But I definitely get around it too quickly for it to be a truly conscious break\n\n• It’d be great if the notifications of “time to get back to focusing” didn’t happen 30 seconds before the app closes. I wish it’d be more like 2 minutes before so I can save a video for later or wind down from my feed. I get frustrated and always fear losing the post when it kicks me out way too quickly.\n\nI only tried the free version of Opal, but that was a little too hard to get into apps, and I think I rebelled a bit by the end and didn’t want to restrict myself at all. I like the flexibility of Jomo instead.  \n\nOverall, I’m not sure if I like this app or Opal Better. I think price is much better here. If you guys gamify Jomo the way Opal does (theirs is a bit overkill though) and tighten up some features, you’d have an incredible product.\n\nAll that being said, it’s definitely helped me focus. Keep up the good work.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11271439559",
    "userName": "rockyourbodynow",
    "userUrl": "https://itunes.apple.com/us/reviews/id39443550",
    "version": "1.8.10",
    "score": 5,
    "title": "The only app that has ever worked for me",
    "text": "This app is seriously helping me use my phone more responsibly.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11236994904",
    "userName": "MichelleWaw",
    "userUrl": "https://itunes.apple.com/us/reviews/id1414200889",
    "version": "1.8.9",
    "score": 5,
    "title": "Love it",
    "text": "This app helped me reduce my screen time from 4 hours to 2 hours",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11226234458",
    "userName": "An0n7m0uZ",
    "userUrl": "https://itunes.apple.com/us/reviews/id547476788",
    "version": "1.8.9",
    "score": 5,
    "title": "JOMO>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>opal",
    "text": "JOMO is legit so much superior to opal, it’s barely even competition. I 💜 JOMO forever 💜💜💜💜💜💜💜🎉🎉🎉🎉🎉🎉🎉 thank you for not being an annoying app like opal and actually being a good app",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11195358898",
    "userName": "alt-ness",
    "userUrl": "https://itunes.apple.com/us/reviews/id87614425",
    "version": "1.8.8",
    "score": 1,
    "title": "App picker is not functional",
    "text": "There is a note about how it’s developed by Apple and may be unstable, but this is a total dealbreaker. The help documentation was not helpful.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11183307785",
    "userName": "arsenelupinx",
    "userUrl": "https://itunes.apple.com/us/reviews/id32262098",
    "version": "1.8.8",
    "score": 5,
    "title": "Great! Insta subscribe!",
    "text": "JOMO is lovely. It’s a thoughtful approach to the screen time issue and it’s made by people who very much care. I came across it via a Reddit post after I saw the incredibly high price that Opal was charging - I knew that someone a bit more civic-minded is probably out there. That was true! It’s JOMO. JOMO has very clear tracking, and different blocking templates which you can choose to tailor your experience. I started by blocking the two sites I spent the most of my doomscrolling time on, and received very pleasant screens which encouraged me to be more mindful of my use when I did try and log on to them. I have a couple of nitpicks on the design but honestly I have to say that it’s 10/10 for what I need: something that gently gets in the way between my impulses and my attention. Plus - supporting an independent app creator on a mission just feels good!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11165874865",
    "userName": "revodevo",
    "userUrl": "https://itunes.apple.com/us/reviews/id127454343",
    "version": "1.8.8",
    "score": 5,
    "title": "Great app and lovely devs",
    "text": "I have never reviewed an app (I don’t think) but I wanted to stop here and make a note. I LOVE Jomo and how easy and flexible it is—it’s a phenomenal app (my screen time is down by EIGHTY PERCENT!!). But the reason I feel a need to review is the super responsive dev team—I had a specific, niche issue to solve and not only did a dev respond to me directly, they worked through how to solve the issue and sent me a video!! Just absolutely incredible team. I’m so happy to pay for the premium and support this app and this team.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11163405078",
    "userName": "jhm1902",
    "userUrl": "https://itunes.apple.com/us/reviews/id125919313",
    "version": "1.8.8",
    "score": 5,
    "title": "Highly useful app with very responsive team",
    "text": "It's not completely perfect but the devs seem to be working actively to get it that way. I've messaged with them a few times and they are very responsive (despite my being a bit obtuse). Overall the app is really helping me stay productive as a someone who has long struggled with adult ADHD. The premium version is well worth the price.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11151071042",
    "userName": "PointyHeadFred",
    "userUrl": "https://itunes.apple.com/us/reviews/id28973900",
    "version": "1.0.2",
    "score": 5,
    "title": "Jomo is a great alternative to expensive Opal",
    "text": "Opal is too expensive and does the same thing. Fight the man, join the little guys.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11142218134",
    "userName": "Gra. B.",
    "userUrl": "https://itunes.apple.com/us/reviews/id1227613440",
    "version": "1.8.8",
    "score": 5,
    "title": "If your thinking about it, get the app",
    "text": "This app helped me cut my screen time down instantly. I *love* how customizable it is, I can block only what I want when I want it how I want to. I don't have premium, but I for what I need it for (keeping myself of YouTube during school 😅) I don't need it. I'm so grateful for how much on this app they let be free, it's a really really good app.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11137545574",
    "userName": "Lindsyyyyy",
    "userUrl": "https://itunes.apple.com/us/reviews/id397887936",
    "version": "1.8.8",
    "score": 5,
    "title": "Best app for adhd",
    "text": "I actually paused my membership because I’m going out of town and restarted it when I saw the update",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11137413567",
    "userName": "bmmhansen",
    "userUrl": "https://itunes.apple.com/us/reviews/id38162839",
    "version": "1.8.8",
    "score": 5,
    "title": "Finally controlling my screen time",
    "text": "I love Jomo. Like many, I struggle to stay off my phone and I often find myself mindlessly scrolling when there are other things I should or could be doing. Jomo has helped me to curb my usage and keep it in check. I pay for the premium version because I like having multiple different sessions set up for work, home, and nighttime. I like that it’s more flexible than apple screen time, but I can also set it up so I can’t unblock my apps (one of the biggest downsides of apple screen time imo). I also love that it’s on Mac too so I can control my screen time on my computer.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11125308638",
    "userName": "Bisbya",
    "userUrl": "https://itunes.apple.com/us/reviews/id1643354337",
    "version": "1.0.2",
    "score": 5,
    "title": "Super helpful",
    "text": "Jomo has helped me focus so much! If i even try to open another tab, it immediately shields me from searching anything and gives motivational little popups each time which i find really interesting. the features are super helpful since you can make your own sessions and block specific websites or even block every website except the ones you want to work on which i find very efficient. I searched for so many apps to help me focus but this app is the only one that has done that job properly",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11104765880",
    "userName": "slinkp23",
    "userUrl": "https://itunes.apple.com/us/reviews/id1553445086",
    "version": "1.8.7",
    "score": 1,
    "title": "Doesn’t work anymore",
    "text": "When I take a break, my restricted apps are still blocked. Taking a break used to work. I have to uninstall this app now.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11102016840",
    "userName": "chris8714",
    "userUrl": "https://itunes.apple.com/us/reviews/id32640697",
    "version": "1.8.7",
    "score": 3,
    "title": "Lots of bugs",
    "text": "For a paid subscription-based app this has way too many bugs. About 20% of the time, the apps don’t automatically unlock when they’re supposed to. When you take a break” to try to use an app, they often don’t automatically unlock at that time, either. The solution? Restarting your phone. It’s a pain. I wish I could get my money back.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11096616961",
    "userName": "Vexedx10",
    "userUrl": "https://itunes.apple.com/us/reviews/id21591102",
    "version": "1.8.7",
    "score": 5,
    "title": "Amazing app and support",
    "text": "I’m not usually one to write a review but Jomo is amazing and has helped me and my family use our devices more mindfully.   Also, I had a question on a subscription and the I heard back from support immediately and they went above and beyond to provide exactly what I needed and more.  I highly recommend this app and company.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11093721200",
    "userName": "Mister jahooley number 24351",
    "userUrl": "https://itunes.apple.com/us/reviews/id428309954",
    "version": "1.8.7",
    "score": 5,
    "title": "life changing!",
    "text": "this app helped me get control of my screen time! i used to spend 3-4 hours on social media every day, but now i never pass 1 hour, and i block myself off at night and in the morning when it’s the most dangerous. thanks jomo!!",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11089129925",
    "userName": "gco3rea92",
    "userUrl": "https://itunes.apple.com/us/reviews/id236183984",
    "version": "1.8.7",
    "score": 2,
    "title": "Good app. One MAJOR flaw",
    "text": "Look this is a good app but it had a major major flaw. You can simply go into screen time settings and disable Jomo permissions effectively rending it useless. Now they will tell you you can setup a shortcut to try and avoid this and it's possible but fundamentally for something that's asking for this much money it shouldn't have this flaw. The reality is apps like opal and Jomo all they do is plug into the offering screentime settings give you already with some granularity.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11065119832",
    "userName": "stackoverflow1",
    "userUrl": "https://itunes.apple.com/us/reviews/id20075136",
    "version": "1.8.7",
    "score": 5,
    "title": "Huge improvement over the iOS Screen Time settings",
    "text": "I’ve been a power user of the iOS screen time settings for a while now, and Jomo has been a great improvement. The ability to fine tune behavior around time of day, breaks, and apps is exactly what I’ve been waiting for iOS to implement. The app also seems more stable/reliable than the vanilla iOS settings.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11056391821",
    "userName": "SavvyKL",
    "userUrl": "https://itunes.apple.com/us/reviews/id372390309",
    "version": "1.8.7",
    "score": 5,
    "title": "Best screen time app I have ever used",
    "text": "I have type one diabetes and all of my medical devices I wear to help keep me living are controlled using apps on my phone. For this reason I must have my phone on me 24/7. When I first started wearing these medical monitors and having to carry my phone everywhere it was so exhausting. I struggled to stay off my phone 24/7 and wished I could just do something without having my phone with me. I am so thankful I found this screen time app. It made all of the difference for my mental health. I went from scrolling 24/7 to having firm boundaries with my phone I could not break. I tried others before Jomo and many of them were not only more expensive but they also had a ton of glitches. After switching to Jomo I will never go back to another. Even family members have commented on the positive differences they have noticed since I started using this app. If you are considering using it I would 100% recommend this app without hesitation.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  },
  {
    "id": "11053049656",
    "userName": "barbiegirl318",
    "userUrl": "https://itunes.apple.com/us/reviews/id5949818",
    "version": "1.8.7",
    "score": 5,
    "title": "I love this app!",
    "text": "This app has helped a lot as far as using my phone less and with intentionality. Sometimes there are glitches, but it’s a newer app so I’m okay with that. Customer service is OUTSTANDING. I’ve never encountered such helpful and kind customer service anywhere, ever. I can’t say enough about the customer service and the help you’ll receive when you reach out. I absolutely will continue to use and support this app and recommend to my family and friends.",
    "url": "https://itunes.apple.com/us/review?id=1609960918&type=Purple%20Software"
  }
]