[
  {
    "id": "12358587836",
    "userName": "YeetyKong",
    "userUrl": "https://itunes.apple.com/us/reviews/id1052221098",
    "version": "5.2",
    "score": 5,
    "title": "The best one second a day app but",
    "text": "Please turn off the notification that happens every single day at midnight",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12343782502",
    "userName": "ClareMarie34",
    "userUrl": "https://itunes.apple.com/us/reviews/id392334355",
    "version": "5.2",
    "score": 5,
    "title": "A Diary for Life",
    "text": "Have been using this since the pandemic. I love how one day creates a story that you don’t know how it’ll unfold until you see it come together at the end of the year. \nLove sending Birthday snippets for my loved ones with their moments I’ve had with them over the last 5 years.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12323481031",
    "userName": "ayaliejs",
    "userUrl": "https://itunes.apple.com/us/reviews/id825282089",
    "version": "4.15.0",
    "score": 5,
    "title": "Amazing app",
    "text": "This is such a great app—I've been using it for years! I like being able to unlock new app icons but I wish there were a black and white icon and I also think it'd be cool if there were a 2,000 snippets icon that's gold.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12273082502",
    "userName": "zeroellie",
    "userUrl": "https://itunes.apple.com/us/reviews/id426751332",
    "version": "5.1",
    "score": 5,
    "title": "The Best 1 Second App!",
    "text": "I’ve been using this app for several years now, and it’s consistently been a very fun way to capture memories and have a nice journal at the end of the year. Several friends of mine ask about seeing my one second, because it really is such a wonderful experience. The main reason I’m writing this review after all these years is to commend the developers and 1 Second team for their dedication to providing a great user experience. They have a forum in which you can make suggestions, upvote posts you agree with, and what really stands out to me is that the development team actively engages with the forum. There was an update that made it more difficult to use the app, and I was overjoyed to see that their team had responded to the most upvoted post on the forum about changing it back, and saying that they were working on it. A week or so later, I got an email saying that the post had been resolved, and when I went on the app, it was back to how it was before! I would just like to express how much I appreciate the team being responsive to their user’s opinions and providing a community forum where user input is valued. When I first saw the update, I was distraught because I assumed I would have to try to find an equivalent to the app I love, as I’m so used to user input being like speaking into a void. I was very pleasantly surprised to find how easy it was to access the forum where I could express my opinion about the update, and even more delighted to have such a quick response to the issue and it being corrected so promptly. Thank you to the 1 Second Everyday team for caring about the people who love the app, and for actually valuing its consumers. Since discovering this app in 2019, collecting memories to add to it has become a routine part of my life. It’s super helpful to have an actual reason and reminder to capture the moments I spend with my friends and such :) I’ve recommended the app to several people and will continue to do so, y’all rock!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12254628409",
    "userName": "dhgddfggdfg",
    "userUrl": "https://itunes.apple.com/us/reviews/id1252342862",
    "version": "5.0.3",
    "score": 1,
    "title": "Free trial is useless",
    "text": "Literally. Got free trial of pro. Still can’t use pro.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12217982839",
    "userName": "luckyyyboi",
    "userUrl": "https://itunes.apple.com/us/reviews/id634441455",
    "version": "5.0.3",
    "score": 1,
    "title": "App doesn’t work",
    "text": "Annoying I tried to press start and nothing happens canceling my membership",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12211956261",
    "userName": "Gmurra",
    "userUrl": "https://itunes.apple.com/us/reviews/id645919305",
    "version": "5.0.3",
    "score": 5,
    "title": "The best journal app",
    "text": "This is one of my favorite apps. I love the ease of creating videos and memories for myself without feeling like I have to create it through Instagram. The customer service is also really great anytime I’ve had issues. If you are a new parent and want an easy way to look through your inevitable hundreds of photos/videos of your kids over the years, this is the perfect app for it.  I cannot recommend it enough!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12208955431",
    "userName": "Ungiereviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id14994196",
    "version": "5.0.3",
    "score": 5,
    "title": "Awesome App",
    "text": "I’ve been using this app everyday for 5 years. It’s part of my daily routine and brings me a lot of joy. The app is stable and easy to use, and the subscription is priced appropriately.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12205007406",
    "userName": "Martinxzkdg",
    "userUrl": "https://itunes.apple.com/us/reviews/id126487865",
    "version": "5.0.3",
    "score": 3,
    "title": "Updates are almost always disappointing",
    "text": "I do like this app quite a bit. Unfortunately, they mess around too much with a good product. I'd say if it ain't broke, don't fix it, but they often do. For example, I very much enjoyed that I could create a new snippet and post it to multiple projects at once. They just removed that feature for no apparent reason. Very annoying.\n\nThis has happened many times in the past – they supposedly improve the app, but actually make it worse. \n\nAn update a few weeks ago, for example, reset all my projects so the branding that I had turned off was turned back on. That was really cheap.\n\nTheir product team and their QA are disappointing.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12184629948",
    "userName": "Video art lover",
    "userUrl": "https://itunes.apple.com/us/reviews/id136036871",
    "version": "5.0.3",
    "score": 5,
    "title": "Fun app!!",
    "text": "I use it everyday as my journal.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12179331808",
    "userName": "Jeff Daley",
    "userUrl": "https://itunes.apple.com/us/reviews/id22544119",
    "version": "5.0.3",
    "score": 5,
    "title": "Who Knew That Watching A Movie About Your Life Could Be So Much Fun?",
    "text": "The design and thoughtfulness that went into this app is so apparent and appreciated. I absolutely love it!  I've been loading videos year by year onto my Iphone and to see a calendar full of orange days is exciting and addicting.  I literally want to find every video that I have and more importantly I'm so inspired to make the next day's second as memorable as it can be.  The process of snipping your favorite second of the day couldn't be easier and most importantly it's so much fun. Thank you!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12179018124",
    "userName": "Oliver Fox McCade",
    "userUrl": "https://itunes.apple.com/us/reviews/id142056313",
    "version": "5.0.3",
    "score": 5,
    "title": "Customer",
    "text": "Wonderful review and reminder. Great customer service.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12168829714",
    "userName": "SadieLikesGeese",
    "userUrl": "https://itunes.apple.com/us/reviews/id1671628290",
    "version": "5.0.3",
    "score": 5,
    "title": "😗👌",
    "text": "It’s a really great app, good at reminding you to do it, but doesn’t get too crazy like Duolingo. I enjoy clicking in the app and watching memories from the past year or so. Pretty easy to use, easy to customize. There are some ads, and they are all mostly to get the premium edition. You can change the app icon based on how many clips you have which is really fun.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12164236573",
    "userName": "Ruth Parada",
    "userUrl": "https://itunes.apple.com/us/reviews/id416848153",
    "version": "5.0.3",
    "score": 5,
    "title": "Great memories",
    "text": "We used this app to document our daughter’s first year, and the compilation is one of my favorite videos ever. She’s 13 months now and we’re still keeping up with her daily clips, starting a new yearly tradition for her and any future kids. I just love seeing the slow progression of her growth in the span of a 10 minute video.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12163970925",
    "userName": "Dru_67",
    "userUrl": "https://itunes.apple.com/us/reviews/id1076117359",
    "version": "5.0.3",
    "score": 5,
    "title": "One of my favorite apps!",
    "text": "I’ve been using this app daily for the last 5 years. It’s so simple to use and edit your videos. It gives me a way to look back at all I’ve done and remind me of the interactions that make us human. The support is super friendly and helpful as well! Give it a try!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12159286093",
    "userName": "Lexivh",
    "userUrl": "https://itunes.apple.com/us/reviews/id109766227",
    "version": "5.0.3",
    "score": 3,
    "title": "Used to be great, new update is not user-friendly",
    "text": "I've been using this app every day for two years, and before that off and on for three years. It was always pretty intuitive to be able to take a video right in the app, the new update in January 2025 has made it a multi step process, and not particularly easy to get there. Hopefully this is fixed soon.\n\nOn a separate note, I am constantly being sent emails saying that my projects/data is going to be deleted because it's not backed up. After logging in and checking, it is backed up. Frustrating to get these sorts of emails about once a month.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12155682599",
    "userName": "Ibdetny",
    "userUrl": "https://itunes.apple.com/us/reviews/id232850397",
    "version": "5.0.3",
    "score": 1,
    "title": "Wont Load",
    "text": "Spent one whole year 2024 using this app everyday and it won’t load my. year. I keep getting error 1004 message. I must say. I downloaded it for a specific reason and now it doesn’t work after 365 days! Very Disappointing!! \nI don’t recommend at all.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12154312553",
    "userName": "Ang.pilie",
    "userUrl": "https://itunes.apple.com/us/reviews/id108643674",
    "version": "5.0.3",
    "score": 5,
    "title": "Best App Ever",
    "text": "I’ve been making videos with this app for a couple of years now.  It’s so easy to use and makes the best memories for me and my family.  I always get asked how I make my videos because they are so professional looking.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12154226277",
    "userName": "HBenac",
    "userUrl": "https://itunes.apple.com/us/reviews/id8908464",
    "version": "5.0.3",
    "score": 3,
    "title": "Small changes make it not as great but still love the app",
    "text": "First off, I’ve been using this app for several years to make sweet yearly videos of my kids. It’s incredible to see how much they grow in just one year and they get a big thrill out of watching their videos. They continue to make changes to the app that are annoying however. Now the clip captions are a hidden field only accessible after adding the clip. Wish that was a default field like it used to be. Also, because the premium version is really expensive for an app, I stick with the free version. I appreciate that I have the option to add more than 2 clips to a day but the required ads are incredibly obnoxious, have gotten longer and now I have to watch the almost one minute ad for every extra video clip over the standard two. It used to be that if I watched an ad once per calendar date, all the extra clips for that day would be covered. Please fix these changes if you don’t want to drive your user base away.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12152843431",
    "userName": "Noneknowme",
    "userUrl": "https://itunes.apple.com/us/reviews/id285619431",
    "version": "5.0.3",
    "score": 1,
    "title": "1",
    "text": "Please bring back the camera on the home dashboard. It is tedious and time consuming to go into the calendar to add a snippet. And it’s making me not want to capture my day. Also please stop with pushing pro. It is annoying to have to close out of it every time I open the app. I know it’s an option.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12151872304",
    "userName": "Ron DiMaggio",
    "userUrl": "https://itunes.apple.com/us/reviews/id160860072",
    "version": "5.0.3",
    "score": 1,
    "title": "Subscription Kills Yet Another App",
    "text": "Why do you need a subscription model for something like this? It’s ruined it and has only shown greed. There’s other apps that can do this without telling the App Store users that they are nothing but a constant money stream.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12149655445",
    "userName": "Effunia",
    "userUrl": "https://itunes.apple.com/us/reviews/id276648857",
    "version": "5.0.3",
    "score": 4,
    "title": "Newest update broke being able to add songs",
    "text": "*thank you for fixing the bug with being able to add your own music* \n\nOverall I like the app, but the newest update broke being able to add my own music. You can only add their provided music. I also wish you could choose between horizontal or vertical videos as well as being able to add multiple music tracks. The clipping of the videos isn’t as precise as I’d like it to be, often I have to select a clip, watch it and readjust because it’s a few seconds too early or past the point I wanted captured.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12145560573",
    "userName": "amoonicole",
    "userUrl": "https://itunes.apple.com/us/reviews/id890350476",
    "version": "5.0.3",
    "score": 1,
    "title": "constant glitches",
    "text": "for some reason, the app freezes any time i attempt to retroactively add snippets. i can only add snippets day of, and can no longer upload from my photo library. i have to full close the app if it freezes, otherwise nothing works.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12144945407",
    "userName": "artisticaviary",
    "userUrl": "https://itunes.apple.com/us/reviews/id109133688",
    "version": "5.0.3",
    "score": 2,
    "title": "Aggressive advertisements have made this app clunky to use",
    "text": "When I first started using this at the beginning of 2023, it was great. But since then, the in-app advertisements for their expensive “pro” version have slowly become completely obnoxious to the point of being off-putting. The ads for premium are aggressive— you can’t even add a second to your day without one popping up.\nI like your app and would be happy to pay a few dollars one time for a premium version, but not $50/year! Your pricing is ridiculous and I’ve had to stop recommending the app to my friends and family because of the ads.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12142918745",
    "userName": "Dee6209Anne",
    "userUrl": "https://itunes.apple.com/us/reviews/id768280302",
    "version": "5.0.3",
    "score": 5,
    "title": "So many beautiful memories",
    "text": "I started doing this the year I got married, and now 9 years and 3 kids into our marriage it is so wonderful to look back on how much our life has changed, how our kids grow day by day, and just to see all these moments in our life that would’ve otherwise been forgotten. It’s crazy how seeing a 1 second clip can remind me of a whole day or event. The app only gets better each year, I’m so thankful for this!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12142032297",
    "userName": "Just another reviewer ngl",
    "userUrl": "https://itunes.apple.com/us/reviews/id1736659576",
    "version": "5.0.3",
    "score": 5,
    "title": "Nice",
    "text": "It’s really cool to look back through a whole year, my mom shared hers to us (her kids) and some of the snippets were really funny. It’s nice to look back on a while year in about ten minutes.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12140702013",
    "userName": "1flychicken",
    "userUrl": "https://itunes.apple.com/us/reviews/id23680487",
    "version": "5.0.3",
    "score": 1,
    "title": "Poor customer support, no resolution",
    "text": "I paid for this app before it became severely overpriced. Even with the receipt, no one could help me. I was, instead, passed from rep to rep with huge delays in responses. Clearly they don’t care about their customers or the people that believed in their business before they were so large (and greedy). Horrible experience.\n\n*an update to their comment: like I said above, I already tried to get help and it was refused/denied. Did you even read the above?",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12140155373",
    "userName": "meh1551",
    "userUrl": "https://itunes.apple.com/us/reviews/id1010694918",
    "version": "5.0.3",
    "score": 3,
    "title": "Feature removed - not as good",
    "text": "The most recent update took away a feature on the home page that made the app for me. Now I get frustrated opening the app.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12139849895",
    "userName": "Joerugger",
    "userUrl": "https://itunes.apple.com/us/reviews/id25674328",
    "version": "5.0.3",
    "score": 5,
    "title": "Great App",
    "text": "Great app, been a subscriber for several years. The latest update, v5 broke the ability to add your own music. I hope they fix it soon.\n\nThey fixed the issue!  Pay for the app. It’s worth it!!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12138038304",
    "userName": "Maoyou Pi",
    "userUrl": "https://itunes.apple.com/us/reviews/id401923495",
    "version": "5.0.3",
    "score": 3,
    "title": "Alas the ads",
    "text": "Among the many ads that are mandatory to watch these days in order to have more than one clip per day, I certainly prefer the scammy&short Jackpot ads(15s) than the legit&long Dropbox ads(60s). Worst still are the candy crush ads that claim to be 20seconds but freeze and turn into 30 seconds in the end. That’s 30 seconds in exchange for 1 — for what I regard as a thoughtfully crafted app, maybe at least eliminate the ads that encourage people to gamble money in a game rather than at the casino?\n\nI’m just waiting for the photos app to evolve into something that just compiles clips automatically in the background so I can eventually stop relying on this one.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12137725496",
    "userName": "december 31, 2019",
    "userUrl": "https://itunes.apple.com/us/reviews/id1020758522",
    "version": "5.0.3",
    "score": 5,
    "title": "best decision i’ve ever committed to",
    "text": "this is my 5th year ofc 1se and i love ts, i didn’t think id stick to it this long but now its part of my routine. i love looking back each month and seeing my life, it makes me really happy! especially at the end of the year getting to watch everything",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12133067345",
    "userName": "Nibor588",
    "userUrl": "https://itunes.apple.com/us/reviews/id116598373",
    "version": "5.0.2",
    "score": 1,
    "title": "Constantly freezes and looses edits",
    "text": "So frustrating. App constantly freezes up and then looses edits I’ve made.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12133010495",
    "userName": "Sparky1010",
    "userUrl": "https://itunes.apple.com/us/reviews/id41270158",
    "version": "5.0.2",
    "score": 2,
    "title": "UI refresh why??",
    "text": "In 5.0.2, I don’t have a button to quickly take my 1 second… why!? That’s the major point of the app. Why does it take 4 clicks to get to the spot to record it!?",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12132583177",
    "userName": "Charleslive00",
    "userUrl": "https://itunes.apple.com/us/reviews/id429547349",
    "version": "5.0.2",
    "score": 5,
    "title": "the greatest time capsule",
    "text": "this app is incredible. i have been using this for 6 years and to see my life, day by day, is so beautiful. I have my main “life” project, which I occasionally journaling and have clips from most days for the past six years. From that I have these branches that I have created such as moments in nature, different cities, I’ve lived in or for specific friends or aspects of my career. So beyond just my main life, I do have all these other montages of specific areas or people. this is a great gift when celebrating an anniversary or a friendship because especially if they aren’t expecting, it can be such a wonderful gift to them! It synced to the cloud and I don’t have to worry about it disappearing. Be able to watch each year and review at the end of the year is wonderful because it truly puts into perspective how full my life is. I can also hide things if I want it just for me and I can journal moments within the journal settings. There are times like a week or months without posting and it’s so nice because they have a feature that doesn’t auto fill so everything from your camera roll just gets put into the week or month you choose and you can fill in that space. it can also turn Live Photos into video which is such an useful feature. I’ve gotten in the habit of taking video or photos often so that can always translate into this app easily. This is truly been a life-changing app and for the decades to come I’m so excited to watch my life story.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12131282618",
    "userName": "Katadele",
    "userUrl": "https://itunes.apple.com/us/reviews/id87689409",
    "version": "5.0.2",
    "score": 3,
    "title": "New update is awful",
    "text": "I’ve loved this app and have happily paid for the extra snippets for years but this new update is really screwed up. Please go back to the way it was before!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12129958646",
    "userName": "missmegannnnn",
    "userUrl": "https://itunes.apple.com/us/reviews/id495962264",
    "version": "5.0.2",
    "score": 4,
    "title": "Had to delete and redownload the app to get the “my music” feature to work again",
    "text": "I had to redownload the app after it updated to fix the music issues, other than that, it’s a solid app.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12128492689",
    "userName": "koalaslothcat",
    "userUrl": "https://itunes.apple.com/us/reviews/id40869462",
    "version": "5.0.2",
    "score": 2,
    "title": "Meh",
    "text": "Options get less and less every year.  Can’t even add free cheesy music anymore. Not worth getting pro with how easy it is to create a free Reel with one second daily clips and music of choice.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12128200250",
    "userName": "ShayShay Don",
    "userUrl": "https://itunes.apple.com/us/reviews/id49155447",
    "version": "5.0.2",
    "score": 1,
    "title": "UPDATED",
    "text": "Loved this app. I even got over the fact that most of it is now under a paywall. I don’t think I can get past the fact that I have to watch an ad after every snippet I add. Its making the process absolutely tedious and unenjoyable. I think I’ll be finding a way to make my own video without the fees or ads. I don’t mind an ad here and there, but it’s taking me way longer to make this year. \n\nHow disappointing, because this is a really good app. It doesn’t make me want to subscribe (I can’t afford to pay $50/app in this economy and time is crunched these days. I know we’re supposed to add a snippet daily so we don’t have to try to cram it in at the end of the year, but I just don’t remember at the end of each day. I’m in a busy season in life and I just can’t remember everything. It always took a long time to do at the end of the year, but now it’s just awful.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12125380905",
    "userName": "XariZaru",
    "userUrl": "https://itunes.apple.com/us/reviews/id1349268113",
    "version": "5.0",
    "score": 1,
    "title": "Adding Additional Snippets Bug",
    "text": "Ever since we could choose to add multiple snippets simultaneously, they broke the “watch ad to unlock additional snippets” button. Now you watch an Ad, go to add a snippet, and it says you need pro. Watched an ad for nothing!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12125036701",
    "userName": "Arowe07",
    "userUrl": "https://itunes.apple.com/us/reviews/id279058228",
    "version": "5.0",
    "score": 2,
    "title": "Can’t us own music like past years.",
    "text": "Please fix this so I can add my own music like past years. I’m using the same song as last year so I know it’s t should work.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12124984848",
    "userName": "Airy123",
    "userUrl": "https://itunes.apple.com/us/reviews/id115706985",
    "version": "5.0",
    "score": 4,
    "title": "Bring back feature",
    "text": "(Free version) Until the recent update, multiple daily videos were allowed- if we watched ads. Now, there is an option to watch ads for adding extra content, but this results in a subscription upgrade message only. Bring back the capability please. I’m wrapping up my first full year of using the app (I do enjoy it) but on my occasional “busy” day, I’d like to have the ability to document it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12124668407",
    "userName": "maawolfe36",
    "userUrl": "https://itunes.apple.com/us/reviews/id41789620",
    "version": "5.0",
    "score": 4,
    "title": "Recent changes are not good",
    "text": "I love this app. I've been using it since Christmas 2023 and it's awesome having daily memories recorded, even little things I might forget like snippets of my dogs playing together. \n\nHowever, recently the app has been pushing the Pro subscription a lot harder than before. I used to be able to watch an ad to unlock the ability to add multiple snippets to a single day. Then it changed to where I had to watch an ad for every single snipper, instead of unlocking the day. So if I wanted to add five snippets, I'd have to watch four ads instead of one. That's annoying, but fine. It's on me not wanting to pay for the Pro plan so I don't mind watching some ads to support the app. \n\nBut now, it still shows the option to watch an ad to add more snippets. But after watching the ad, it says that's a Pro feature and won't let me add any more snippets. Honestly that's probably false advertising from a legal standpoint, since the button still says that if you watch an ad it will unlock another snippet for that day. \n\nThis needs to be fixed one way or the other. Either let me add another snippet after watching an ad, or remove the button to watch an ad entirely. \n\nThis is not a one-off issue either. I have tried repeatedly, watching like ten ads a day over the past few days, and it has completely stopped letting me add a second snippet to a day no matter how many ads I watch. \n\nThis app is great, and I would pay for the Pro plan if I could afford it. But $50/year is a lot to spend annually just to unlock a few features I don't often need anyway. And shoving it down my throat by gradually forcing me to buy it or lose features is not the way to go about getting a customer.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12119792336",
    "userName": "Laurie50Staterunner",
    "userUrl": "https://itunes.apple.com/us/reviews/id278017461",
    "version": "5.0",
    "score": 1,
    "title": "Won’t let me sign in",
    "text": "App won’t let me sign in with new phone.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12118020812",
    "userName": "mrphillc",
    "userUrl": "https://itunes.apple.com/us/reviews/id149839360",
    "version": "5.0",
    "score": 2,
    "title": "Recent update makes scanning videos hard",
    "text": "Recent update makes scanning videos hard. Whatever this check mark is on add snippet completely breaks my workflow of scanning videos for my one second. What’s worse is that if I play along with the feature, the feature is broken… it’s stuck with a progress bar for some reason.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12117646644",
    "userName": "HelloThisIsDog",
    "userUrl": "https://itunes.apple.com/us/reviews/id318037732",
    "version": "5.0",
    "score": 1,
    "title": "trash after recent update unless you pay",
    "text": "i’ve been using this app for years and use the multiple snippet option, which is free if you watch an ad. now you watch the ad to add an additional snippet only to be blocked for a “subscriber only” option. this has turned me away from using this app, beyond the ridiculous subscription price the fact that bugs can’t be checked BEFORE an update is rolled out is ridiculous.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12100275673",
    "userName": "ElfSama",
    "userUrl": "https://itunes.apple.com/us/reviews/id202957618",
    "version": "5.0",
    "score": 4,
    "title": "Multiple Snippet Error",
    "text": "I’ve been using the app since my baby was born last year (it was recommended to me by a friend). A few months back a feature was added to watch an ad and you get to add an extra snippet. Now, after the recent update, it still offers a free snippet if you watch an ad BUT after watching the ad and you go to add an extra snippet, it says multiple snippets are just for pro members. So either the free option needs to be removed since it’s misleading, or it needs to be fixed.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12098223804",
    "userName": "Sendtheflood",
    "userUrl": "https://itunes.apple.com/us/reviews/id1540663559",
    "version": "5.0",
    "score": 3,
    "title": "Memories",
    "text": "This is a pretty good and simple to use app. I recommend.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12097660730",
    "userName": "RadioactiveCrayons",
    "userUrl": "https://itunes.apple.com/us/reviews/id225123828",
    "version": "5.0",
    "score": 1,
    "title": "Not worth",
    "text": "I used to look forward to this app every year… UNTIL THEY STARTED CHARGING FOR IT! Very disappointing",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12095205387",
    "userName": "Irish Eyes MN",
    "userUrl": "https://itunes.apple.com/us/reviews/id110098686",
    "version": "4.28.2",
    "score": 5,
    "title": "Favorite app and great customer service!",
    "text": "I have been using 1 Second Everyday for several years and I love it!! I haven’t missed a day in years. It is a lovely way to look back over events and it has a very practical side too! Often, I don’t remember when something happened and it’s a fabulous resource to go back and find the event. It works well. Rarely glitches and the couple of times I have had issues the customer service team is amazing!! They respond so fast and stick with you until it’s fixed. Highly recommend it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12085483851",
    "userName": "jules32191786",
    "userUrl": "https://itunes.apple.com/us/reviews/id542567792",
    "version": "5.0",
    "score": 5,
    "title": "Best app for memories",
    "text": "I love 1SE! I have been using it for years now to collect all of the years memories.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12358587836",
    "userName": "YeetyKong",
    "userUrl": "https://itunes.apple.com/us/reviews/id1052221098",
    "version": "5.2",
    "score": 5,
    "title": "The best one second a day app but",
    "text": "Please turn off the notification that happens every single day at midnight",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12343782502",
    "userName": "ClareMarie34",
    "userUrl": "https://itunes.apple.com/us/reviews/id392334355",
    "version": "5.2",
    "score": 5,
    "title": "A Diary for Life",
    "text": "Have been using this since the pandemic. I love how one day creates a story that you don’t know how it’ll unfold until you see it come together at the end of the year. \nLove sending Birthday snippets for my loved ones with their moments I’ve had with them over the last 5 years.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12323481031",
    "userName": "ayaliejs",
    "userUrl": "https://itunes.apple.com/us/reviews/id825282089",
    "version": "4.15.0",
    "score": 5,
    "title": "Amazing app",
    "text": "This is such a great app—I've been using it for years! I like being able to unlock new app icons but I wish there were a black and white icon and I also think it'd be cool if there were a 2,000 snippets icon that's gold.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12273082502",
    "userName": "zeroellie",
    "userUrl": "https://itunes.apple.com/us/reviews/id426751332",
    "version": "5.1",
    "score": 5,
    "title": "The Best 1 Second App!",
    "text": "I’ve been using this app for several years now, and it’s consistently been a very fun way to capture memories and have a nice journal at the end of the year. Several friends of mine ask about seeing my one second, because it really is such a wonderful experience. The main reason I’m writing this review after all these years is to commend the developers and 1 Second team for their dedication to providing a great user experience. They have a forum in which you can make suggestions, upvote posts you agree with, and what really stands out to me is that the development team actively engages with the forum. There was an update that made it more difficult to use the app, and I was overjoyed to see that their team had responded to the most upvoted post on the forum about changing it back, and saying that they were working on it. A week or so later, I got an email saying that the post had been resolved, and when I went on the app, it was back to how it was before! I would just like to express how much I appreciate the team being responsive to their user’s opinions and providing a community forum where user input is valued. When I first saw the update, I was distraught because I assumed I would have to try to find an equivalent to the app I love, as I’m so used to user input being like speaking into a void. I was very pleasantly surprised to find how easy it was to access the forum where I could express my opinion about the update, and even more delighted to have such a quick response to the issue and it being corrected so promptly. Thank you to the 1 Second Everyday team for caring about the people who love the app, and for actually valuing its consumers. Since discovering this app in 2019, collecting memories to add to it has become a routine part of my life. It’s super helpful to have an actual reason and reminder to capture the moments I spend with my friends and such :) I’ve recommended the app to several people and will continue to do so, y’all rock!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12254628409",
    "userName": "dhgddfggdfg",
    "userUrl": "https://itunes.apple.com/us/reviews/id1252342862",
    "version": "5.0.3",
    "score": 1,
    "title": "Free trial is useless",
    "text": "Literally. Got free trial of pro. Still can’t use pro.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12217982839",
    "userName": "luckyyyboi",
    "userUrl": "https://itunes.apple.com/us/reviews/id634441455",
    "version": "5.0.3",
    "score": 1,
    "title": "App doesn’t work",
    "text": "Annoying I tried to press start and nothing happens canceling my membership",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12211956261",
    "userName": "Gmurra",
    "userUrl": "https://itunes.apple.com/us/reviews/id645919305",
    "version": "5.0.3",
    "score": 5,
    "title": "The best journal app",
    "text": "This is one of my favorite apps. I love the ease of creating videos and memories for myself without feeling like I have to create it through Instagram. The customer service is also really great anytime I’ve had issues. If you are a new parent and want an easy way to look through your inevitable hundreds of photos/videos of your kids over the years, this is the perfect app for it.  I cannot recommend it enough!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12208955431",
    "userName": "Ungiereviews",
    "userUrl": "https://itunes.apple.com/us/reviews/id14994196",
    "version": "5.0.3",
    "score": 5,
    "title": "Awesome App",
    "text": "I’ve been using this app everyday for 5 years. It’s part of my daily routine and brings me a lot of joy. The app is stable and easy to use, and the subscription is priced appropriately.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12205007406",
    "userName": "Martinxzkdg",
    "userUrl": "https://itunes.apple.com/us/reviews/id126487865",
    "version": "5.0.3",
    "score": 3,
    "title": "Updates are almost always disappointing",
    "text": "I do like this app quite a bit. Unfortunately, they mess around too much with a good product. I'd say if it ain't broke, don't fix it, but they often do. For example, I very much enjoyed that I could create a new snippet and post it to multiple projects at once. They just removed that feature for no apparent reason. Very annoying.\n\nThis has happened many times in the past – they supposedly improve the app, but actually make it worse. \n\nAn update a few weeks ago, for example, reset all my projects so the branding that I had turned off was turned back on. That was really cheap.\n\nTheir product team and their QA are disappointing.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12184629948",
    "userName": "Video art lover",
    "userUrl": "https://itunes.apple.com/us/reviews/id136036871",
    "version": "5.0.3",
    "score": 5,
    "title": "Fun app!!",
    "text": "I use it everyday as my journal.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12179331808",
    "userName": "Jeff Daley",
    "userUrl": "https://itunes.apple.com/us/reviews/id22544119",
    "version": "5.0.3",
    "score": 5,
    "title": "Who Knew That Watching A Movie About Your Life Could Be So Much Fun?",
    "text": "The design and thoughtfulness that went into this app is so apparent and appreciated. I absolutely love it!  I've been loading videos year by year onto my Iphone and to see a calendar full of orange days is exciting and addicting.  I literally want to find every video that I have and more importantly I'm so inspired to make the next day's second as memorable as it can be.  The process of snipping your favorite second of the day couldn't be easier and most importantly it's so much fun. Thank you!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12179018124",
    "userName": "Oliver Fox McCade",
    "userUrl": "https://itunes.apple.com/us/reviews/id142056313",
    "version": "5.0.3",
    "score": 5,
    "title": "Customer",
    "text": "Wonderful review and reminder. Great customer service.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12168829714",
    "userName": "SadieLikesGeese",
    "userUrl": "https://itunes.apple.com/us/reviews/id1671628290",
    "version": "5.0.3",
    "score": 5,
    "title": "😗👌",
    "text": "It’s a really great app, good at reminding you to do it, but doesn’t get too crazy like Duolingo. I enjoy clicking in the app and watching memories from the past year or so. Pretty easy to use, easy to customize. There are some ads, and they are all mostly to get the premium edition. You can change the app icon based on how many clips you have which is really fun.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12164236573",
    "userName": "Ruth Parada",
    "userUrl": "https://itunes.apple.com/us/reviews/id416848153",
    "version": "5.0.3",
    "score": 5,
    "title": "Great memories",
    "text": "We used this app to document our daughter’s first year, and the compilation is one of my favorite videos ever. She’s 13 months now and we’re still keeping up with her daily clips, starting a new yearly tradition for her and any future kids. I just love seeing the slow progression of her growth in the span of a 10 minute video.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12163970925",
    "userName": "Dru_67",
    "userUrl": "https://itunes.apple.com/us/reviews/id1076117359",
    "version": "5.0.3",
    "score": 5,
    "title": "One of my favorite apps!",
    "text": "I’ve been using this app daily for the last 5 years. It’s so simple to use and edit your videos. It gives me a way to look back at all I’ve done and remind me of the interactions that make us human. The support is super friendly and helpful as well! Give it a try!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12159286093",
    "userName": "Lexivh",
    "userUrl": "https://itunes.apple.com/us/reviews/id109766227",
    "version": "5.0.3",
    "score": 3,
    "title": "Used to be great, new update is not user-friendly",
    "text": "I've been using this app every day for two years, and before that off and on for three years. It was always pretty intuitive to be able to take a video right in the app, the new update in January 2025 has made it a multi step process, and not particularly easy to get there. Hopefully this is fixed soon.\n\nOn a separate note, I am constantly being sent emails saying that my projects/data is going to be deleted because it's not backed up. After logging in and checking, it is backed up. Frustrating to get these sorts of emails about once a month.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12155682599",
    "userName": "Ibdetny",
    "userUrl": "https://itunes.apple.com/us/reviews/id232850397",
    "version": "5.0.3",
    "score": 1,
    "title": "Wont Load",
    "text": "Spent one whole year 2024 using this app everyday and it won’t load my. year. I keep getting error 1004 message. I must say. I downloaded it for a specific reason and now it doesn’t work after 365 days! Very Disappointing!! \nI don’t recommend at all.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12154312553",
    "userName": "Ang.pilie",
    "userUrl": "https://itunes.apple.com/us/reviews/id108643674",
    "version": "5.0.3",
    "score": 5,
    "title": "Best App Ever",
    "text": "I’ve been making videos with this app for a couple of years now.  It’s so easy to use and makes the best memories for me and my family.  I always get asked how I make my videos because they are so professional looking.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12154226277",
    "userName": "HBenac",
    "userUrl": "https://itunes.apple.com/us/reviews/id8908464",
    "version": "5.0.3",
    "score": 3,
    "title": "Small changes make it not as great but still love the app",
    "text": "First off, I’ve been using this app for several years to make sweet yearly videos of my kids. It’s incredible to see how much they grow in just one year and they get a big thrill out of watching their videos. They continue to make changes to the app that are annoying however. Now the clip captions are a hidden field only accessible after adding the clip. Wish that was a default field like it used to be. Also, because the premium version is really expensive for an app, I stick with the free version. I appreciate that I have the option to add more than 2 clips to a day but the required ads are incredibly obnoxious, have gotten longer and now I have to watch the almost one minute ad for every extra video clip over the standard two. It used to be that if I watched an ad once per calendar date, all the extra clips for that day would be covered. Please fix these changes if you don’t want to drive your user base away.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12152843431",
    "userName": "Noneknowme",
    "userUrl": "https://itunes.apple.com/us/reviews/id285619431",
    "version": "5.0.3",
    "score": 1,
    "title": "1",
    "text": "Please bring back the camera on the home dashboard. It is tedious and time consuming to go into the calendar to add a snippet. And it’s making me not want to capture my day. Also please stop with pushing pro. It is annoying to have to close out of it every time I open the app. I know it’s an option.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12151872304",
    "userName": "Ron DiMaggio",
    "userUrl": "https://itunes.apple.com/us/reviews/id160860072",
    "version": "5.0.3",
    "score": 1,
    "title": "Subscription Kills Yet Another App",
    "text": "Why do you need a subscription model for something like this? It’s ruined it and has only shown greed. There’s other apps that can do this without telling the App Store users that they are nothing but a constant money stream.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12149655445",
    "userName": "Effunia",
    "userUrl": "https://itunes.apple.com/us/reviews/id276648857",
    "version": "5.0.3",
    "score": 4,
    "title": "Newest update broke being able to add songs",
    "text": "*thank you for fixing the bug with being able to add your own music* \n\nOverall I like the app, but the newest update broke being able to add my own music. You can only add their provided music. I also wish you could choose between horizontal or vertical videos as well as being able to add multiple music tracks. The clipping of the videos isn’t as precise as I’d like it to be, often I have to select a clip, watch it and readjust because it’s a few seconds too early or past the point I wanted captured.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12145560573",
    "userName": "amoonicole",
    "userUrl": "https://itunes.apple.com/us/reviews/id890350476",
    "version": "5.0.3",
    "score": 1,
    "title": "constant glitches",
    "text": "for some reason, the app freezes any time i attempt to retroactively add snippets. i can only add snippets day of, and can no longer upload from my photo library. i have to full close the app if it freezes, otherwise nothing works.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12144945407",
    "userName": "artisticaviary",
    "userUrl": "https://itunes.apple.com/us/reviews/id109133688",
    "version": "5.0.3",
    "score": 2,
    "title": "Aggressive advertisements have made this app clunky to use",
    "text": "When I first started using this at the beginning of 2023, it was great. But since then, the in-app advertisements for their expensive “pro” version have slowly become completely obnoxious to the point of being off-putting. The ads for premium are aggressive— you can’t even add a second to your day without one popping up.\nI like your app and would be happy to pay a few dollars one time for a premium version, but not $50/year! Your pricing is ridiculous and I’ve had to stop recommending the app to my friends and family because of the ads.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12142918745",
    "userName": "Dee6209Anne",
    "userUrl": "https://itunes.apple.com/us/reviews/id768280302",
    "version": "5.0.3",
    "score": 5,
    "title": "So many beautiful memories",
    "text": "I started doing this the year I got married, and now 9 years and 3 kids into our marriage it is so wonderful to look back on how much our life has changed, how our kids grow day by day, and just to see all these moments in our life that would’ve otherwise been forgotten. It’s crazy how seeing a 1 second clip can remind me of a whole day or event. The app only gets better each year, I’m so thankful for this!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12142032297",
    "userName": "Just another reviewer ngl",
    "userUrl": "https://itunes.apple.com/us/reviews/id1736659576",
    "version": "5.0.3",
    "score": 5,
    "title": "Nice",
    "text": "It’s really cool to look back through a whole year, my mom shared hers to us (her kids) and some of the snippets were really funny. It’s nice to look back on a while year in about ten minutes.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12140702013",
    "userName": "1flychicken",
    "userUrl": "https://itunes.apple.com/us/reviews/id23680487",
    "version": "5.0.3",
    "score": 1,
    "title": "Poor customer support, no resolution",
    "text": "I paid for this app before it became severely overpriced. Even with the receipt, no one could help me. I was, instead, passed from rep to rep with huge delays in responses. Clearly they don’t care about their customers or the people that believed in their business before they were so large (and greedy). Horrible experience.\n\n*an update to their comment: like I said above, I already tried to get help and it was refused/denied. Did you even read the above?",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12140155373",
    "userName": "meh1551",
    "userUrl": "https://itunes.apple.com/us/reviews/id1010694918",
    "version": "5.0.3",
    "score": 3,
    "title": "Feature removed - not as good",
    "text": "The most recent update took away a feature on the home page that made the app for me. Now I get frustrated opening the app.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12139849895",
    "userName": "Joerugger",
    "userUrl": "https://itunes.apple.com/us/reviews/id25674328",
    "version": "5.0.3",
    "score": 5,
    "title": "Great App",
    "text": "Great app, been a subscriber for several years. The latest update, v5 broke the ability to add your own music. I hope they fix it soon.\n\nThey fixed the issue!  Pay for the app. It’s worth it!!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12138038304",
    "userName": "Maoyou Pi",
    "userUrl": "https://itunes.apple.com/us/reviews/id401923495",
    "version": "5.0.3",
    "score": 3,
    "title": "Alas the ads",
    "text": "Among the many ads that are mandatory to watch these days in order to have more than one clip per day, I certainly prefer the scammy&short Jackpot ads(15s) than the legit&long Dropbox ads(60s). Worst still are the candy crush ads that claim to be 20seconds but freeze and turn into 30 seconds in the end. That’s 30 seconds in exchange for 1 — for what I regard as a thoughtfully crafted app, maybe at least eliminate the ads that encourage people to gamble money in a game rather than at the casino?\n\nI’m just waiting for the photos app to evolve into something that just compiles clips automatically in the background so I can eventually stop relying on this one.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12137725496",
    "userName": "december 31, 2019",
    "userUrl": "https://itunes.apple.com/us/reviews/id1020758522",
    "version": "5.0.3",
    "score": 5,
    "title": "best decision i’ve ever committed to",
    "text": "this is my 5th year ofc 1se and i love ts, i didn’t think id stick to it this long but now its part of my routine. i love looking back each month and seeing my life, it makes me really happy! especially at the end of the year getting to watch everything",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12133067345",
    "userName": "Nibor588",
    "userUrl": "https://itunes.apple.com/us/reviews/id116598373",
    "version": "5.0.2",
    "score": 1,
    "title": "Constantly freezes and looses edits",
    "text": "So frustrating. App constantly freezes up and then looses edits I’ve made.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12133010495",
    "userName": "Sparky1010",
    "userUrl": "https://itunes.apple.com/us/reviews/id41270158",
    "version": "5.0.2",
    "score": 2,
    "title": "UI refresh why??",
    "text": "In 5.0.2, I don’t have a button to quickly take my 1 second… why!? That’s the major point of the app. Why does it take 4 clicks to get to the spot to record it!?",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12132583177",
    "userName": "Charleslive00",
    "userUrl": "https://itunes.apple.com/us/reviews/id429547349",
    "version": "5.0.2",
    "score": 5,
    "title": "the greatest time capsule",
    "text": "this app is incredible. i have been using this for 6 years and to see my life, day by day, is so beautiful. I have my main “life” project, which I occasionally journaling and have clips from most days for the past six years. From that I have these branches that I have created such as moments in nature, different cities, I’ve lived in or for specific friends or aspects of my career. So beyond just my main life, I do have all these other montages of specific areas or people. this is a great gift when celebrating an anniversary or a friendship because especially if they aren’t expecting, it can be such a wonderful gift to them! It synced to the cloud and I don’t have to worry about it disappearing. Be able to watch each year and review at the end of the year is wonderful because it truly puts into perspective how full my life is. I can also hide things if I want it just for me and I can journal moments within the journal settings. There are times like a week or months without posting and it’s so nice because they have a feature that doesn’t auto fill so everything from your camera roll just gets put into the week or month you choose and you can fill in that space. it can also turn Live Photos into video which is such an useful feature. I’ve gotten in the habit of taking video or photos often so that can always translate into this app easily. This is truly been a life-changing app and for the decades to come I’m so excited to watch my life story.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12131282618",
    "userName": "Katadele",
    "userUrl": "https://itunes.apple.com/us/reviews/id87689409",
    "version": "5.0.2",
    "score": 3,
    "title": "New update is awful",
    "text": "I’ve loved this app and have happily paid for the extra snippets for years but this new update is really screwed up. Please go back to the way it was before!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12129958646",
    "userName": "missmegannnnn",
    "userUrl": "https://itunes.apple.com/us/reviews/id495962264",
    "version": "5.0.2",
    "score": 4,
    "title": "Had to delete and redownload the app to get the “my music” feature to work again",
    "text": "I had to redownload the app after it updated to fix the music issues, other than that, it’s a solid app.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12128492689",
    "userName": "koalaslothcat",
    "userUrl": "https://itunes.apple.com/us/reviews/id40869462",
    "version": "5.0.2",
    "score": 2,
    "title": "Meh",
    "text": "Options get less and less every year.  Can’t even add free cheesy music anymore. Not worth getting pro with how easy it is to create a free Reel with one second daily clips and music of choice.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12128200250",
    "userName": "ShayShay Don",
    "userUrl": "https://itunes.apple.com/us/reviews/id49155447",
    "version": "5.0.2",
    "score": 1,
    "title": "UPDATED",
    "text": "Loved this app. I even got over the fact that most of it is now under a paywall. I don’t think I can get past the fact that I have to watch an ad after every snippet I add. Its making the process absolutely tedious and unenjoyable. I think I’ll be finding a way to make my own video without the fees or ads. I don’t mind an ad here and there, but it’s taking me way longer to make this year. \n\nHow disappointing, because this is a really good app. It doesn’t make me want to subscribe (I can’t afford to pay $50/app in this economy and time is crunched these days. I know we’re supposed to add a snippet daily so we don’t have to try to cram it in at the end of the year, but I just don’t remember at the end of each day. I’m in a busy season in life and I just can’t remember everything. It always took a long time to do at the end of the year, but now it’s just awful.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12125380905",
    "userName": "XariZaru",
    "userUrl": "https://itunes.apple.com/us/reviews/id1349268113",
    "version": "5.0",
    "score": 1,
    "title": "Adding Additional Snippets Bug",
    "text": "Ever since we could choose to add multiple snippets simultaneously, they broke the “watch ad to unlock additional snippets” button. Now you watch an Ad, go to add a snippet, and it says you need pro. Watched an ad for nothing!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12125036701",
    "userName": "Arowe07",
    "userUrl": "https://itunes.apple.com/us/reviews/id279058228",
    "version": "5.0",
    "score": 2,
    "title": "Can’t us own music like past years.",
    "text": "Please fix this so I can add my own music like past years. I’m using the same song as last year so I know it’s t should work.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12124984848",
    "userName": "Airy123",
    "userUrl": "https://itunes.apple.com/us/reviews/id115706985",
    "version": "5.0",
    "score": 4,
    "title": "Bring back feature",
    "text": "(Free version) Until the recent update, multiple daily videos were allowed- if we watched ads. Now, there is an option to watch ads for adding extra content, but this results in a subscription upgrade message only. Bring back the capability please. I’m wrapping up my first full year of using the app (I do enjoy it) but on my occasional “busy” day, I’d like to have the ability to document it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12124668407",
    "userName": "maawolfe36",
    "userUrl": "https://itunes.apple.com/us/reviews/id41789620",
    "version": "5.0",
    "score": 4,
    "title": "Recent changes are not good",
    "text": "I love this app. I've been using it since Christmas 2023 and it's awesome having daily memories recorded, even little things I might forget like snippets of my dogs playing together. \n\nHowever, recently the app has been pushing the Pro subscription a lot harder than before. I used to be able to watch an ad to unlock the ability to add multiple snippets to a single day. Then it changed to where I had to watch an ad for every single snipper, instead of unlocking the day. So if I wanted to add five snippets, I'd have to watch four ads instead of one. That's annoying, but fine. It's on me not wanting to pay for the Pro plan so I don't mind watching some ads to support the app. \n\nBut now, it still shows the option to watch an ad to add more snippets. But after watching the ad, it says that's a Pro feature and won't let me add any more snippets. Honestly that's probably false advertising from a legal standpoint, since the button still says that if you watch an ad it will unlock another snippet for that day. \n\nThis needs to be fixed one way or the other. Either let me add another snippet after watching an ad, or remove the button to watch an ad entirely. \n\nThis is not a one-off issue either. I have tried repeatedly, watching like ten ads a day over the past few days, and it has completely stopped letting me add a second snippet to a day no matter how many ads I watch. \n\nThis app is great, and I would pay for the Pro plan if I could afford it. But $50/year is a lot to spend annually just to unlock a few features I don't often need anyway. And shoving it down my throat by gradually forcing me to buy it or lose features is not the way to go about getting a customer.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12119792336",
    "userName": "Laurie50Staterunner",
    "userUrl": "https://itunes.apple.com/us/reviews/id278017461",
    "version": "5.0",
    "score": 1,
    "title": "Won’t let me sign in",
    "text": "App won’t let me sign in with new phone.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12118020812",
    "userName": "mrphillc",
    "userUrl": "https://itunes.apple.com/us/reviews/id149839360",
    "version": "5.0",
    "score": 2,
    "title": "Recent update makes scanning videos hard",
    "text": "Recent update makes scanning videos hard. Whatever this check mark is on add snippet completely breaks my workflow of scanning videos for my one second. What’s worse is that if I play along with the feature, the feature is broken… it’s stuck with a progress bar for some reason.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12117646644",
    "userName": "HelloThisIsDog",
    "userUrl": "https://itunes.apple.com/us/reviews/id318037732",
    "version": "5.0",
    "score": 1,
    "title": "trash after recent update unless you pay",
    "text": "i’ve been using this app for years and use the multiple snippet option, which is free if you watch an ad. now you watch the ad to add an additional snippet only to be blocked for a “subscriber only” option. this has turned me away from using this app, beyond the ridiculous subscription price the fact that bugs can’t be checked BEFORE an update is rolled out is ridiculous.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12100275673",
    "userName": "ElfSama",
    "userUrl": "https://itunes.apple.com/us/reviews/id202957618",
    "version": "5.0",
    "score": 4,
    "title": "Multiple Snippet Error",
    "text": "I’ve been using the app since my baby was born last year (it was recommended to me by a friend). A few months back a feature was added to watch an ad and you get to add an extra snippet. Now, after the recent update, it still offers a free snippet if you watch an ad BUT after watching the ad and you go to add an extra snippet, it says multiple snippets are just for pro members. So either the free option needs to be removed since it’s misleading, or it needs to be fixed.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12098223804",
    "userName": "Sendtheflood",
    "userUrl": "https://itunes.apple.com/us/reviews/id1540663559",
    "version": "5.0",
    "score": 3,
    "title": "Memories",
    "text": "This is a pretty good and simple to use app. I recommend.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12097660730",
    "userName": "RadioactiveCrayons",
    "userUrl": "https://itunes.apple.com/us/reviews/id225123828",
    "version": "5.0",
    "score": 1,
    "title": "Not worth",
    "text": "I used to look forward to this app every year… UNTIL THEY STARTED CHARGING FOR IT! Very disappointing",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12095205387",
    "userName": "Irish Eyes MN",
    "userUrl": "https://itunes.apple.com/us/reviews/id110098686",
    "version": "4.28.2",
    "score": 5,
    "title": "Favorite app and great customer service!",
    "text": "I have been using 1 Second Everyday for several years and I love it!! I haven’t missed a day in years. It is a lovely way to look back over events and it has a very practical side too! Often, I don’t remember when something happened and it’s a fabulous resource to go back and find the event. It works well. Rarely glitches and the couple of times I have had issues the customer service team is amazing!! They respond so fast and stick with you until it’s fixed. Highly recommend it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12085483851",
    "userName": "jules32191786",
    "userUrl": "https://itunes.apple.com/us/reviews/id542567792",
    "version": "5.0",
    "score": 5,
    "title": "Best app for memories",
    "text": "I love 1SE! I have been using it for years now to collect all of the years memories.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12072830077",
    "userName": "BeastMasterSlxtyFour",
    "userUrl": "https://itunes.apple.com/us/reviews/id1149259550",
    "version": "4.28.2",
    "score": 5,
    "title": "Excellent!",
    "text": "The app works perfectly and has everything I need without in app purchases. I’m so glad to have it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12070687753",
    "userName": "PhilLarson.net",
    "userUrl": "https://itunes.apple.com/us/reviews/id17889613",
    "version": "4.28.2",
    "score": 5,
    "title": "Longtime user and still love it!",
    "text": "I’ve used this app since 2018 to capture my life with my family. It’s so incredible to go back and watch the videos and see memories with my son and wife every day since 2018. It’s worth the investment to capture my family’s legacy. Thank you.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12069956184",
    "userName": "JenJenMI",
    "userUrl": "https://itunes.apple.com/us/reviews/id143406808",
    "version": "4.28.2",
    "score": 4,
    "title": "Fun app",
    "text": "Lots of fun to document life",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12068797218",
    "userName": "rekus renob",
    "userUrl": "https://itunes.apple.com/us/reviews/id1219969289",
    "version": "4.28.2",
    "score": 5,
    "title": "neat",
    "text": "real neat",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12041760962",
    "userName": "Real reviewer!1!!",
    "userUrl": "https://itunes.apple.com/us/reviews/id1695743036",
    "version": "4.28.1",
    "score": 2,
    "title": "One free week",
    "text": "It’s a bit pricey, why not just set daily reminders to do this your self without an app .(my opinion).",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12004597437",
    "userName": "CJHagz",
    "userUrl": "https://itunes.apple.com/us/reviews/id1422966589",
    "version": "4.28.0",
    "score": 5,
    "title": "Amazing app and customer service",
    "text": "Great app. I love seeing my little one change during their first year! Anytime I have had issues with the app the customer support team is so helpful!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12003912613",
    "userName": "Evie Sooby",
    "userUrl": "https://itunes.apple.com/us/reviews/id425654654",
    "version": "4.28.0",
    "score": 5,
    "title": "I Love This App!",
    "text": "There are so few things in life you can count on, but I can count on one 1 Second! So easy to do - the practice of recording something each day has become essential to my life. Because the joy of seeing the year just passed on December 31 is a beautiful reminder that there were good days and bad days, but I am grateful for them all. \nAnd 1 Second gives the best service ever! Thank you, Keith. 💕",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "12002848152",
    "userName": "andy.p52",
    "userUrl": "https://itunes.apple.com/us/reviews/id523059858",
    "version": "4.28.0",
    "score": 3,
    "title": "Sad they got rid of crowds…",
    "text": "I liked being able to see family and friends second’s on 1 SE crowds but without this feature I’m likely ending my streak of using the app after 2.5 years :/",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11968121281",
    "userName": "MiW3L",
    "userUrl": "https://itunes.apple.com/us/reviews/id17109815",
    "version": "4.28.0",
    "score": 1,
    "title": "Too expensive!",
    "text": "Too expensive.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11953488530",
    "userName": "DontAdvertiseToChildren27",
    "userUrl": "https://itunes.apple.com/us/reviews/id213676808",
    "version": "4.28.0",
    "score": 1,
    "title": "Disappointing",
    "text": "I used this app several years ago and it was one of my favorite things; but I recently redownloaded it and oh my gosh it’s so bad now :( \nClunky, super geared towards forcing a premium subscription, just way worse.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11952669670",
    "userName": "LightsOutHalcyon",
    "userUrl": "https://itunes.apple.com/us/reviews/id1029409034",
    "version": "4.28.0",
    "score": 3,
    "title": "1se pro is stupid",
    "text": "As much as I like the app, I need to complain about the CONSTANT ads for 1se pro. The app is called 1 second a day. I downloaded it so I could document…. one second a day. Pro allowing you to document more than one clip a day, and clips longer than one second, DEFEAT THE POINT OF THE APP!!!!! IT’S NOT EVEN AN UPGRADE TO HAVE PRO! IT TAKES AWAY THE VERY REASON I DOWLOADED IT IN THE FIRST PLACE. \nGrow some brain cells and stop being so greedy. 😐",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11940095899",
    "userName": "Emma Raye??!",
    "userUrl": "https://itunes.apple.com/us/reviews/id1386749534",
    "version": "4.28.0",
    "score": 5,
    "title": "5 stars only one complication",
    "text": "I love this app. It’s like be real, but one second I guess kind of is more in the moment and I love it. Only problem is that I couldn’t figure out how to add friends.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11920519367",
    "userName": "Zoeyjl",
    "userUrl": "https://itunes.apple.com/us/reviews/id1567556298",
    "version": "4.28.0",
    "score": 5,
    "title": "This app is GREAT!",
    "text": "This app is awesome!!!  I just got this app 2 months ago and I love it so much. If your looking for an app like bereal, this is so it! This is not addicting at all and it is so fun to share moments with your friends! I totally recommend this app. And 1SE, thank you so much, such a great organization!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11901786852",
    "userName": "laggyaby",
    "userUrl": "https://itunes.apple.com/us/reviews/id1414186492",
    "version": "4.28.0",
    "score": 3,
    "title": "So SLOW",
    "text": "This app used to be so good, now every time i upload a video it slows my phone down and eats my battery up. I have to wait at least 3 minutes just for it to load so i can save the video. Ive updated the app and everything. Disappointing but other than that its cool to use.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11882390296",
    "userName": "Kaoii",
    "userUrl": "https://itunes.apple.com/us/reviews/id112241282",
    "version": "4.27.0",
    "score": 3,
    "title": "Performance needs help",
    "text": "I’ve used this app every single day for the last four years. I love using it. I beg of the development team though, please prioritize application performance. So many times when I hit the record button, either the camera does not load at all or it takes multiple seconds to load. I may have already missed the moment I want to record. I’m using an iPhone 12.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11870000365",
    "userName": "The Captain Dash",
    "userUrl": "https://itunes.apple.com/us/reviews/id332404773",
    "version": "4.27.0",
    "score": 1,
    "title": "Only paid options now?",
    "text": "This was a great app until it forced you to pay a subscription.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11868174569",
    "userName": "Bruno and Larissa",
    "userUrl": "https://itunes.apple.com/us/reviews/id128925272",
    "version": "4.27.0",
    "score": 5,
    "title": "I LOVE THIS APP!!",
    "text": "This is easily my favorite app on my phone! I love being able to record my kids growing up and our life and adventures together.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11852565077",
    "userName": "TheBolt22",
    "userUrl": "https://itunes.apple.com/us/reviews/id522614943",
    "version": "4.26.1",
    "score": 3,
    "title": "Self-advertising spam",
    "text": "Great app aside from the fact it constantly spams you with a 20 second long non-skipable ad for premium membership.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11813288173",
    "userName": "Roscuro7",
    "userUrl": "https://itunes.apple.com/us/reviews/id87146822",
    "version": "4.26.1",
    "score": 5,
    "title": "Memories to last forever",
    "text": "I use this app every year in preparation for my kids birthdays. I compile all the best clips from movies and photos and create a yearly recap to play at their birthday party and also keep for years to come. I love working on the videos and enjoy watching our own movies even more. Highly recommend",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11813121020",
    "userName": "Mrmaximoto",
    "userUrl": "https://itunes.apple.com/us/reviews/id35595416",
    "version": "4.26.1",
    "score": 5,
    "title": "Love this app",
    "text": "Been using since 2016… to have video clips from the past eight years is an amazing way to remember my life story. I ran into my first issues with the app with an upgrade to the new iPhone 16. The issues were resolved in a timely manner and the communication with the staff were clear and concise. Highly recommend.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11808207423",
    "userName": "EikcJ312",
    "userUrl": "https://itunes.apple.com/us/reviews/id227120377",
    "version": "4.26.1",
    "score": 5,
    "title": "Amazing team",
    "text": "1SE has the most amazing support team. I had some upload issues with my new phone and they quickly address it and multiple follow up and updates . Definitely worth the subscription fee for the service and the videos for keepsake !",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11800687510",
    "userName": "Jeffmooo",
    "userUrl": "https://itunes.apple.com/us/reviews/id5188057",
    "version": "4.26.1",
    "score": 5,
    "title": "Now works on iPhone 16 Pro Max!",
    "text": "Back to 5 stars!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11794108717",
    "userName": "romandigs",
    "userUrl": "https://itunes.apple.com/us/reviews/id679957354",
    "version": "4.26.1",
    "score": 5,
    "title": "Amazing App & Team",
    "text": "Showing my 1SE videos to my friends at the end of each year is the highlight of the first week of January. Team is super helpful and responsive when there is a technical issue. Highly recommend this app!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11790297877",
    "userName": "rankible",
    "userUrl": "https://itunes.apple.com/us/reviews/id20344256",
    "version": "4.26.0",
    "score": 1,
    "title": "Doesn’t yet support iPhone 16 pro",
    "text": "Similar errors to others",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11764427802",
    "userName": "bruhhhhhhh777",
    "userUrl": "https://itunes.apple.com/us/reviews/id269812835",
    "version": "4.25.0",
    "score": 1,
    "title": "DOES NOT SUPPORT 16 PRO",
    "text": "I can no longer save any videos. Everything from 16 Pro ProRes fails with the message “Failed to export asset to disk”",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11751152356",
    "userName": "Beccup",
    "userUrl": "https://itunes.apple.com/us/reviews/id375619671",
    "version": "4.25.0",
    "score": 4,
    "title": "i use it everyday",
    "text": "i’ve been using this app every day for 3 years and i love it. because of the fact that it’s fun to look back at all my memories throughout the year even if it is for one second. but it’s only getting 4 stars because recently it won’t let me put in videos. it will only let me put in my live pictures. for the videos when i try it tells me “failed to export asset to disk” and i’ve looked it up but all i can find is that means i don’t have storage on my phone. but that’s not the case for me. my phone is only using 75 GB of 1 TB. if that would be fixed in the next bug update the app would get a full 5 star review from me.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11749055111",
    "userName": "Cook-Nelson",
    "userUrl": "https://itunes.apple.com/us/reviews/id249365232",
    "version": "4.25.0",
    "score": 5,
    "title": "Helps me remember my life",
    "text": "1 sec everyday helps me actually remember what I’ve done and the beautiful memories I’ve made. Enough said.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11730410390",
    "userName": "Closet Burner",
    "userUrl": "https://itunes.apple.com/us/reviews/id86509448",
    "version": "4.24.0",
    "score": 5,
    "title": "The best, easy-to-use app for collecting daily memories",
    "text": "One Second Everyday is an amazing app that makes it super easy to collect images and words and put them in a chronological order! I’m using it to capture one second of each of our children’s lives until they turn 18, then it’s going to be their birthday present on their 18th birthdays. Once you get the hang of it, which happens pretty quickly, you’ll be creating a future trip down memory lane that you can share with your friends and family forever! The team behind the app is also very supportive and can answer any questions or solve any issues that might occur while using it!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11728892274",
    "userName": "gkdc4",
    "userUrl": "https://itunes.apple.com/us/reviews/id649012618",
    "version": "4.24.0",
    "score": 5,
    "title": "Fantastic!",
    "text": "1SE is one of my favorite apps of all time!  It’s helped me be intentional about appreciating the little AND big things in my life and keeping track of them.  Great tech support too -   ( a plus for people like me who are inept with technology 😆)  I pay for the Pro version and think it’s well worth it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11688979131",
    "userName": "Preppy1_e",
    "userUrl": "https://itunes.apple.com/us/reviews/id1664608870",
    "version": "4.24.0",
    "score": 5,
    "title": "Get this app",
    "text": "Y’all made me so happy doing this. I thought I was had my own YouTube channel I love making videos and yeah if you love making videos to get this app😀😀",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11614439954",
    "userName": "littlebirddd",
    "userUrl": "https://itunes.apple.com/us/reviews/id458442547",
    "version": "4.22.0",
    "score": 5,
    "title": "My favorite app!!!",
    "text": "I’ve been using the 1SE app since 2016 to remember little moments from each day, and it’s been so much fun. I look forward to watching each compilation when it’s done, and love looking back years later — the one second videos can take me right back to any particular season. Something about the movement and sound captures so much more to me than a photo and it’s really special. Highly recommend!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11614099823",
    "userName": "napsandyaps",
    "userUrl": "https://itunes.apple.com/us/reviews/id409258930",
    "version": "4.22.0",
    "score": 3,
    "title": "Never could resolve issue",
    "text": "I used this 3x (2018, 2020, 2022) and loved it with no issues. \nNow… they’ve come out with new features, different layout, the app looks great! Even gives you an easy way to get direct contact for help. \nUnfortunately I’m no longer using this app b/c the feature of watching an ad to add a second snippet for the day keeps giving me an error. I’ve reached out to customer service and we’ve troubleshooted everything, I even got a new iPhone, it’s still not working and it was just my dealbreaker there. The rep said she’s contacted the company who services the ads but nothing seemed wrong there, but it’s not just my phone! I’ve tried this on another iPhone and it gave the same error. Looks like the ad company is faulty, 1SE needs to look into it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11607439097",
    "userName": "Mary Mags :)",
    "userUrl": "https://itunes.apple.com/us/reviews/id842744054",
    "version": "4.22.0",
    "score": 5,
    "title": "love love love",
    "text": "This app has brought me so much joy. I use it to remember small moments, big moments, and everything in between. I’ve been recording my 1 second everyday for over 3 years now, and I’ve never missed a day. Its seen me through high school, through the end of the pandemic, through friendships, tough times, and beautiful, amazing moments in my life. I cannot be more grateful for this app. If you are considering downloading it, please do. It really is such a beautiful reminder that even when you’re struggling, there’s always at least one good second in every day.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11577089143",
    "userName": "BaBeRr|Zzz R*D*O*",
    "userUrl": "https://itunes.apple.com/us/reviews/id87756863",
    "version": "4.22.0",
    "score": 5,
    "title": "Virtual scrapbooking",
    "text": "How this Quadruplet as well as Triplet mom keeps my pixelated artistry organized! Thanks for the app",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11569602543",
    "userName": "!123Person123!",
    "userUrl": "https://itunes.apple.com/us/reviews/id1662592511",
    "version": "4.21.1",
    "score": 4,
    "title": "Honest App Review",
    "text": "This app is great…. I rly enjoy being able to document everything but there are problems. Like ads there are ads everywhere. Another problem is the fact that to get the best experience you gotta pay to get premium updates or upgrades. Like changing things or editing. Overall this app is pretty good.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11530938444",
    "userName": "MikkeleSuzanne",
    "userUrl": "https://itunes.apple.com/us/reviews/id36912476",
    "version": "4.20.0",
    "score": 5,
    "title": "Love this app",
    "text": "I take tons of live photos and never knew what to do with them before 1 Second Everyday. This app is the only way I’ve been able to consistently document and organize my days. Had the app for 2.5 years, and I still have never missed a day and it’s so fun to watch back!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11516112453",
    "userName": "user64687535",
    "userUrl": "https://itunes.apple.com/us/reviews/id1388758271",
    "version": "4.20.0",
    "score": 5,
    "title": "Using it since 2014",
    "text": "No matter what I’m making my seconds 10 years in a row!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11494688937",
    "userName": "Prodoehl",
    "userUrl": "https://itunes.apple.com/us/reviews/id272576726",
    "version": "4.20.0",
    "score": 5,
    "title": "Been using for years, well worth it!",
    "text": "Been using the app for years, WELL worth it!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11493005553",
    "userName": "Memory making made easy!",
    "userUrl": "https://itunes.apple.com/us/reviews/id337453438",
    "version": "4.20.0",
    "score": 5,
    "title": "Memory making!!",
    "text": "Awesome! Easy! A year of making memories!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11489609201",
    "userName": "Britters🫶🏾",
    "userUrl": "https://itunes.apple.com/us/reviews/id649533784",
    "version": "4.20.0",
    "score": 5,
    "title": "Love",
    "text": "Love this app it’s a fun way to keep track of your month! Would recommend especially for monthly recaps 🫶🏾",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11480958021",
    "userName": "rxr14",
    "userUrl": "https://itunes.apple.com/us/reviews/id702344811",
    "version": "4.20.0",
    "score": 5,
    "title": "10/10",
    "text": "Honestly I love this app it makes me happy to look at all the memories!!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11466998770",
    "userName": "MAJohnson.",
    "userUrl": "https://itunes.apple.com/us/reviews/id1615813310",
    "version": "4.19.0",
    "score": 5,
    "title": "this app is the best",
    "text": "so fun to look back on all the clips!! no complaints at all, app runs well. great idea! thanks!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11453859558",
    "userName": "Grammy 87",
    "userUrl": "https://itunes.apple.com/us/reviews/id543471872",
    "version": "4.19.0",
    "score": 4,
    "title": "Just one thing…",
    "text": "I love the app, and have made some very cool projects on it. I love being able to pick the song for my project, but some songs I wanna use are simply too fast for allowing the clips to switch on beat. It would be amazing to be able to set the bpm to a non-whole number. One song I wanted to use was 119 bpm, but I didn’t want all my clips to be half a second long. When I set it to 60, after a while it was off beat. Being able to just set it to 59.5 would’ve been perfect, but I could only pick a whole number. Other than that the app is really fun and allows for some fun memories.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11452838815",
    "userName": "EnnCue",
    "userUrl": "https://itunes.apple.com/us/reviews/id221797557",
    "version": "4.19.0",
    "score": 5,
    "title": "A different perspective on your life",
    "text": "Wish I’d discovered this app sooner. I love the short snippets that you already have on your phone. It provides a different perspective on your life plus it encourages you to take some pictures of ordinary daily life and also gets you out doing more so you can post a picture. Plus, great customer service when I was having some uploading issues.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11443643314",
    "userName": "peepeepopper",
    "userUrl": "https://itunes.apple.com/us/reviews/id1060616269",
    "version": "4.19.0",
    "score": 1,
    "title": "wow",
    "text": "literally deleted my account because i “had not been using it” despite me logging on once a month to watch the memories i had made during high school. i had deleted them from my camera roll since i had them on this app so now they’re all gone.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11423641988",
    "userName": "Reouch",
    "userUrl": "https://itunes.apple.com/us/reviews/id154768121",
    "version": "4.19.0",
    "score": 5,
    "title": "I’ve been using over 10 years!",
    "text": "This is my favoritest app. I can watch my kids grow up one second at a time.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11408711848",
    "userName": "Nobueno_7294926",
    "userUrl": "https://itunes.apple.com/us/reviews/id404299505",
    "version": "4.19.0",
    "score": 1,
    "title": "Deleted my account without warning",
    "text": "They deleted my account and only notified me AFTERWARDS. I’m not sure who’s in charge of user retention but obviously they are not very good at their job.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11396561530",
    "userName": "Wolf0992",
    "userUrl": "https://itunes.apple.com/us/reviews/id36149205",
    "version": "4.18.0",
    "score": 5,
    "title": "I’ve been using it for years!",
    "text": "I’ve been using this for over 4 years since my first son was born. I’ve been making them a 1SE for both of my boys now for every year of their life. It has been so sweet!! Everyone I show the videos to loves them! I seriously want to do a 1SE every year for them until they’re 18 - if they let me 🙃",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11384140401",
    "userName": "Kimberly L. P.",
    "userUrl": "https://itunes.apple.com/us/reviews/id36124992",
    "version": "4.18.0",
    "score": 5,
    "title": "Favorite app!",
    "text": "If I could only have 5 apps this would be one of them. I’ve been using this for years and documenting a second a day since 2015. I love going back to see my timeline and how it transitions from meeting my husband, traveling the world, our pets, and now onto our kids. I’ve also captured historical/influencial events and it’s neat to see where we were in life when those things happened. This app brings happiness and makes you appreciate all the little moments you’ve had in life. Thank you for making this!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11380979066",
    "userName": "klashure62",
    "userUrl": "https://itunes.apple.com/us/reviews/id652217999",
    "version": "4.18.0",
    "score": 2,
    "title": "cool thought. too pricey.",
    "text": "the idea of this app is awesome. we talked about it during a work meeting and we al thought it sounded so fun to try it out. i downloaded and found a 7 day free trial and then 3 plan options. 49.99/ year. 9.99/month. 249.99 for lifetime access. seems wild considering i can record on my camera app and then store in a separate calendar. but for those who want it all nice in curated in one location, and don’t mind paying for it, then probably a great app. just wish they would be transparent with the pricing PRIOR to me downloading and upping their download count. seems like inaccurate statistics considering i immediately deleted.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11378645506",
    "userName": "🥰love🥰",
    "userUrl": "https://itunes.apple.com/us/reviews/id793500295",
    "version": "4.18.0",
    "score": 5,
    "title": "Good.",
    "text": "It’s good.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11371158917",
    "userName": "Cookie Monster 720",
    "userUrl": "https://itunes.apple.com/us/reviews/id25605424",
    "version": "4.18.0",
    "score": 5,
    "title": "Amazing",
    "text": "I love looking back at my old memories and remembering how fun life can be",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11359055400",
    "userName": "Marshallf4",
    "userUrl": "https://itunes.apple.com/us/reviews/id27352858",
    "version": "4.18.0",
    "score": 1,
    "title": "WARNING FRAUDULENT APP",
    "text": "This app offers a 7 day free trial but if you sign up for it you will be charged 49.99 immediately. I assumed that Apple is vouching for app developers, but no, they can charge your card and Apple will not refund you. My request was denied twice by Apple. The Apple support representative told me this app looks sketchy (no contact information on their support page) but I needed to contact the app developer about their fraudulent charge. As of now, I’m out $50 and I want people to know that Apple does not guarantee that these third party app developers will deliver what they claim or that they will not charge your card.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11354839545",
    "userName": "cdubyainatx",
    "userUrl": "https://itunes.apple.com/us/reviews/id32960966",
    "version": "4.18.0",
    "score": 3,
    "title": "PLEASE go back to old Caption and date placement",
    "text": "Hi, can you please revert to the old date and caption function! The middle left of the screen is obtrusive and the captions are now WAY to small to read. Thank you!\n\nDifferent does not always mean better. Please don’t break something this is working just fine!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11349088861",
    "userName": "iosppnbeg",
    "userUrl": "https://itunes.apple.com/us/reviews/id1335423727",
    "version": "4.17.0",
    "score": 5,
    "title": "Love it",
    "text": "I just surpassed my 1030th 1SE video and I am still obsessed with the simplicity and creativity of the app. \n\nI do have one simple question however. I want to have my project on another device as well but even if I log into the account that has my 1SE streak, it doesn’t come up on my new phone. How can I continue on my new phone so I don’t have to use my old one any longer?",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11347465469",
    "userName": "Faerie fun",
    "userUrl": "https://itunes.apple.com/us/reviews/id666232932",
    "version": "4.17.0",
    "score": 5,
    "title": "1 Second Everyday",
    "text": "I have been using this app for 5 years. I love photography, storytelling, and daily recordings so it is a permit fit for me. The video format enables hearing the voices of people I love, listening to music if playing, understand the context of pictures, and enjoy sounds of nature. The support staff is attentive and extremely helpful when solving issues and/or answering questions.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11347368070",
    "userName": "Faerie fun",
    "userUrl": "https://itunes.apple.com/us/reviews/id666232932",
    "version": "",
    "score": 5,
    "title": "1 Second Everyday",
    "text": "\"I have been using this app since 2018.  I love photography, storytelling and documenting on a daily basis so it is perfect for me.  I especially enjoy the video feature because I can record the voices of people I love, music playing, and the sounds of nature.  Even if I am at home alone and it is too cold to go outside, I take pictures of things in my house I treasure like a book I'm reading, a favorite painting, a plant, the fireplace warming, a pet.  The support staff is amazing - attentive and thorough if there is an issue \nor a question.  I highly recommend this app.\"",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11343122807",
    "userName": "Steeze Weezler",
    "userUrl": "https://itunes.apple.com/us/reviews/id23483199",
    "version": "4.17.0",
    "score": 5,
    "title": "Super helpful",
    "text": "The support folks at 1SE were all so helpful helping me fix a glitch in my account!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11340810913",
    "userName": "Jilopy Jim",
    "userUrl": "https://itunes.apple.com/us/reviews/id427832537",
    "version": "4.17.0",
    "score": 1,
    "title": "$50 a year????????",
    "text": "Seems very expensive",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11340066920",
    "userName": "Kitsyn",
    "userUrl": "https://itunes.apple.com/us/reviews/id16994661",
    "version": "4.17.0",
    "score": 5,
    "title": "Fun app!",
    "text": "This app lets you collect one to three seconds of video every day, and compiles them into a short movie every month and at year end. It’s really fun to later look back on the snippets of my life and remember what I was doing a year or more ago.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11338346705",
    "userName": "Hi_1029384756",
    "userUrl": "https://itunes.apple.com/us/reviews/id186800208",
    "version": "4.17.0",
    "score": 5,
    "title": "The Best!",
    "text": "I started using 1 Second Everyday in 2021 and absolutely Love it! Hence, I upgraded to Pro and have been recording each year since! It is my “Live Daily Journal!” I highly recommend this App and guarantee you will not be disappointed!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11336386795",
    "userName": "stateofshock89",
    "userUrl": "https://itunes.apple.com/us/reviews/id1387985825",
    "version": "4.17.0",
    "score": 1,
    "title": "Great app unless something goes wrong",
    "text": "I used this for 2 years and have really loved it but for some reason it logged me out of my account and created me a new account and it’s been extremely hard to get the help I need to fix the problems I’m having.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11328469604",
    "userName": "Stef’sInsight",
    "userUrl": "https://itunes.apple.com/us/reviews/id1103256483",
    "version": "4.17.0",
    "score": 5,
    "title": "Fantastic app that I use everyday",
    "text": "Started using the app to track my first child growth and never stopped. Now have another project going for my second child. Love the rewind feature, which shows you the moments from past years. Easy to input and easy to watch playback. Became a pro member because I feel more secure that these memories are backed up.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11324452902",
    "userName": "Coronabot",
    "userUrl": "https://itunes.apple.com/us/reviews/id36610338",
    "version": "4.17.0",
    "score": 2,
    "title": "Could be a great app but so buggy",
    "text": "I have been using this app since 2015. I keep hoping they will work out all the bugs. But alas, the same problems persist. It crashes all the time. It takes a while to load so if you are quickly trying to take your daily video, the moment has passed before the in app camera works. Instead, you have to take a video. Then go into the app and upload it. Kind of annoying for an app designed to be used every day. I tried to export a 5 year video to give to my husband for our anniversary, but I can’t download the video because the app is so buggy. The concept is incredible. I’ll probably hang on as a user in the hopes that it will improve.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11322286931",
    "userName": "Gela39",
    "userUrl": "https://itunes.apple.com/us/reviews/id241763637",
    "version": "4.16.0",
    "score": 5,
    "title": "I love this app!",
    "text": "I love having a tiny clip from each day. This app lets you make videos for the year, month, or even just a week. I love seeing my memories from previous years pop up in my rewinds every day! Easy to use, great support when I have questions!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11320313807",
    "userName": "62Super7",
    "userUrl": "https://itunes.apple.com/us/reviews/id103102195",
    "version": "4.16.0",
    "score": 5,
    "title": "Love the app",
    "text": "It’s so much fun to see what happened in years past, sometimes I forget what or where I was and 1 sec brings it all back. Great app",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11318524042",
    "userName": "Aplank14",
    "userUrl": "https://itunes.apple.com/us/reviews/id135223544",
    "version": "4.16.0",
    "score": 1,
    "title": "Keeps getting worse",
    "text": "I am so confused why they keep updating this app. I have been using this app since 2017 and almost all of the updates have been negative. The UI keeps changing for no particular reason (font sizes and type, doesn’t auto prompt for captions, location of overlays), free features become paywalled, more and more notifications saying “Go pro or you will lose all your snippets!”, and so on. The one feature they introduced that I really liked (shows you snippets from all prior years on that day), they just removed in the most recent update. I would switch to something else but I am so invested I have to keep using it. Really disappointing overall. Makes me wonder if the devs and PMs enjoy making the app worse 🤔",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11318499158",
    "userName": "_KC_one",
    "userUrl": "https://itunes.apple.com/us/reviews/id312961834",
    "version": "4.16.0",
    "score": 5,
    "title": "Wonderful App",
    "text": "I have been using this app since 2019 almost every day. I love being able to look back to previous years and see what I did on any given day. Today I went to record and I noticed I can no longer see past years under today's date. Is this a glitch? A change? Something that is now in only the pro version? Please help! This was one of my favorite features.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11314151136",
    "userName": "bobbbbbbbbbbbbb b",
    "userUrl": "https://itunes.apple.com/us/reviews/id188197837",
    "version": "4.16.0",
    "score": 5,
    "title": "Best App",
    "text": "I love this app and have used it for years. Great way to capture memories and life.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11296569968",
    "userName": "Engpunk",
    "userUrl": "https://itunes.apple.com/us/reviews/id140011812",
    "version": "4.16.0",
    "score": 5,
    "title": "Love this!",
    "text": "I’ve been using this app for a couple of years now. I absolutely love it. I push play and watch my year in review often, and I always make people watch it with me on New Year’s Eve before a new one starts. It is so cool to see your year flash by in 365 seconds.  The way that each square on the calendar opens up the pictures you have on your phone from that day, makes it so quick and easy to use daily or to even catch up when you’re a few days behind after a vacation. Great app, one of my absolute favorites.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11246688576",
    "userName": "Ashley Bartanen",
    "userUrl": "https://itunes.apple.com/us/reviews/id648258114",
    "version": "4.15.0",
    "score": 5,
    "title": "User friendly",
    "text": "I just finished making a year-long video, one second a day. The app made it really easy to do. Everyday i’d take a video or Live Photo (those work too) with my iPhone camera app and about once a week i’d go into the app and choose a second for each day from the videos. The app shows a calendar and has a little video symbol on each day that you took a video, when you click on the day it pulls up all the videos on your camera roll from that day. Basically it sorts everything for you and makes it really easy to do. Some days I forgot to take a video, and would just add two videos from another day. You can edit each clip in the app. The end result turned out really great, and these memories of my young kids will be so special in years to come. They changed a lot in one year!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11246582134",
    "userName": "ahtnamaSRA",
    "userUrl": "https://itunes.apple.com/us/reviews/id609277930",
    "version": "4.15.0",
    "score": 4,
    "title": "I really like this app.",
    "text": "On a whim, I decided to download it in order to document my senior year of high school. I haven’t missed a day of the last year and the app has encouraged me to take more pictures. I am looking forward to looking back at the last year.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11222581229",
    "userName": "womo worm",
    "userUrl": "https://itunes.apple.com/us/reviews/id1459317226",
    "version": "4.15.0",
    "score": 2,
    "title": "Unfortunate",
    "text": "I’ve been using this app for 3 years now and have loved it until now. Over time I’ve seen many free features turned into paid features and i think it will only get worse. 1 freestyle project and backups of 365 snippets used to be free, but now every snippet has this massive exclamation mark on it saying i need to pay and back it up. And even tho i don’t need the freestyle project anymore, i can’t delete it cause that means I’ll lose my free freestyle forever. I can’t even optimize my space because that costs money. The logo on the summary videos are much more obtrusive now compared to the beginning of the year when it was subtly in the corner. Now it’s in your face massive right on the center side and if I want it to go away I need to pay. I think I might move apps soon tbh",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11207868101",
    "userName": "underwater_fish",
    "userUrl": "https://itunes.apple.com/us/reviews/id700341262",
    "version": "4.14.2",
    "score": 4,
    "title": "Love! But recent glitches!! PLEASE FIX",
    "text": "I LOVE 1SE. I’ve been consistently using it since fall of 2019, and it’s one of my favorite things! However, recently I’ve been having issues with getting into the journal sections of the app. Usually, it’s a quick tap and I’m in and can type up my journal entry for the day. Now it either takes numerous tries or doesn’t work at all. This is devastating, and it’s caused me to fall way behind in my usual daily photo and journal updates. PLEASE FIX!!!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11194146970",
    "userName": "Photo Diary",
    "userUrl": "https://itunes.apple.com/us/reviews/id1649944396",
    "version": "4.14.2",
    "score": 5,
    "title": "Love the app",
    "text": "I’ve been using the app for a few years now & it’s been such a positive experience. I ran into an issue with transferring my photos to a new device for the first time today and sent a message to support after 10pm, not expecting a reply for at least 24 hrs. To my surprise, I got a response within minutes and my issue is now resolved.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11188121658",
    "userName": "Customer -22333",
    "userUrl": "https://itunes.apple.com/us/reviews/id1211139967",
    "version": "4.14.2",
    "score": 1,
    "title": "Charged me $50 even though I didn’t buy premium",
    "text": "It’s fine but they charged me without my awareness",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11177726296",
    "userName": "nitr231",
    "userUrl": "https://itunes.apple.com/us/reviews/id148266025",
    "version": "4.14.2",
    "score": 1,
    "title": "Switched to a subscription model",
    "text": "I paid for this app some time ago but now they constantly ask for a subscription or show ads. It used to be a great app but now I can’t stand to use it. Please at least offer a grandfather option for the users who already paid to download the original app. You don’t have to offer the new features for free, but it would be nice to not show ads or paywalls for those who already paid.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11142245676",
    "userName": "Ah2246",
    "userUrl": "https://itunes.apple.com/us/reviews/id187702772",
    "version": "4.14.2",
    "score": 1,
    "title": "App has gone downhill",
    "text": "I have been a subscriber for two years (and this isn’t a cheap app!). Sad to say I will not be renewing. The app has gone so far downhill. It’s super buggy and there are issues that can only be resolved through back and forth conversations with their chat… which still don’t always work. Definitely recommend looking elsewhere!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11139187956",
    "userName": "fmdidnsbxjdkslakqdbbd",
    "userUrl": "https://itunes.apple.com/us/reviews/id1293917275",
    "version": "4.14.2",
    "score": 3,
    "title": "Make notifications stop!",
    "text": "I love the app, but please for the love of all that is holy make the notifications stop. I’ve turned them off in the app, and even in iOS. The app ignores all this and keeps reminding me to use it, even though I’ve used it every day for the last two years. It even reminds me AFTER I’ve already recorded the second for that day. \n\nThis “feature” has survived reboots , reinstalls, etc. It’s clearly a bug at this point.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11124646585",
    "userName": "Prof.Puppyfeet",
    "userUrl": "https://itunes.apple.com/us/reviews/id946155146",
    "version": "4.14.2",
    "score": 5,
    "title": "Awesome app ,great customer service",
    "text": "I’ve been using 1sed for quite some time now and it’s fun and easy to use. \nI’ve only ever had one issue and contacting customer service and addressing it was a breeze. \nI love seeing my little mash ups at the end of the month. I’d recommend this app to everyone.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11117624538",
    "userName": "pcmowmowpunch",
    "userUrl": "https://itunes.apple.com/us/reviews/id552745180",
    "version": "4.14.2",
    "score": 5,
    "title": "Great customer service",
    "text": "The app has been great for documenting the past few years of my daughters lives, the latest reconciliation of closing old accounts revealed to me that I actually had two accounts. They’re super responsive and I can tell they work hard.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11114108659",
    "userName": "Lncs85",
    "userUrl": "https://itunes.apple.com/us/reviews/id184661810",
    "version": "4.14.2",
    "score": 5,
    "title": "Best app for new parents",
    "text": "1 second every day is the amount of time I have to spend on compiling family photos with an infant, and this app is absolutely perfect. Auto fill makes it so easy to edit and we watch the compilation of our six month old’s life all the time. \n\nThe only 2 improvements I’d suggest:\n\nIt’s a little annoying having to select all manually  when I want to play from the beginning, even though I appreciate the ability to select week or month and do occasionally want to use those.\n\nI also wish it were easier to add a bunch of the clips from one project to another with one tap each.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11087916053",
    "userName": "Nerdy Pete",
    "userUrl": "https://itunes.apple.com/us/reviews/id13949356",
    "version": "4.14.1",
    "score": 3,
    "title": "App is ok but now the caption is too small",
    "text": "My previous issue has been fixed, I can still add too clips per day. Thank you.\n\nI have a new issue—the new caption format is way to small. The original caption was already too small but the new default is so small I have trouble reading it even with my glasses on. I suspect it’s less small when you do your 1SE in portrait but I do mine in landscape. Please allow us to set our own default caption format! It is so frustrating to have to manually choose every time I export (I export everyday). Thanks!\n\nMy previous review:\nThanks to the devs for fixing a recent bug that just seemed unfair. It’s still a little dodgy take away the ability to save 2 clips per day from new users. I still feel like the fee to go premium is too high and wish that we could sink our projects to iCloud or other services that would not require much from the devs. But it is what it is. Thanks again for fixing the bug for us grandfathered in.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11080395936",
    "userName": "Parisnight",
    "userUrl": "https://itunes.apple.com/us/reviews/id32806740",
    "version": "4.14.0",
    "score": 2,
    "title": "Used to love it…",
    "text": "Every time I record a clip I’m asked if I want to pay to have the clips on all my devices. I keep saying no. I’m tired of being asked. Thinking of finding a different app…",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11066138758",
    "userName": "agitare",
    "userUrl": "https://itunes.apple.com/us/reviews/id48891971",
    "version": "",
    "score": 5,
    "title": "Best App on my phone",
    "text": "I have been using the App since 2016 and absolutly love it. It is easy to use, but if you need help the support team is fantastic, super fast and easy to understand replies. \nI only wish I had this App when my kids were little.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11062509804",
    "userName": "Bigし",
    "userUrl": "https://itunes.apple.com/us/reviews/id235835737",
    "version": "4.13.0",
    "score": 1,
    "title": "10 years of one seconds GONE",
    "text": "I’ve lost 10 years of 1seconds and I’m beyond devastated. I don’t know why they deleted it. I was absolutely using it, and I deleted the app off my phone for storage issues (I was transferring to a new phone), thinking it would be safe within my account. When I tried to sign in again, my account was GONE. \nAbsolute loss of words, 10 YEARS GONE. Beware of this app deleting your info!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11052344800",
    "userName": "kornkob07",
    "userUrl": "https://itunes.apple.com/us/reviews/id1139251873",
    "version": "4.13.0",
    "score": 5,
    "title": "Thank you",
    "text": "This app contains so many memories for me, and whenever I’m having a hard time, I can always look back and appreciate everything that has happened. Tysm for keeping this app running.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11045878404",
    "userName": "slambrandon",
    "userUrl": "https://itunes.apple.com/us/reviews/id433029904",
    "version": "4.13.0",
    "score": 1,
    "title": "They deleted my account that was grandfathered from the beginning",
    "text": "Marilyn scammed me out of my grandfathered account. I supported this company from the beginning, and they deleted my account and told me it was my fault because I hadn't used it in the past 18 months. No loyalty. I was reaching out to BBB and filing a complaint.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "11035361141",
    "userName": "Jeffreyzie",
    "userUrl": "https://itunes.apple.com/us/reviews/id291153419",
    "version": "4.13.0",
    "score": 5,
    "title": "Love this app BUT… 👇🏾",
    "text": "Long time user and love this app, but Inwish there was a way to upload videos from the previous day. \n\nFor example, it’s Monday night for me right now but it’s 1:51am so it’s technically Tuesday. So the videos I create right now isn’t showing up for the Monday upload cause it counts as a Tuesday \n\nWould be amazing if yall changed this 🙏🏾♥️",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10997264248",
    "userName": "naerial",
    "userUrl": "https://itunes.apple.com/us/reviews/id579655799",
    "version": "4.12.1",
    "score": 4,
    "title": "Watch ads for multiple posts is broken",
    "text": "It’s a wonderful app. Well designed. Easy to use. The compilations are fun to watch.\n\nBut the watch ads to post multiple clips never works. I consistently have to sit through three or four ads before it finally unlocks. These aren’t the short ads either. I totally understand needing ads to monetize but don’t tell me I’m going to get something for the ads then not deliver.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10993636119",
    "userName": "Jan--T",
    "userUrl": "https://itunes.apple.com/us/reviews/id1191593130",
    "version": "4.12.1",
    "score": 5,
    "title": "Great",
    "text": "I’ve had this app for a few years now and I really like it. There does seem to be a glitch for the leap year 😂 but I find it more amusing than anything else. It’s nice to see growth from year to year",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10982251136",
    "userName": "Gouges",
    "userUrl": "https://itunes.apple.com/us/reviews/id167128536",
    "version": "4.12.1",
    "score": 5,
    "title": "This app is the best.",
    "text": "I have been using this app EVERYDAY for the past 3 years. It has never charged me, or made\nme pay to use it. You get so many great things for free. Being able to see basically my entire life from the past 3 years is amazing. This app is literally my favorite",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10960818001",
    "userName": "RoninOtter",
    "userUrl": "https://itunes.apple.com/us/reviews/id28308268",
    "version": "4.12.1",
    "score": 5,
    "title": "An emotional app I literally use every day",
    "text": "With the exception of my photos themselves, this app is probably the single most important app in my phone emotionally. It has been a remarkable change in my life to be able to look back on all of the moments that I want to remember in such a compact format. my memory gets jogged of things that I had momentarily forgotten about, and I smile every single time I playback one of the videos.\n\nI know this is one of the more expensive subscriptions as far as a mobile app is concerned, but for me, it is worth the cost. Partially because I know from experience that this team running the app has personal investment in seeing it succeeded. I once had a bug in the app where I was having trouble getting access to my older videos, and their support team responded promptly, and a software fix was issued very shortly afterwards. These folks get it, and this is a service that I am happy to pay for. \n\nThe app itself is easy to use, and the push notifications are ones I actually find genuinely helpful to remember to record my segment every day. I also love the ability to create ad hoc projects that are specific to a particular trip or event. This is an app that I genuinely wish I had many years ago. Thanks 1SE team. ❤️",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10953851674",
    "userName": "K. Wren Leigh",
    "userUrl": "https://itunes.apple.com/us/reviews/id445952450",
    "version": "4.12.1",
    "score": 2,
    "title": "Used to be so easy",
    "text": "I enjoyed using this app 2016-17, but I fell out of the habit of updating it. Thought I would return, but the interface is needlessly overcomplicated from what it used to be. Sad!",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10939808510",
    "userName": "xJxVx",
    "userUrl": "https://itunes.apple.com/us/reviews/id9472251",
    "version": "4.12.0",
    "score": 1,
    "title": "Suddenly unresponsive??",
    "text": "Not sure why my app suddenly keeps freezing, but it’s really annoying to be a premium member and have it waste my time.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10897216747",
    "userName": "AddisonLilac",
    "userUrl": "https://itunes.apple.com/us/reviews/id1140827072",
    "version": "4.11.4",
    "score": 2,
    "title": "Why The Change?",
    "text": "I used to have this app and loved it but I wasn’t using it too often so I deleted it. I redownloaded it because I wanted to record some stuff and now you have to pay for a subscription??? I understand that you need to make money, but you literally can only have one journal now and the rest you have to pay for which I know it wasn’t like previously. It just seems so janky to me, why change it? If it was a one time fee I might’ve bought but I will not be paying every month for this app.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10892623469",
    "userName": "Karen_M_A",
    "userUrl": "https://itunes.apple.com/us/reviews/id37963088",
    "version": "4.11.4",
    "score": 5,
    "title": "Best Video Journal",
    "text": "This app is fun and easy to use. It makes a great video diary of your year or use it to make a fun video journal of a vacation, etc. I’ve been using it for about five years and I love how user-friendly it is. And customer service is A++ if you need support.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10891314959",
    "userName": "emmaburritos",
    "userUrl": "https://itunes.apple.com/us/reviews/id1311885921",
    "version": "4.11.4",
    "score": 4,
    "title": "great app! a few things tho.",
    "text": "first off i don’t like the ads they put in now but it’s fine. the main thing is, whenever i save my monthly videos and am exporting them, im able to add music to it if i want, but it only works for Apple Music. i wish it worked for Spotify, i always use spotify and i have spotify premium but i don’t ever use apple music. \n\nother than that tho the app is pretty cool",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10890735713",
    "userName": "TeragramSF",
    "userUrl": "https://itunes.apple.com/us/reviews/id101060499",
    "version": "4.11.4",
    "score": 5,
    "title": "Love 1SE for photo journaling my life!",
    "text": "Try it, you’ll love it! I’ve been using the PRO Version the last few years and love all the additional features that are available and their Customer Service is always helpful if needed 😀",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  },
  {
    "id": "10878640216",
    "userName": "rni42x",
    "userUrl": "https://itunes.apple.com/us/reviews/id825094345",
    "version": "4.11.4",
    "score": 2,
    "title": "Not intuitive and ridiculously priced",
    "text": "This is a good idea for an app but the interface is incredibly unintuitive and they are insane for the amount they charge to upgrade to pro. $250 for a lifetime use is, frankly, dumb. And what’s included (or the lack of what’s included) in the free version is insulting. Straight up not worth it.",
    "url": "https://itunes.apple.com/us/review?id=587823548&type=Purple%20Software"
  }
]