[
  {
    "id": "12378919922",
    "userName": "David_0909",
    "userUrl": "https://itunes.apple.com/us/reviews/id1759367689",
    "version": "1.2.0",
    "score": 5,
    "title": "Great",
    "text": "It a an easy and helpful app",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12377704346",
    "userName": "User 74839",
    "userUrl": "https://itunes.apple.com/us/reviews/id1761758245",
    "version": "1.2.0",
    "score": 1,
    "title": "Do Not Get Subscription",
    "text": "App no longer seems to be capable of keeping entries from the \"saved\" category. Entry will stay for some time but will be gone hours later. Being able to enter \"saved\" meals was the main appeal of this app in my opinion. I wish I had not purchased the subscription given that the app no longer delivers on this essential function.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12376039497",
    "userName": "701 eloy",
    "userUrl": "https://itunes.apple.com/us/reviews/id1483320441",
    "version": "1.2.0",
    "score": 4,
    "title": "Algo bien",
    "text": "Algo bien",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12363297730",
    "userName": "Andrradeagus",
    "userUrl": "https://itunes.apple.com/us/reviews/id1499779517",
    "version": "1.1.19",
    "score": 5,
    "title": "Fácil uso",
    "text": "Espero q me ayude con mi perdida d peso",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12353237695",
    "userName": "RANDY RALPH FACE",
    "userUrl": "https://itunes.apple.com/us/reviews/id521380292",
    "version": "1.1.18",
    "score": 1,
    "title": "Scam",
    "text": "Inferior calorie tracker. They also bait and switch you with pricing. Advertise a discount and then charge you a different price. Unresponsive to outreach. Avoid at all costs!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12352327574",
    "userName": "bridget :3",
    "userUrl": "https://itunes.apple.com/us/reviews/id1242565019",
    "version": "1.1.18",
    "score": 2,
    "title": "Its just okay",
    "text": "I feel really iffy with this app, when tracking i can only use the ai and when i eat out it doesnt give the option to just say where i got the food and put in the calories according to the menu from the restaurant. \nIt also forces you to just buy the early plan without any other option or trial, it’s not fair to the customer to explore their options. You have to look at your apple account just to choose a different plan and even then there is still no trial once it’s bought.\nI feel like offering a trial first would be nice and just being able to understand what the app is first before deciding to buy a plan. personally not for me and i wish there was a way to get refunded.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12350241446",
    "userName": "Jonfilms",
    "userUrl": "https://itunes.apple.com/us/reviews/id308459640",
    "version": "1.1.18",
    "score": 2,
    "title": "Free Trial..?",
    "text": "Wanted to try this app out since I find the whole calorie estimator interesting. However this app on download puts up a pay wall with no option to try it out. Occasionally I get a notification of a “Free Trial” but then it throws up the pay wall again to pay first… It feels really suspicious and deceiving as if they just want me to pay for it first before going on free trial.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12339166232",
    "userName": "Gabiooooooooo",
    "userUrl": "https://itunes.apple.com/us/reviews/id420223880",
    "version": "1.1.18",
    "score": 5,
    "title": "GitHub",
    "text": "Love it",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12328235912",
    "userName": "Meli_garrjfj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1246947214",
    "version": "1.1.17",
    "score": 2,
    "title": "Wrong Price",
    "text": "It was unfortunate to see that I bought something for the wrong price. When i downloaded this app, I saw the yearly plan cost $4.99 per month, turns out I had bought some plan I had no idea about for $60 dollars. This might not be the apps fault, it might just be me and I must have missed something but I hope i can get those $60 refunded.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12320191025",
    "userName": "DAL#64",
    "userUrl": "https://itunes.apple.com/us/reviews/id1381448190",
    "version": "1.1.17",
    "score": 1,
    "title": "Rip off/Try trial 1st",
    "text": "Thinking this would make tracking macros would be easier, I chose the one year. It gave totally absurd macros for foods I entered! I tried to cancel & it seems there is zero contact info for customer service so I don’t know what I am doing!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12318571669",
    "userName": "Zeus136",
    "userUrl": "https://itunes.apple.com/us/reviews/id1146558630",
    "version": "1.1.17",
    "score": 1,
    "title": "Feels like a scam",
    "text": "No free version. You can do the same with chat GPT or Gemini. Wasted 5 mins setting it up..",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12303800198",
    "userName": "Speed gggg",
    "userUrl": "https://itunes.apple.com/us/reviews/id1724321713",
    "version": "1.1.17",
    "score": 5,
    "title": "Good",
    "text": "Me like",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12268035673",
    "userName": "nicholassalohcin",
    "userUrl": "https://itunes.apple.com/us/reviews/id771438074",
    "version": "1.1.16",
    "score": 3,
    "title": "great app but needs work",
    "text": "Overall, this is a good app—easy to use and provides a solid ballpark estimate of macros. However, there are a few issues that need to be addressed and features that could improve the experience:\n\t•\tSaved food images sometimes disappear randomly.\n\t•\tUsers should be able to rename saved foods.\n\t•\tBarcode scanning doesn’t always provide exact measurements from the nutrition label.\n\t•\tThe app should integrate with Fitbit, Apple Watch, or Apple Health.\n\t•\tMicronutrient tracking, along with details on fat and carbohydrate types, would be beneficial.\n\t•\tA recipe feature would be a great addition.\n\nThese improvements would make the app even more useful for tracking nutrition accurately.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12213558151",
    "userName": "Jasonpirate",
    "userUrl": "https://itunes.apple.com/us/reviews/id495642198",
    "version": "1.1.13",
    "score": 5,
    "title": "From Ok to Great!",
    "text": "When I first got this app, I purchased the 1 year subscription. The app worked well and I was happy with the convenience of a picture to macros app. There were some UI bugs occasionally and sometimes the app would forget a whole day of food. Plus I couldn’t check far back history. Now after the latest major update, those issues are old news. I am happy every time I use the app. Plus they now have a label snapping function which is great. Love FITHUB. I definitely recommend it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12193414624",
    "userName": "girishnova",
    "userUrl": "https://itunes.apple.com/us/reviews/id1410485336",
    "version": "1.1.12",
    "score": 2,
    "title": "Would be great if it worked properly",
    "text": "Great concept, and sometimes it works alright but even when you scan a barcode it will incorrectly input the calories and protein. One of my protein bars I put in had 180 calories and it put in 250. If it can't even accurately count a barcode calories how am I supposed to count on it to accurately count a picture or a description?",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12115336835",
    "userName": "Nat LeBlanc",
    "userUrl": "https://itunes.apple.com/us/reviews/id1266841063",
    "version": "1.1.1",
    "score": 1,
    "title": "Poorly made and hard to use",
    "text": "The app is not good. You have no idea how many calories you had unless you do math because the app only shows the remaining calories. Same for macros. Plus all you can see are macronutrients. And on top of everything, it is a paid app. I saw an add on Instagram and thought it would be a good one to try. But it is not worth it. The idea is good, but it needs some serious improvement.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12075130696",
    "userName": "Chill edgar",
    "userUrl": "https://itunes.apple.com/us/reviews/id1733339707",
    "version": "1.1.1",
    "score": 5,
    "title": "Cool",
    "text": "I can see this as a way for people that want to track their calories",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12069911864",
    "userName": "Limo Usine",
    "userUrl": "https://itunes.apple.com/us/reviews/id31131259",
    "version": "1.1.1",
    "score": 1,
    "title": "Doesn’t even give trial access before asking you to pay",
    "text": "Didn’t even use the app because it asked me to pay immediately after downloading it. Doesn’t even have an option to test out the app itself. It just goes straight to a payment screen. These fitness app will only help you if you have the money for it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12060451611",
    "userName": "Viking Jess1010",
    "userUrl": "https://itunes.apple.com/us/reviews/id46234485",
    "version": "1.1.1",
    "score": 1,
    "title": "Forced rating",
    "text": "This thing makes you click 5 star rating even before trying the app. Then you get to the end of the questions and it asks for money. It’s a no.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12024207212",
    "userName": "Bnhhhh",
    "userUrl": "https://itunes.apple.com/us/reviews/id489223239",
    "version": "1.1.1",
    "score": 5,
    "title": "Sonel",
    "text": "Very nice",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12019631998",
    "userName": "mightydek",
    "userUrl": "https://itunes.apple.com/us/reviews/id941597674",
    "version": "1.1.1",
    "score": 3,
    "title": "Please add a trial, I beg of you",
    "text": "Even if it’s only like 3 days or something like that having a trial to get to experience the app before laying down money would allow me to try it and see if I want to spend the money, if I don’t then that tells you that you need to improve the app but if I do like it you will have yourself a long lasting customer. Please",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12018324622",
    "userName": "wittydude",
    "userUrl": "https://itunes.apple.com/us/reviews/id549792091",
    "version": "1.1.1",
    "score": 5,
    "title": "Haven’t used yet",
    "text": "Rates it 5 stars on hopes it meets my expectations",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11994619561",
    "userName": "leveredmong",
    "userUrl": "https://itunes.apple.com/us/reviews/id244123913",
    "version": "1.1.1",
    "score": 1,
    "title": "half built",
    "text": "having to pay with no trial should have turned me away but I was hopeful as I’ve never stuck with myfitnesspal since it was so tedious to log everything, this offered the solution! \n\nthe AI portion of the app is great. some things need tweaking, but it’s. great starter point. that’s the 1 star. here’s why I regret my purchase\n- No connection to apple health \n- Not easy to correct macros/values \n- Buggy adjustments when you correct the grams \n- diary history only goes back a week\n- calling it a diary is a stretch. there’s no insights other than calories and macros \n- no dashboards to show progress over time or high level insight \n- barcode scanner is wonky as other reviews have mentioned \n- no widgets\n- no manual entry; you *must* use the AI. Coupled with the fact that adjusting the AI suggestions is incredibly difficult, this makes the app harder to use than just entering things manually in the first place. \n\nnot sure if they read these reviews, if updates will be made, or if this was just a quick cash grab. a lot of these reviews look fake. I submitted product feedback but never got a response of any kind. so here I am. buyer beware, this app is not a finished product.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11980295375",
    "userName": "Biggie 7575",
    "userUrl": "https://itunes.apple.com/us/reviews/id1724606919",
    "version": "1.1.1",
    "score": 5,
    "title": "Good",
    "text": "Good",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11966617953",
    "userName": "Dylan’s reviews123",
    "userUrl": "https://itunes.apple.com/us/reviews/id512348009",
    "version": "1.1.1",
    "score": 2,
    "title": "Not great",
    "text": "I made a YouTube video where I tested the accuracy of this app on 5 different meals: avocado toast with egg, a PB&J, chicken broccoli rice, a banana, and a chipotle burrito bowl.\n\nIt was reasonably accurate on the avocado toast, and the chicken broccoli rice meal (even though it thought the chicken was tilapia).\n\nThe PB&J and the chipotle bowl were very far off. It got less than half of the calories and a third of the protein for the burrito bowl.\n\nFor the banana it actually told me it was 0 calories and 0 of any macros. Not even joking. I tried 3 different times to see if it was a bug.\n\nI find it really not cool that you have to commit to a paid subscription before using the app at all and double not cool that they ask for a review before you even get to use it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11964040880",
    "userName": "Trelly578",
    "userUrl": "https://itunes.apple.com/us/reviews/id660864706",
    "version": "1.1.1",
    "score": 5,
    "title": "My review",
    "text": "I’ve been using the Fit Hub AI Calorie Tracker app for a while now, and it has completely changed the way I manage my nutrition and fitness goals. The app is incredibly user-friendly, accurate, and packed with features that make tracking calories and macros effortless. The AI suggestions for meals and portion sizes are spot on, and the vast food database ensures I can log anything I eat without hassle.\n\nOne improvement I’d love to see is a feature allowing users to input food quantities in grams, mL, fl oz, and oz. This would make tracking even more precise for those of us who rely on different measurement systems depending on the food or beverage.\n\nOverall, this app is a game-changer for anyone serious about their health and fitness journey. Highly recommend it to anyone looking to level up their calorie tracking!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11962092174",
    "userName": "housespecialfriedrice",
    "userUrl": "https://itunes.apple.com/us/reviews/id1691490182",
    "version": "1.1.1",
    "score": 5,
    "title": "Best app",
    "text": "So convenient!! Thanks :D",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11961232125",
    "userName": "TheKing77891",
    "userUrl": "https://itunes.apple.com/us/reviews/id744765619",
    "version": "1.1.1",
    "score": 2,
    "title": "Good Design but not accurate",
    "text": "It’s a good idea and if it worked properly it’d be 5/5 stars, but it doesn’t quite work like it’s supposed to, I scanned a zebra cake that has 320 calories and it says that there is 198, and a brownie that is 200 calories as 400, overall it is a good concept but a bit more work needs to go into it, and after the fact that I spent money on this just for it not to work out.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11939973743",
    "userName": "Jamie_L",
    "userUrl": "https://itunes.apple.com/us/reviews/id16069501",
    "version": "1.1.1",
    "score": 3,
    "title": "If only",
    "text": "The app is really cool in concept. The bad news is you have to pay to use it as it has no trial period. Also, you’re prompted immediately to submit a review before you even try it out. After some quick use and comparisons to logging after actually weighing food, this app was under estimating calories. I had 200 gram is baked chicken on a plate and the app said 135 grams. It’ll take some trial and error to get use to. Don’t expect perfection. But it should ball park it nicely.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11935364339",
    "userName": "Luck Da Don",
    "userUrl": "https://itunes.apple.com/us/reviews/id8612032",
    "version": "1.1.1",
    "score": 1,
    "title": "SD",
    "text": "Charged me more than was listed. Not a good start.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11889907992",
    "userName": "domvitorocco",
    "userUrl": "https://itunes.apple.com/us/reviews/id182269245",
    "version": "1.1.1",
    "score": 3,
    "title": "Too simple but also easy",
    "text": "Saw this app advertised from an Instagram account making funny gym videos, overall it's a good app, it just lacks many features. Others have too much, this one has too little. I don't like that there's no trial period, you have to pay for it before using it. Also the rating box comes wayyyy too early, I just finished setting up and it wanted me to rate... If this app can update in the near future, it has potential to be a great calorie tracker, keep it light and simple, but add important features like logging weight, water, and analyze/present all inputed data with recommendations on how to eat better or what I could have cut out of my meals for the day. Until that happens, I don't recommend this app... yet",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11809295452",
    "userName": "nonickneamw10",
    "userUrl": "https://itunes.apple.com/us/reviews/id1708649132",
    "version": "1.0.9",
    "score": 1,
    "title": "Not free",
    "text": "App is free to download but requires Monthly/yearly subscription ($30 minimum) to even get into. Why would I pay when I haven’t even seen what the app does yet?",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11805769660",
    "userName": "abrahamdaloj",
    "userUrl": "https://itunes.apple.com/us/reviews/id897093862",
    "version": "1.0.9",
    "score": 1,
    "title": "Terrible app it’s a scam",
    "text": "Unccurate micros why do you think all reviews or videos aren’t shown all comments are AI don’t get scammed",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11796536707",
    "userName": "djemfowndksn",
    "userUrl": "https://itunes.apple.com/us/reviews/id1145383707",
    "version": "1.0.9",
    "score": 3,
    "title": "I gotta pay",
    "text": "I am broke anyways but as a fattie it’s hard to lose weight when I gotta pay 2 figure it out",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11664194043",
    "userName": "steve.zzz",
    "userUrl": "https://itunes.apple.com/us/reviews/id431585934",
    "version": "1.0.3",
    "score": 5,
    "title": "best ai calorie tracker",
    "text": "pleasantly surprised by how great the experience was. deleting myfitnesspal right now! no reason to go back to them. ai is a game changer",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11663310371",
    "userName": "tonyylee2002",
    "userUrl": "https://itunes.apple.com/us/reviews/id340537473",
    "version": "1.0.3",
    "score": 5,
    "title": "Fastest way to track my calories",
    "text": "Came from their posts on social media and i was skeptical at first but got pleasantly surprised by the accuracy and ease of use of the app. Highly recommend!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11660124797",
    "userName": "charliebricks",
    "userUrl": "https://itunes.apple.com/us/reviews/id314091411",
    "version": "1.0.2",
    "score": 5,
    "title": "Super useful App",
    "text": "This app has been very useful for calorie tracking better than all the other competitors. I love the food scanning feature.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11625282050",
    "userName": "Slayikon",
    "userUrl": "https://itunes.apple.com/us/reviews/id485455487",
    "version": "1.0.1",
    "score": 5,
    "title": "Changed my life",
    "text": "I never really bought into calorie tracking or health apps as they’re hard to use or too much effort. This app stands out with its simple design, AI functions, and makes it fun to work towards my fitness goals",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11619852795",
    "userName": "djfnrjdjnrnf",
    "userUrl": "https://itunes.apple.com/us/reviews/id548580245",
    "version": "1.0.1",
    "score": 5,
    "title": "THE MOST ACCURATE",
    "text": "They have to be using the latest tech or something. nothing else compares. i was hesitant at first, but it genuinely surprised me. had to rec to my friends, don’t miss out!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11619167453",
    "userName": "JungleSJ00",
    "userUrl": "https://itunes.apple.com/us/reviews/id1158590299",
    "version": "1.0.1",
    "score": 5,
    "title": "convenient and super smooth",
    "text": "kudos to the developers, this has made calorie tracking super easy. Also really pleasant to look at :) \nDefinitely get this app",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12378919922",
    "userName": "David_0909",
    "userUrl": "https://itunes.apple.com/us/reviews/id1759367689",
    "version": "1.2.0",
    "score": 5,
    "title": "Great",
    "text": "It a an easy and helpful app",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12377704346",
    "userName": "User 74839",
    "userUrl": "https://itunes.apple.com/us/reviews/id1761758245",
    "version": "1.2.0",
    "score": 1,
    "title": "Do Not Get Subscription",
    "text": "App no longer seems to be capable of keeping entries from the \"saved\" category. Entry will stay for some time but will be gone hours later. Being able to enter \"saved\" meals was the main appeal of this app in my opinion. I wish I had not purchased the subscription given that the app no longer delivers on this essential function.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12376039497",
    "userName": "701 eloy",
    "userUrl": "https://itunes.apple.com/us/reviews/id1483320441",
    "version": "1.2.0",
    "score": 4,
    "title": "Algo bien",
    "text": "Algo bien",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12363297730",
    "userName": "Andrradeagus",
    "userUrl": "https://itunes.apple.com/us/reviews/id1499779517",
    "version": "1.1.19",
    "score": 5,
    "title": "Fácil uso",
    "text": "Espero q me ayude con mi perdida d peso",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12353237695",
    "userName": "RANDY RALPH FACE",
    "userUrl": "https://itunes.apple.com/us/reviews/id521380292",
    "version": "1.1.18",
    "score": 1,
    "title": "Scam",
    "text": "Inferior calorie tracker. They also bait and switch you with pricing. Advertise a discount and then charge you a different price. Unresponsive to outreach. Avoid at all costs!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12352327574",
    "userName": "bridget :3",
    "userUrl": "https://itunes.apple.com/us/reviews/id1242565019",
    "version": "1.1.18",
    "score": 2,
    "title": "Its just okay",
    "text": "I feel really iffy with this app, when tracking i can only use the ai and when i eat out it doesnt give the option to just say where i got the food and put in the calories according to the menu from the restaurant. \nIt also forces you to just buy the early plan without any other option or trial, it’s not fair to the customer to explore their options. You have to look at your apple account just to choose a different plan and even then there is still no trial once it’s bought.\nI feel like offering a trial first would be nice and just being able to understand what the app is first before deciding to buy a plan. personally not for me and i wish there was a way to get refunded.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12350241446",
    "userName": "Jonfilms",
    "userUrl": "https://itunes.apple.com/us/reviews/id308459640",
    "version": "1.1.18",
    "score": 2,
    "title": "Free Trial..?",
    "text": "Wanted to try this app out since I find the whole calorie estimator interesting. However this app on download puts up a pay wall with no option to try it out. Occasionally I get a notification of a “Free Trial” but then it throws up the pay wall again to pay first… It feels really suspicious and deceiving as if they just want me to pay for it first before going on free trial.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12339166232",
    "userName": "Gabiooooooooo",
    "userUrl": "https://itunes.apple.com/us/reviews/id420223880",
    "version": "1.1.18",
    "score": 5,
    "title": "GitHub",
    "text": "Love it",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12328235912",
    "userName": "Meli_garrjfj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1246947214",
    "version": "1.1.17",
    "score": 2,
    "title": "Wrong Price",
    "text": "It was unfortunate to see that I bought something for the wrong price. When i downloaded this app, I saw the yearly plan cost $4.99 per month, turns out I had bought some plan I had no idea about for $60 dollars. This might not be the apps fault, it might just be me and I must have missed something but I hope i can get those $60 refunded.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12320191025",
    "userName": "DAL#64",
    "userUrl": "https://itunes.apple.com/us/reviews/id1381448190",
    "version": "1.1.17",
    "score": 1,
    "title": "Rip off/Try trial 1st",
    "text": "Thinking this would make tracking macros would be easier, I chose the one year. It gave totally absurd macros for foods I entered! I tried to cancel & it seems there is zero contact info for customer service so I don’t know what I am doing!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12318571669",
    "userName": "Zeus136",
    "userUrl": "https://itunes.apple.com/us/reviews/id1146558630",
    "version": "1.1.17",
    "score": 1,
    "title": "Feels like a scam",
    "text": "No free version. You can do the same with chat GPT or Gemini. Wasted 5 mins setting it up..",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12303800198",
    "userName": "Speed gggg",
    "userUrl": "https://itunes.apple.com/us/reviews/id1724321713",
    "version": "1.1.17",
    "score": 5,
    "title": "Good",
    "text": "Me like",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12268035673",
    "userName": "nicholassalohcin",
    "userUrl": "https://itunes.apple.com/us/reviews/id771438074",
    "version": "1.1.16",
    "score": 3,
    "title": "great app but needs work",
    "text": "Overall, this is a good app—easy to use and provides a solid ballpark estimate of macros. However, there are a few issues that need to be addressed and features that could improve the experience:\n\t•\tSaved food images sometimes disappear randomly.\n\t•\tUsers should be able to rename saved foods.\n\t•\tBarcode scanning doesn’t always provide exact measurements from the nutrition label.\n\t•\tThe app should integrate with Fitbit, Apple Watch, or Apple Health.\n\t•\tMicronutrient tracking, along with details on fat and carbohydrate types, would be beneficial.\n\t•\tA recipe feature would be a great addition.\n\nThese improvements would make the app even more useful for tracking nutrition accurately.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12213558151",
    "userName": "Jasonpirate",
    "userUrl": "https://itunes.apple.com/us/reviews/id495642198",
    "version": "1.1.13",
    "score": 5,
    "title": "From Ok to Great!",
    "text": "When I first got this app, I purchased the 1 year subscription. The app worked well and I was happy with the convenience of a picture to macros app. There were some UI bugs occasionally and sometimes the app would forget a whole day of food. Plus I couldn’t check far back history. Now after the latest major update, those issues are old news. I am happy every time I use the app. Plus they now have a label snapping function which is great. Love FITHUB. I definitely recommend it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12193414624",
    "userName": "girishnova",
    "userUrl": "https://itunes.apple.com/us/reviews/id1410485336",
    "version": "1.1.12",
    "score": 2,
    "title": "Would be great if it worked properly",
    "text": "Great concept, and sometimes it works alright but even when you scan a barcode it will incorrectly input the calories and protein. One of my protein bars I put in had 180 calories and it put in 250. If it can't even accurately count a barcode calories how am I supposed to count on it to accurately count a picture or a description?",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12115336835",
    "userName": "Nat LeBlanc",
    "userUrl": "https://itunes.apple.com/us/reviews/id1266841063",
    "version": "1.1.1",
    "score": 1,
    "title": "Poorly made and hard to use",
    "text": "The app is not good. You have no idea how many calories you had unless you do math because the app only shows the remaining calories. Same for macros. Plus all you can see are macronutrients. And on top of everything, it is a paid app. I saw an add on Instagram and thought it would be a good one to try. But it is not worth it. The idea is good, but it needs some serious improvement.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12075130696",
    "userName": "Chill edgar",
    "userUrl": "https://itunes.apple.com/us/reviews/id1733339707",
    "version": "1.1.1",
    "score": 5,
    "title": "Cool",
    "text": "I can see this as a way for people that want to track their calories",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12069911864",
    "userName": "Limo Usine",
    "userUrl": "https://itunes.apple.com/us/reviews/id31131259",
    "version": "1.1.1",
    "score": 1,
    "title": "Doesn’t even give trial access before asking you to pay",
    "text": "Didn’t even use the app because it asked me to pay immediately after downloading it. Doesn’t even have an option to test out the app itself. It just goes straight to a payment screen. These fitness app will only help you if you have the money for it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12060451611",
    "userName": "Viking Jess1010",
    "userUrl": "https://itunes.apple.com/us/reviews/id46234485",
    "version": "1.1.1",
    "score": 1,
    "title": "Forced rating",
    "text": "This thing makes you click 5 star rating even before trying the app. Then you get to the end of the questions and it asks for money. It’s a no.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12024207212",
    "userName": "Bnhhhh",
    "userUrl": "https://itunes.apple.com/us/reviews/id489223239",
    "version": "1.1.1",
    "score": 5,
    "title": "Sonel",
    "text": "Very nice",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12019631998",
    "userName": "mightydek",
    "userUrl": "https://itunes.apple.com/us/reviews/id941597674",
    "version": "1.1.1",
    "score": 3,
    "title": "Please add a trial, I beg of you",
    "text": "Even if it’s only like 3 days or something like that having a trial to get to experience the app before laying down money would allow me to try it and see if I want to spend the money, if I don’t then that tells you that you need to improve the app but if I do like it you will have yourself a long lasting customer. Please",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "12018324622",
    "userName": "wittydude",
    "userUrl": "https://itunes.apple.com/us/reviews/id549792091",
    "version": "1.1.1",
    "score": 5,
    "title": "Haven’t used yet",
    "text": "Rates it 5 stars on hopes it meets my expectations",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11994619561",
    "userName": "leveredmong",
    "userUrl": "https://itunes.apple.com/us/reviews/id244123913",
    "version": "1.1.1",
    "score": 1,
    "title": "half built",
    "text": "having to pay with no trial should have turned me away but I was hopeful as I’ve never stuck with myfitnesspal since it was so tedious to log everything, this offered the solution! \n\nthe AI portion of the app is great. some things need tweaking, but it’s. great starter point. that’s the 1 star. here’s why I regret my purchase\n- No connection to apple health \n- Not easy to correct macros/values \n- Buggy adjustments when you correct the grams \n- diary history only goes back a week\n- calling it a diary is a stretch. there’s no insights other than calories and macros \n- no dashboards to show progress over time or high level insight \n- barcode scanner is wonky as other reviews have mentioned \n- no widgets\n- no manual entry; you *must* use the AI. Coupled with the fact that adjusting the AI suggestions is incredibly difficult, this makes the app harder to use than just entering things manually in the first place. \n\nnot sure if they read these reviews, if updates will be made, or if this was just a quick cash grab. a lot of these reviews look fake. I submitted product feedback but never got a response of any kind. so here I am. buyer beware, this app is not a finished product.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11980295375",
    "userName": "Biggie 7575",
    "userUrl": "https://itunes.apple.com/us/reviews/id1724606919",
    "version": "1.1.1",
    "score": 5,
    "title": "Good",
    "text": "Good",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11966617953",
    "userName": "Dylan’s reviews123",
    "userUrl": "https://itunes.apple.com/us/reviews/id512348009",
    "version": "1.1.1",
    "score": 2,
    "title": "Not great",
    "text": "I made a YouTube video where I tested the accuracy of this app on 5 different meals: avocado toast with egg, a PB&J, chicken broccoli rice, a banana, and a chipotle burrito bowl.\n\nIt was reasonably accurate on the avocado toast, and the chicken broccoli rice meal (even though it thought the chicken was tilapia).\n\nThe PB&J and the chipotle bowl were very far off. It got less than half of the calories and a third of the protein for the burrito bowl.\n\nFor the banana it actually told me it was 0 calories and 0 of any macros. Not even joking. I tried 3 different times to see if it was a bug.\n\nI find it really not cool that you have to commit to a paid subscription before using the app at all and double not cool that they ask for a review before you even get to use it.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11964040880",
    "userName": "Trelly578",
    "userUrl": "https://itunes.apple.com/us/reviews/id660864706",
    "version": "1.1.1",
    "score": 5,
    "title": "My review",
    "text": "I’ve been using the Fit Hub AI Calorie Tracker app for a while now, and it has completely changed the way I manage my nutrition and fitness goals. The app is incredibly user-friendly, accurate, and packed with features that make tracking calories and macros effortless. The AI suggestions for meals and portion sizes are spot on, and the vast food database ensures I can log anything I eat without hassle.\n\nOne improvement I’d love to see is a feature allowing users to input food quantities in grams, mL, fl oz, and oz. This would make tracking even more precise for those of us who rely on different measurement systems depending on the food or beverage.\n\nOverall, this app is a game-changer for anyone serious about their health and fitness journey. Highly recommend it to anyone looking to level up their calorie tracking!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11962092174",
    "userName": "housespecialfriedrice",
    "userUrl": "https://itunes.apple.com/us/reviews/id1691490182",
    "version": "1.1.1",
    "score": 5,
    "title": "Best app",
    "text": "So convenient!! Thanks :D",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11961232125",
    "userName": "TheKing77891",
    "userUrl": "https://itunes.apple.com/us/reviews/id744765619",
    "version": "1.1.1",
    "score": 2,
    "title": "Good Design but not accurate",
    "text": "It’s a good idea and if it worked properly it’d be 5/5 stars, but it doesn’t quite work like it’s supposed to, I scanned a zebra cake that has 320 calories and it says that there is 198, and a brownie that is 200 calories as 400, overall it is a good concept but a bit more work needs to go into it, and after the fact that I spent money on this just for it not to work out.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11939973743",
    "userName": "Jamie_L",
    "userUrl": "https://itunes.apple.com/us/reviews/id16069501",
    "version": "1.1.1",
    "score": 3,
    "title": "If only",
    "text": "The app is really cool in concept. The bad news is you have to pay to use it as it has no trial period. Also, you’re prompted immediately to submit a review before you even try it out. After some quick use and comparisons to logging after actually weighing food, this app was under estimating calories. I had 200 gram is baked chicken on a plate and the app said 135 grams. It’ll take some trial and error to get use to. Don’t expect perfection. But it should ball park it nicely.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11935364339",
    "userName": "Luck Da Don",
    "userUrl": "https://itunes.apple.com/us/reviews/id8612032",
    "version": "1.1.1",
    "score": 1,
    "title": "SD",
    "text": "Charged me more than was listed. Not a good start.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11889907992",
    "userName": "domvitorocco",
    "userUrl": "https://itunes.apple.com/us/reviews/id182269245",
    "version": "1.1.1",
    "score": 3,
    "title": "Too simple but also easy",
    "text": "Saw this app advertised from an Instagram account making funny gym videos, overall it's a good app, it just lacks many features. Others have too much, this one has too little. I don't like that there's no trial period, you have to pay for it before using it. Also the rating box comes wayyyy too early, I just finished setting up and it wanted me to rate... If this app can update in the near future, it has potential to be a great calorie tracker, keep it light and simple, but add important features like logging weight, water, and analyze/present all inputed data with recommendations on how to eat better or what I could have cut out of my meals for the day. Until that happens, I don't recommend this app... yet",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11809295452",
    "userName": "nonickneamw10",
    "userUrl": "https://itunes.apple.com/us/reviews/id1708649132",
    "version": "1.0.9",
    "score": 1,
    "title": "Not free",
    "text": "App is free to download but requires Monthly/yearly subscription ($30 minimum) to even get into. Why would I pay when I haven’t even seen what the app does yet?",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11805769660",
    "userName": "abrahamdaloj",
    "userUrl": "https://itunes.apple.com/us/reviews/id897093862",
    "version": "1.0.9",
    "score": 1,
    "title": "Terrible app it’s a scam",
    "text": "Unccurate micros why do you think all reviews or videos aren’t shown all comments are AI don’t get scammed",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11796536707",
    "userName": "djemfowndksn",
    "userUrl": "https://itunes.apple.com/us/reviews/id1145383707",
    "version": "1.0.9",
    "score": 3,
    "title": "I gotta pay",
    "text": "I am broke anyways but as a fattie it’s hard to lose weight when I gotta pay 2 figure it out",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11664194043",
    "userName": "steve.zzz",
    "userUrl": "https://itunes.apple.com/us/reviews/id431585934",
    "version": "1.0.3",
    "score": 5,
    "title": "best ai calorie tracker",
    "text": "pleasantly surprised by how great the experience was. deleting myfitnesspal right now! no reason to go back to them. ai is a game changer",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11663310371",
    "userName": "tonyylee2002",
    "userUrl": "https://itunes.apple.com/us/reviews/id340537473",
    "version": "1.0.3",
    "score": 5,
    "title": "Fastest way to track my calories",
    "text": "Came from their posts on social media and i was skeptical at first but got pleasantly surprised by the accuracy and ease of use of the app. Highly recommend!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11660124797",
    "userName": "charliebricks",
    "userUrl": "https://itunes.apple.com/us/reviews/id314091411",
    "version": "1.0.2",
    "score": 5,
    "title": "Super useful App",
    "text": "This app has been very useful for calorie tracking better than all the other competitors. I love the food scanning feature.",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11625282050",
    "userName": "Slayikon",
    "userUrl": "https://itunes.apple.com/us/reviews/id485455487",
    "version": "1.0.1",
    "score": 5,
    "title": "Changed my life",
    "text": "I never really bought into calorie tracking or health apps as they’re hard to use or too much effort. This app stands out with its simple design, AI functions, and makes it fun to work towards my fitness goals",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11619852795",
    "userName": "djfnrjdjnrnf",
    "userUrl": "https://itunes.apple.com/us/reviews/id548580245",
    "version": "1.0.1",
    "score": 5,
    "title": "THE MOST ACCURATE",
    "text": "They have to be using the latest tech or something. nothing else compares. i was hesitant at first, but it genuinely surprised me. had to rec to my friends, don’t miss out!",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  },
  {
    "id": "11619167453",
    "userName": "JungleSJ00",
    "userUrl": "https://itunes.apple.com/us/reviews/id1158590299",
    "version": "1.0.1",
    "score": 5,
    "title": "convenient and super smooth",
    "text": "kudos to the developers, this has made calorie tracking super easy. Also really pleasant to look at :) \nDefinitely get this app",
    "url": "https://itunes.apple.com/us/review?id=6624298392&type=Purple%20Software"
  }
]