[
  {
    "id": "12375733168",
    "userName": "Madi Jo💕",
    "userUrl": "https://itunes.apple.com/us/reviews/id121666342",
    "version": "3.41.9",
    "score": 5,
    "title": "My Favorite App",
    "text": "This is my favorite way to keep up with my friends’ lives and practice gratitude for my own mental health! I am a licensed mental health counselor and I love recommending this app to clients too.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12349388284",
    "userName": "Anpanmaniac",
    "userUrl": "https://itunes.apple.com/us/reviews/id218896547",
    "version": "3.41.9",
    "score": 3,
    "title": "widget glitch",
    "text": "wanted to bring to the team’s attention: when I tried to add a weekly throwback memories widget, it only shows grey screen with nothing else, however, for the “recent memory” it works fine whether its text or photo.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12347958944",
    "userName": "hello_hello15",
    "userUrl": "https://itunes.apple.com/us/reviews/id495974814",
    "version": "3.41.9",
    "score": 5,
    "title": "wow",
    "text": "i love this app, it’z just truly amazing. i love rhat i can look back at my memories whenevr i want to. and, if i miss a day, i have up to 4 days to make it up, even with the FREE version",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12345625171",
    "userName": "Tess Greb",
    "userUrl": "https://itunes.apple.com/us/reviews/id1758823448",
    "version": "3.41.9",
    "score": 1,
    "title": "Not for me",
    "text": "At first I liked it until all of those in app purchases 😡😡",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12318818094",
    "userName": "kathylinstagram",
    "userUrl": "https://itunes.apple.com/us/reviews/id102142475",
    "version": "3.41.9",
    "score": 5,
    "title": "Awesome app",
    "text": "I love my happy feed. It helps me to remember to look for moments of peace and joy in my life. I can find it even on tough days.  It is a great tool for daily reflection and I love how I can look back through the years. It helps me to stay grounded and grateful. ❤️",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12297825002",
    "userName": "Judithal54",
    "userUrl": "https://itunes.apple.com/us/reviews/id127211021",
    "version": "3.41.9",
    "score": 4,
    "title": "Amazing concept, great prompts",
    "text": "A friend and I looked for an app where we could share daily wonders easily . This is a great one allowing both video, pictures and text. If you pay the app fee, you can load more than one pic a day and see more of your past postings but there is a free version which is fine if you don’t want downloadable history. The one thing I hope the creators will improve right away is the ability to toggle back and forth between screens more easily. It gets stuck sometimes or just won’t get to the screen I’m seeking unless I refresh. It needs work on navigation but other than that, it’s a little jewel.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12296339519",
    "userName": "lilzapoot",
    "userUrl": "https://itunes.apple.com/us/reviews/id515713248",
    "version": "3.41.9",
    "score": 5,
    "title": "Fun and Easy",
    "text": "Love this app to remind me of the little joys of each day",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12275947511",
    "userName": "dwtang",
    "userUrl": "https://itunes.apple.com/us/reviews/id21126312",
    "version": "3.41.9",
    "score": 5,
    "title": "Such a joy",
    "text": "I’ve been using Happyfeed for a while, and it is such a quick and easy way for me to capture a moment of gratitude. Been a constant go-to for inspiration and for pausing and appreciating the moment I am in!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12235260528",
    "userName": "LlKjsus",
    "userUrl": "https://itunes.apple.com/us/reviews/id1748673258",
    "version": "3.41.8",
    "score": 5,
    "title": "So good",
    "text": "So I got this on watch and I love it so like when I read the thing it said your wonderful I thought that was nice don’t mind my name",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12212260286",
    "userName": "Oh Danny boy 69",
    "userUrl": "https://itunes.apple.com/us/reviews/id618526132",
    "version": "3.41.8",
    "score": 5,
    "title": "Good for people with ADHD!",
    "text": "I have ADHD and it’s hard for me to manage time efficiently. I also tend to struggle with focusing on negatives. This app makes it easier for me to point out positives and recognize the good things that happen daily. I love it.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12206351857",
    "userName": "dhshjanajahajaj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1275680063",
    "version": "3.41.7",
    "score": 4,
    "title": "Love",
    "text": "I love the app, I’d like more background options for when it shows the streak you’re on with a photo background.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12186783890",
    "userName": "WuvWeirdo",
    "userUrl": "https://itunes.apple.com/us/reviews/id352006450",
    "version": "3.41.7",
    "score": 4,
    "title": "Character Limit/Timestamps/Tags",
    "text": "I would love to not have a character limit so that it feels more like a journal.\nI would also love to have a timestamp and having the option to put tags on each log. A search bar would be great as well to filter through logs when wanting to recall a specific memory.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12176249701",
    "userName": "Kflpts",
    "userUrl": "https://itunes.apple.com/us/reviews/id20072574",
    "version": "3.41.7",
    "score": 5,
    "title": "Best ever!",
    "text": "I have found a picture and a few sentences goes a long way in keeping me positive and focused. Thank you happy feed!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12169884375",
    "userName": "Marrim42",
    "userUrl": "https://itunes.apple.com/us/reviews/id465840013",
    "version": "3.41.7",
    "score": 5,
    "title": "Perfect for low effort gratitude journaling!",
    "text": "I’ve never kept up with any type of journaling consistently until I started using this app. It’s so easy to add a picture from your day every day, and the streak counts and memories are really motivating to do so.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12146207003",
    "userName": "DizzyBalloonLover",
    "userUrl": "https://itunes.apple.com/us/reviews/id42666407",
    "version": "3.41.6",
    "score": 5,
    "title": "This app is perfection",
    "text": "Thank you to the happy feed team - i wanted an app where i could take a photo a day without all of the baggage of modern social media, and happy feed delivers. Really grateful for this app.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12143565203",
    "userName": "sleepingbetter01",
    "userUrl": "https://itunes.apple.com/us/reviews/id155756704",
    "version": "3.41.6",
    "score": 5,
    "title": "Love it!",
    "text": "Stumbled on this app and at first wanted to see if it was free and I like it. I’m adding pictures too!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12130096434",
    "userName": "tatydupin",
    "userUrl": "https://itunes.apple.com/us/reviews/id676265523",
    "version": "3.41.6",
    "score": 5,
    "title": "Yay",
    "text": "I like it and it’s super demure\n🙃",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12105781582",
    "userName": "Scroms23",
    "userUrl": "https://itunes.apple.com/us/reviews/id251055099",
    "version": "3.41.6",
    "score": 5,
    "title": "Daily Joy!",
    "text": "I have 2093 days! I simply love it 🩷",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11994437398",
    "userName": "Mia is confused",
    "userUrl": "https://itunes.apple.com/us/reviews/id1151014311",
    "version": "3.40.8",
    "score": 5,
    "title": "Very Helpful",
    "text": "This wonderful app reminds me to focus on the positive side of things and to be grateful for the beautiful things and people in life. When I look back at the positive aspects of life using the app, it makes my perspective of my history so much nicer. Thank you!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11968110105",
    "userName": "Hahaoebfjdbdhhd",
    "userUrl": "https://itunes.apple.com/us/reviews/id429197186",
    "version": "3.40.8",
    "score": 5,
    "title": "THIS APP HAS CHANGED MY LIFE!!!!! FRFR",
    "text": "This app has truly changed my life. It has helped me look at my life and a much more appreciative way and cherish moments that I would forget to otherwise. I had a really unhealthy relationship with social media. This became a healer for that. Because I only see my own life and the beautiful things that I love about my life and I’m not comparing it to anyone else’s.\n\nI romanticize my life :)",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11931394969",
    "userName": "!xchrxbj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1485671160",
    "version": "3.40.6",
    "score": 5,
    "title": "Review",
    "text": "I love this app because I can take it with me everywhere.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11845689602",
    "userName": "LLL76",
    "userUrl": "https://itunes.apple.com/us/reviews/id165910286",
    "version": "3.40.4",
    "score": 5,
    "title": "changed my life",
    "text": "After watching the movie Soul and realizing I had a sudden deep desire to better appreciate the small wonderful moments in my life, i downloaded this app on a whim. And  4 years later I can honestly say it has changed my life and my perspective of it. I find myself looking for things throughout my day that brought me joy and I notice far more simple little moments than I did before. I love that I can add pictures to my entries and go back and look at what made me happy a year or two or three ago and see how I’ve changed and grown. I have not been completely consistent but I am proud to say I’ve competed 874 days of happyfeed and cannot wait for more! I’ve only ever had good experiences with their customer service and the app has always worked well and without bugs or glitches",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11845510637",
    "userName": "Yannie.Heng",
    "userUrl": "https://itunes.apple.com/us/reviews/id1090737822",
    "version": "3.40.4",
    "score": 5,
    "title": "My favorite app ever",
    "text": "This app has gotten me through medical school and now residency. I’m so grateful to be able to focus on the happy things in the midst of such a challenging season",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11840277047",
    "userName": "Tiffany 1230",
    "userUrl": "https://itunes.apple.com/us/reviews/id553854937",
    "version": "3.40.4",
    "score": 5,
    "title": "Really Helps!",
    "text": "I love using this app it really helps to upgrade your mood. The streaks motivate you to stay consistent. You can join a randomized group which is so fun and inspiring. The flashback moments are an amazing feature as well, constantly reminding you of your good days. I love this app! I’d love if you weren’t limited on the amount of daily moments. I really do feel like this helps maintain a more positive mood and outlook",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11813193846",
    "userName": "tabsthecatmom",
    "userUrl": "https://itunes.apple.com/us/reviews/id124953640",
    "version": "3.40.3",
    "score": 5,
    "title": "The BEST",
    "text": "HappyFeed is my favorite app EVER and one of my favorite things to do everyday. I love seeing my memories from over the years each day. It’s really the best and brings a smile to my often 🥰 I recommend it to everyone. Thank you for such a wonderful journal of memories!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11783241544",
    "userName": "Brenbrenmom02",
    "userUrl": "https://itunes.apple.com/us/reviews/id202816288",
    "version": "3.40.3",
    "score": 5,
    "title": "Love this Journal App",
    "text": "It’s so easy to use! I’ve been using it now for over 760 consecutive days!!!! It’s my inspiration journey journal. I made a group share with my best friend so we can share our days goals accomplishments etc  it’s truly a great app",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11779792876",
    "userName": "Busybee644",
    "userUrl": "https://itunes.apple.com/us/reviews/id394257269",
    "version": "3.40.3",
    "score": 5,
    "title": "Happyfeed makes me happy",
    "text": "Love that I can see years of memories.  Especially when I might be having a down day, love looking back and seeing what made me happy one year, two years or even six years ago.  Brings tears to my eyes at times. Makes me laugh out loud too. Thank you Matt for creating HappyFeed. Can’t go a day without posting.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11741554042",
    "userName": "Bohemhippiex",
    "userUrl": "https://itunes.apple.com/us/reviews/id325994009",
    "version": "3.40.2",
    "score": 5,
    "title": "I like it",
    "text": "Makes me keep on track little miracles everyday 🫶🏻",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11609289751",
    "userName": "Topeka Art Diva",
    "userUrl": "https://itunes.apple.com/us/reviews/id219792145",
    "version": "3.40.0",
    "score": 5,
    "title": "Enjoy using Happy Feed for gratitude journaling",
    "text": "I’ve been doing gratitude journaling for years. Happy Feed makes it easy. Like the prompts and enjoy ability to add pics.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11546517376",
    "userName": "Rose's walker",
    "userUrl": "https://itunes.apple.com/us/reviews/id415985154",
    "version": "3.39.13",
    "score": 5,
    "title": "Simple and powerful",
    "text": "Easy to use way to gratitude journal. I love looking back at past moments of joy.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11520398715",
    "userName": "kk4830",
    "userUrl": "https://itunes.apple.com/us/reviews/id499237148",
    "version": "3.39.13",
    "score": 5,
    "title": "Small time commitment, big impact",
    "text": "I have ADD and can have a difficult time focusing. So I get down and give up on things a lot. But something about this app keeps me coming back daily. I'm on a 29-day streak and can't imagine missing one. It's an incredible feeling looking at all of those thankful/grateful thoughts accumulated in one place. If you're looking for a more hopeful, positive mindset, I can't recommend this app highly enough.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11489205154",
    "userName": "TA Hurley",
    "userUrl": "https://itunes.apple.com/us/reviews/id609757092",
    "version": "3.39.13",
    "score": 5,
    "title": "Love this app!",
    "text": "I have had Happyfeed for more than three years and I absolutely love it. It’s an easy way to remind myself to think about what I’m grateful for every day. I love being able to add photos and now that I’ve been using it for a while, I can look back at the things I was grateful for three or six months ago or one, two or three years ago! It is fantastic for helping me relive happy memories",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11357498908",
    "userName": "Jesssayyess",
    "userUrl": "https://itunes.apple.com/us/reviews/id1611590505",
    "version": "3.39.10",
    "score": 5,
    "title": "11 out of 10 would recommend.",
    "text": "I think the app is wonderful. It’s simple yet such a great tool. It’s a good resource to help you focus on the positive things in each day. Even on your worst day, just by naming 3 good things can help improve your mood. The 3 good things could be simple, like the weather felt nice outside today. I got to sleep in a little later today. Or I was able to afford McDonalds breakfast this morning instead of cooking or worse, not being able to eat at all. Appreciate the little positive things about life. I love how the app lets you add pictures and a little short entry, but also an emoji you can choose to represent your day. Once your entered enough, it creates these cute slideshow videos. Also, you can join pods and can choose which entries you would like to share or not. You can also create your own pod. For example, I made one called “Happy Girls are the Prettiest,” which I made for a group of girls like me. Maybe a mom. Maybe someone struggling with depression or low self esteem. It’s my motivational entries I share in this pod to remind myself & others than inner beauty is worth so much more than outer beauty. \nBut anyways, YES YES YES, I Would definitely recommend to all!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11353235042",
    "userName": "Kama345",
    "userUrl": "https://itunes.apple.com/us/reviews/id102880044",
    "version": "3.39.10",
    "score": 3,
    "title": "Can’t see previous posts!?!?",
    "text": "Overall I love the idea. I’ve been looking for a daily photo journal/ gratitude app. Being honest, I don’t want to pay a monthly fee to add 1-2 photos and reflect on my day. This app allows me to add up to 3 photos for a day without paying for upgrade. That is awesome!! I love that it gives me little prompts or ideas I could use if needed. \nDownside, I can’t easily find or read my past entries. I’m not always great at doing it every day but really try to make sure I have something for each day. I can see my moments from the current week and even the previous week but have to pay for upgrade if I want to see further back or the previous month. That’s very disappointing to me that I can’t easily access and see my full month in a view. I have to pay for premium to see photos, memories and moments. Hard to reflect on my gratitude if I don’t want to pay. I continue to use app for now (it’s been over a year) but not sure why. \nSide note - I am going through a hard time right now and would love to be able to view previous entries about my dog but unless it was on the same day a year ago I can’t find them.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11348160366",
    "userName": "Bookmory Review",
    "userUrl": "https://itunes.apple.com/us/reviews/id1436209393",
    "version": "3.39.10",
    "score": 5,
    "title": "Why Happyfeed is so amazing",
    "text": "Happyfeed is an amazing app it is great for me and my family to spend time together and have fun😁😁",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11309666743",
    "userName": "l. D.T .",
    "userUrl": "https://itunes.apple.com/us/reviews/id1093608196",
    "version": "3.39.10",
    "score": 5,
    "title": "Great app",
    "text": "This app just lets you be yourself I feel like you don’t have to show anyone it’s like your own person Al digital diary. I love it because I can just come on the app and post MY feelings. You can put the settings on private if you don’t want anyone else to see, you can also post it for everyone to see which I love! The app can have its downs, but I still rate it a five. When I am sad or just wanna type something, or share something I did that day I go to this app. I live letting people see what I did in the day to have fun, tester I posted and was NOT having fun but that doesn’t matter! I would 100% recommend this app! It just helps sometimes, or just for fun.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11280191449",
    "userName": "16 arms",
    "userUrl": "https://itunes.apple.com/us/reviews/id40675201",
    "version": "3.39.10",
    "score": 1,
    "title": "Misleading",
    "text": "I just wanted a simple photo with journal.  You can’t use photos unless you upgrade to plus?",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11274012778",
    "userName": "Ktj717",
    "userUrl": "https://itunes.apple.com/us/reviews/id30371541",
    "version": "3.39.10",
    "score": 5,
    "title": "Two years! 730 days!",
    "text": "Been using this app daily for two years now and I love it! Their customer support is excellent as well, even just for the free version! The free version is complete meaning you don't have to pay for basic use. The upgrade/paid version allows you to do more like export but isn't required for longterm daily use. I am very happy with it and will probably upgrade soon to be able to export but also because I just want to support this awesome app! Definitely recommend!\nPro tip: I read a review once that mentioned a mom who used specific emojis for each kiddo so occasionally she could sit with that kid and search for the positive posts and moments about that specific person! I LOVE that idea and it could definitely be applied to other categories or groups! Enjoy! 💚",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11254128648",
    "userName": "Jade Haruki",
    "userUrl": "https://itunes.apple.com/us/reviews/id1191015380",
    "version": "3.39.10",
    "score": 1,
    "title": "Don’t bother if you’re not willing to pay for it",
    "text": "I get not being able to edit entries from past months, but after a month passes, you can’t even look at the video entries you made back then without paying premium. Just make the entire app cost money if you’re going to do that",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11164443689",
    "userName": "Draw Master 7",
    "userUrl": "https://itunes.apple.com/us/reviews/id108860327",
    "version": "3.39.8",
    "score": 3,
    "title": "New to the app",
    "text": "I hate traditional social media and liked the idea of an app that centered gratitude that could be as private or shared as you want. I think this app could take off if they made some slight changes. The premium version should be free to increase user ship. The app design is close but needs to be more seamless and mirror apps like Instagram to help increase use. I hope these things occur and I can convince my friends and fam to leave the other apps!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11147814883",
    "userName": "limamiss",
    "userUrl": "https://itunes.apple.com/us/reviews/id228708941",
    "version": "3.39.8",
    "score": 5,
    "title": "Simple and does the trick!",
    "text": "The app keeps your memories so you can reflect on fun things!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11096678368",
    "userName": "Calbeauty",
    "userUrl": "https://itunes.apple.com/us/reviews/id296133190",
    "version": "3.39.8",
    "score": 5,
    "title": "Best gratitude journal for improving your mental health!",
    "text": "I have been using Happyfeed for several years and can honestly say that it is my favorite app. I am an LCSW and see the value in using positive psychology for improving our mental health. Keeping a gratitude journal has improved my physical, emotional and mental health. I love that I can store videos, photos and stories in my daily gratitude journal and my practice has made such a positive impact on my overall being and this is an app that I share with all of my friends, family, and colleagues. On my blog I’ve written about my daily gratitude practice and how instrumental it has been for my mental health and I always recommend HappyFeed because it’s fun, inspiring and easy to use!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11055504495",
    "userName": "Bear🧸2654873",
    "userUrl": "https://itunes.apple.com/us/reviews/id1169699252",
    "version": "3.39.6",
    "score": 5,
    "title": "Amazing 🤩 👍",
    "text": "Happy feed is the best app ever because it helps me and I also have a bunch of memories they’re and when I get a 100 day streak I will fiche you a update and ask google to make you guys that worked so hard on happy feed the top app of the year. I love happy feed it also helps me with my gratitude journals and my streak is 3 I am abt to be on streak 4 Like OMG I love this app I will tell all my friends about this amazing app because I love it this helps me with my gratuities journal and memories and j can also use it a a diary so I will give this a five 5 star ⭐️ rating . Absolutely loveing it I reckon you get this amazing app",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11031110617",
    "userName": "Dana_C02",
    "userUrl": "https://itunes.apple.com/us/reviews/id189861701",
    "version": "3.39.6",
    "score": 5,
    "title": "Happyfeed",
    "text": "I know because it helps share life with you❤️‍🔥❤️‍🔥",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10958226454",
    "userName": "Judtcsllmemoon",
    "userUrl": "https://itunes.apple.com/us/reviews/id25377411",
    "version": "3.39.5",
    "score": 5,
    "title": "I still love this daily practice",
    "text": "I absolutely love this app. If you’re stressed, you might ignore this on those days, but that is the exact opposite of what you should do. It forces your brain to slow down and find the good in your day. It keeps everything in perspective, and it’s so nice to look back on past grateful moments and pictures.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10852898170",
    "userName": "itsxkait3ree",
    "userUrl": "https://itunes.apple.com/us/reviews/id131403649",
    "version": "3.39.1",
    "score": 5,
    "title": "Gratitude",
    "text": "Happy Feed helps me to stop each day and notice the little things, as well as the big things. I have become a more gracious person by engaging in this practice daily.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10834382451",
    "userName": "Juliet_Marie",
    "userUrl": "https://itunes.apple.com/us/reviews/id122590712",
    "version": "3.39.1",
    "score": 5,
    "title": "Amazing app for mental health!",
    "text": "Love this app so much! Also like I am not always being pestered to buy the paid version. This is great for a mental health check in at the end of the day and nice reminders to keep you happy about previous weeks you’ve had.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10826963319",
    "userName": "Stop asking me to review...",
    "userUrl": "https://itunes.apple.com/us/reviews/id296027503",
    "version": "3.39.0",
    "score": 5,
    "title": "Great alternative to Instagram",
    "text": "I stumbled upon happyfeed while looking for an alternative to Instagram. I wanted to be able to post more for myself than other people as a way to track memories and events. I also got tired of suggested videos/accounts/ads on Instagram. Happyfeed is perfect for what I was looking for! The default of every post is private, but also has an option of sharing posts with close friends. There is a focus on posting/writing about what you are grateful for which has been a cool lens to view posting through as well.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10808550189",
    "userName": "Onesassywahine",
    "userUrl": "https://itunes.apple.com/us/reviews/id33685032",
    "version": "3.39.0",
    "score": 5,
    "title": "The only app I won’t shut up about.",
    "text": "Over 5 years ago I started doing this app when I was going through a messy breakup. This app helped teach me to look for the 3 good things in my day. At first it was hard and after some time it got a little easier. Now, when I have the suckiest of days I can normally come up with 3 good things in my day that are be worth recording. They may not be big but I can find the pockets of joy to be grateful for (sunshine, pretty flower, nice interaction with a stranger, etc). I look forward to recording my 3 good things every night and looking back at past memories (some bittersweet but mostly just sweet). The practice of this app everyday chanced my outlook on life for the better. It may sound corny but it’s the one app I won’t shut up about.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10764262454",
    "userName": "AugieGirl2008",
    "userUrl": "https://itunes.apple.com/us/reviews/id1125972913",
    "version": "3.38.9",
    "score": 5,
    "title": "Delight!",
    "text": "I was trying to find something I could upload pictures to, to make a time capsule of delights that made me smile throughout the day. This app does just that. I can decide how and if I want to share with others (pods). And I can look back in a timeline and reflect on what made me happy. This app was exactly what I was looking for, and I can’t wait to see how far my delight/gratitude journal will take me! 150 days strong so far!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12375733168",
    "userName": "Madi Jo💕",
    "userUrl": "https://itunes.apple.com/us/reviews/id121666342",
    "version": "3.41.9",
    "score": 5,
    "title": "My Favorite App",
    "text": "This is my favorite way to keep up with my friends’ lives and practice gratitude for my own mental health! I am a licensed mental health counselor and I love recommending this app to clients too.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12349388284",
    "userName": "Anpanmaniac",
    "userUrl": "https://itunes.apple.com/us/reviews/id218896547",
    "version": "3.41.9",
    "score": 3,
    "title": "widget glitch",
    "text": "wanted to bring to the team’s attention: when I tried to add a weekly throwback memories widget, it only shows grey screen with nothing else, however, for the “recent memory” it works fine whether its text or photo.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12347958944",
    "userName": "hello_hello15",
    "userUrl": "https://itunes.apple.com/us/reviews/id495974814",
    "version": "3.41.9",
    "score": 5,
    "title": "wow",
    "text": "i love this app, it’z just truly amazing. i love rhat i can look back at my memories whenevr i want to. and, if i miss a day, i have up to 4 days to make it up, even with the FREE version",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12345625171",
    "userName": "Tess Greb",
    "userUrl": "https://itunes.apple.com/us/reviews/id1758823448",
    "version": "3.41.9",
    "score": 1,
    "title": "Not for me",
    "text": "At first I liked it until all of those in app purchases 😡😡",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12318818094",
    "userName": "kathylinstagram",
    "userUrl": "https://itunes.apple.com/us/reviews/id102142475",
    "version": "3.41.9",
    "score": 5,
    "title": "Awesome app",
    "text": "I love my happy feed. It helps me to remember to look for moments of peace and joy in my life. I can find it even on tough days.  It is a great tool for daily reflection and I love how I can look back through the years. It helps me to stay grounded and grateful. ❤️",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12297825002",
    "userName": "Judithal54",
    "userUrl": "https://itunes.apple.com/us/reviews/id127211021",
    "version": "3.41.9",
    "score": 4,
    "title": "Amazing concept, great prompts",
    "text": "A friend and I looked for an app where we could share daily wonders easily . This is a great one allowing both video, pictures and text. If you pay the app fee, you can load more than one pic a day and see more of your past postings but there is a free version which is fine if you don’t want downloadable history. The one thing I hope the creators will improve right away is the ability to toggle back and forth between screens more easily. It gets stuck sometimes or just won’t get to the screen I’m seeking unless I refresh. It needs work on navigation but other than that, it’s a little jewel.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12296339519",
    "userName": "lilzapoot",
    "userUrl": "https://itunes.apple.com/us/reviews/id515713248",
    "version": "3.41.9",
    "score": 5,
    "title": "Fun and Easy",
    "text": "Love this app to remind me of the little joys of each day",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12275947511",
    "userName": "dwtang",
    "userUrl": "https://itunes.apple.com/us/reviews/id21126312",
    "version": "3.41.9",
    "score": 5,
    "title": "Such a joy",
    "text": "I’ve been using Happyfeed for a while, and it is such a quick and easy way for me to capture a moment of gratitude. Been a constant go-to for inspiration and for pausing and appreciating the moment I am in!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12235260528",
    "userName": "LlKjsus",
    "userUrl": "https://itunes.apple.com/us/reviews/id1748673258",
    "version": "3.41.8",
    "score": 5,
    "title": "So good",
    "text": "So I got this on watch and I love it so like when I read the thing it said your wonderful I thought that was nice don’t mind my name",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12212260286",
    "userName": "Oh Danny boy 69",
    "userUrl": "https://itunes.apple.com/us/reviews/id618526132",
    "version": "3.41.8",
    "score": 5,
    "title": "Good for people with ADHD!",
    "text": "I have ADHD and it’s hard for me to manage time efficiently. I also tend to struggle with focusing on negatives. This app makes it easier for me to point out positives and recognize the good things that happen daily. I love it.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12206351857",
    "userName": "dhshjanajahajaj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1275680063",
    "version": "3.41.7",
    "score": 4,
    "title": "Love",
    "text": "I love the app, I’d like more background options for when it shows the streak you’re on with a photo background.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12186783890",
    "userName": "WuvWeirdo",
    "userUrl": "https://itunes.apple.com/us/reviews/id352006450",
    "version": "3.41.7",
    "score": 4,
    "title": "Character Limit/Timestamps/Tags",
    "text": "I would love to not have a character limit so that it feels more like a journal.\nI would also love to have a timestamp and having the option to put tags on each log. A search bar would be great as well to filter through logs when wanting to recall a specific memory.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12176249701",
    "userName": "Kflpts",
    "userUrl": "https://itunes.apple.com/us/reviews/id20072574",
    "version": "3.41.7",
    "score": 5,
    "title": "Best ever!",
    "text": "I have found a picture and a few sentences goes a long way in keeping me positive and focused. Thank you happy feed!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12169884375",
    "userName": "Marrim42",
    "userUrl": "https://itunes.apple.com/us/reviews/id465840013",
    "version": "3.41.7",
    "score": 5,
    "title": "Perfect for low effort gratitude journaling!",
    "text": "I’ve never kept up with any type of journaling consistently until I started using this app. It’s so easy to add a picture from your day every day, and the streak counts and memories are really motivating to do so.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12146207003",
    "userName": "DizzyBalloonLover",
    "userUrl": "https://itunes.apple.com/us/reviews/id42666407",
    "version": "3.41.6",
    "score": 5,
    "title": "This app is perfection",
    "text": "Thank you to the happy feed team - i wanted an app where i could take a photo a day without all of the baggage of modern social media, and happy feed delivers. Really grateful for this app.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12143565203",
    "userName": "sleepingbetter01",
    "userUrl": "https://itunes.apple.com/us/reviews/id155756704",
    "version": "3.41.6",
    "score": 5,
    "title": "Love it!",
    "text": "Stumbled on this app and at first wanted to see if it was free and I like it. I’m adding pictures too!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12130096434",
    "userName": "tatydupin",
    "userUrl": "https://itunes.apple.com/us/reviews/id676265523",
    "version": "3.41.6",
    "score": 5,
    "title": "Yay",
    "text": "I like it and it’s super demure\n🙃",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "12105781582",
    "userName": "Scroms23",
    "userUrl": "https://itunes.apple.com/us/reviews/id251055099",
    "version": "3.41.6",
    "score": 5,
    "title": "Daily Joy!",
    "text": "I have 2093 days! I simply love it 🩷",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11994437398",
    "userName": "Mia is confused",
    "userUrl": "https://itunes.apple.com/us/reviews/id1151014311",
    "version": "3.40.8",
    "score": 5,
    "title": "Very Helpful",
    "text": "This wonderful app reminds me to focus on the positive side of things and to be grateful for the beautiful things and people in life. When I look back at the positive aspects of life using the app, it makes my perspective of my history so much nicer. Thank you!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11968110105",
    "userName": "Hahaoebfjdbdhhd",
    "userUrl": "https://itunes.apple.com/us/reviews/id429197186",
    "version": "3.40.8",
    "score": 5,
    "title": "THIS APP HAS CHANGED MY LIFE!!!!! FRFR",
    "text": "This app has truly changed my life. It has helped me look at my life and a much more appreciative way and cherish moments that I would forget to otherwise. I had a really unhealthy relationship with social media. This became a healer for that. Because I only see my own life and the beautiful things that I love about my life and I’m not comparing it to anyone else’s.\n\nI romanticize my life :)",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11931394969",
    "userName": "!xchrxbj",
    "userUrl": "https://itunes.apple.com/us/reviews/id1485671160",
    "version": "3.40.6",
    "score": 5,
    "title": "Review",
    "text": "I love this app because I can take it with me everywhere.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11845689602",
    "userName": "LLL76",
    "userUrl": "https://itunes.apple.com/us/reviews/id165910286",
    "version": "3.40.4",
    "score": 5,
    "title": "changed my life",
    "text": "After watching the movie Soul and realizing I had a sudden deep desire to better appreciate the small wonderful moments in my life, i downloaded this app on a whim. And  4 years later I can honestly say it has changed my life and my perspective of it. I find myself looking for things throughout my day that brought me joy and I notice far more simple little moments than I did before. I love that I can add pictures to my entries and go back and look at what made me happy a year or two or three ago and see how I’ve changed and grown. I have not been completely consistent but I am proud to say I’ve competed 874 days of happyfeed and cannot wait for more! I’ve only ever had good experiences with their customer service and the app has always worked well and without bugs or glitches",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11845510637",
    "userName": "Yannie.Heng",
    "userUrl": "https://itunes.apple.com/us/reviews/id1090737822",
    "version": "3.40.4",
    "score": 5,
    "title": "My favorite app ever",
    "text": "This app has gotten me through medical school and now residency. I’m so grateful to be able to focus on the happy things in the midst of such a challenging season",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11840277047",
    "userName": "Tiffany 1230",
    "userUrl": "https://itunes.apple.com/us/reviews/id553854937",
    "version": "3.40.4",
    "score": 5,
    "title": "Really Helps!",
    "text": "I love using this app it really helps to upgrade your mood. The streaks motivate you to stay consistent. You can join a randomized group which is so fun and inspiring. The flashback moments are an amazing feature as well, constantly reminding you of your good days. I love this app! I’d love if you weren’t limited on the amount of daily moments. I really do feel like this helps maintain a more positive mood and outlook",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11813193846",
    "userName": "tabsthecatmom",
    "userUrl": "https://itunes.apple.com/us/reviews/id124953640",
    "version": "3.40.3",
    "score": 5,
    "title": "The BEST",
    "text": "HappyFeed is my favorite app EVER and one of my favorite things to do everyday. I love seeing my memories from over the years each day. It’s really the best and brings a smile to my often 🥰 I recommend it to everyone. Thank you for such a wonderful journal of memories!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11783241544",
    "userName": "Brenbrenmom02",
    "userUrl": "https://itunes.apple.com/us/reviews/id202816288",
    "version": "3.40.3",
    "score": 5,
    "title": "Love this Journal App",
    "text": "It’s so easy to use! I’ve been using it now for over 760 consecutive days!!!! It’s my inspiration journey journal. I made a group share with my best friend so we can share our days goals accomplishments etc  it’s truly a great app",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11779792876",
    "userName": "Busybee644",
    "userUrl": "https://itunes.apple.com/us/reviews/id394257269",
    "version": "3.40.3",
    "score": 5,
    "title": "Happyfeed makes me happy",
    "text": "Love that I can see years of memories.  Especially when I might be having a down day, love looking back and seeing what made me happy one year, two years or even six years ago.  Brings tears to my eyes at times. Makes me laugh out loud too. Thank you Matt for creating HappyFeed. Can’t go a day without posting.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11741554042",
    "userName": "Bohemhippiex",
    "userUrl": "https://itunes.apple.com/us/reviews/id325994009",
    "version": "3.40.2",
    "score": 5,
    "title": "I like it",
    "text": "Makes me keep on track little miracles everyday 🫶🏻",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11609289751",
    "userName": "Topeka Art Diva",
    "userUrl": "https://itunes.apple.com/us/reviews/id219792145",
    "version": "3.40.0",
    "score": 5,
    "title": "Enjoy using Happy Feed for gratitude journaling",
    "text": "I’ve been doing gratitude journaling for years. Happy Feed makes it easy. Like the prompts and enjoy ability to add pics.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11546517376",
    "userName": "Rose's walker",
    "userUrl": "https://itunes.apple.com/us/reviews/id415985154",
    "version": "3.39.13",
    "score": 5,
    "title": "Simple and powerful",
    "text": "Easy to use way to gratitude journal. I love looking back at past moments of joy.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11520398715",
    "userName": "kk4830",
    "userUrl": "https://itunes.apple.com/us/reviews/id499237148",
    "version": "3.39.13",
    "score": 5,
    "title": "Small time commitment, big impact",
    "text": "I have ADD and can have a difficult time focusing. So I get down and give up on things a lot. But something about this app keeps me coming back daily. I'm on a 29-day streak and can't imagine missing one. It's an incredible feeling looking at all of those thankful/grateful thoughts accumulated in one place. If you're looking for a more hopeful, positive mindset, I can't recommend this app highly enough.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11489205154",
    "userName": "TA Hurley",
    "userUrl": "https://itunes.apple.com/us/reviews/id609757092",
    "version": "3.39.13",
    "score": 5,
    "title": "Love this app!",
    "text": "I have had Happyfeed for more than three years and I absolutely love it. It’s an easy way to remind myself to think about what I’m grateful for every day. I love being able to add photos and now that I’ve been using it for a while, I can look back at the things I was grateful for three or six months ago or one, two or three years ago! It is fantastic for helping me relive happy memories",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11357498908",
    "userName": "Jesssayyess",
    "userUrl": "https://itunes.apple.com/us/reviews/id1611590505",
    "version": "3.39.10",
    "score": 5,
    "title": "11 out of 10 would recommend.",
    "text": "I think the app is wonderful. It’s simple yet such a great tool. It’s a good resource to help you focus on the positive things in each day. Even on your worst day, just by naming 3 good things can help improve your mood. The 3 good things could be simple, like the weather felt nice outside today. I got to sleep in a little later today. Or I was able to afford McDonalds breakfast this morning instead of cooking or worse, not being able to eat at all. Appreciate the little positive things about life. I love how the app lets you add pictures and a little short entry, but also an emoji you can choose to represent your day. Once your entered enough, it creates these cute slideshow videos. Also, you can join pods and can choose which entries you would like to share or not. You can also create your own pod. For example, I made one called “Happy Girls are the Prettiest,” which I made for a group of girls like me. Maybe a mom. Maybe someone struggling with depression or low self esteem. It’s my motivational entries I share in this pod to remind myself & others than inner beauty is worth so much more than outer beauty. \nBut anyways, YES YES YES, I Would definitely recommend to all!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11353235042",
    "userName": "Kama345",
    "userUrl": "https://itunes.apple.com/us/reviews/id102880044",
    "version": "3.39.10",
    "score": 3,
    "title": "Can’t see previous posts!?!?",
    "text": "Overall I love the idea. I’ve been looking for a daily photo journal/ gratitude app. Being honest, I don’t want to pay a monthly fee to add 1-2 photos and reflect on my day. This app allows me to add up to 3 photos for a day without paying for upgrade. That is awesome!! I love that it gives me little prompts or ideas I could use if needed. \nDownside, I can’t easily find or read my past entries. I’m not always great at doing it every day but really try to make sure I have something for each day. I can see my moments from the current week and even the previous week but have to pay for upgrade if I want to see further back or the previous month. That’s very disappointing to me that I can’t easily access and see my full month in a view. I have to pay for premium to see photos, memories and moments. Hard to reflect on my gratitude if I don’t want to pay. I continue to use app for now (it’s been over a year) but not sure why. \nSide note - I am going through a hard time right now and would love to be able to view previous entries about my dog but unless it was on the same day a year ago I can’t find them.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11348160366",
    "userName": "Bookmory Review",
    "userUrl": "https://itunes.apple.com/us/reviews/id1436209393",
    "version": "3.39.10",
    "score": 5,
    "title": "Why Happyfeed is so amazing",
    "text": "Happyfeed is an amazing app it is great for me and my family to spend time together and have fun😁😁",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11309666743",
    "userName": "l. D.T .",
    "userUrl": "https://itunes.apple.com/us/reviews/id1093608196",
    "version": "3.39.10",
    "score": 5,
    "title": "Great app",
    "text": "This app just lets you be yourself I feel like you don’t have to show anyone it’s like your own person Al digital diary. I love it because I can just come on the app and post MY feelings. You can put the settings on private if you don’t want anyone else to see, you can also post it for everyone to see which I love! The app can have its downs, but I still rate it a five. When I am sad or just wanna type something, or share something I did that day I go to this app. I live letting people see what I did in the day to have fun, tester I posted and was NOT having fun but that doesn’t matter! I would 100% recommend this app! It just helps sometimes, or just for fun.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11280191449",
    "userName": "16 arms",
    "userUrl": "https://itunes.apple.com/us/reviews/id40675201",
    "version": "3.39.10",
    "score": 1,
    "title": "Misleading",
    "text": "I just wanted a simple photo with journal.  You can’t use photos unless you upgrade to plus?",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11274012778",
    "userName": "Ktj717",
    "userUrl": "https://itunes.apple.com/us/reviews/id30371541",
    "version": "3.39.10",
    "score": 5,
    "title": "Two years! 730 days!",
    "text": "Been using this app daily for two years now and I love it! Their customer support is excellent as well, even just for the free version! The free version is complete meaning you don't have to pay for basic use. The upgrade/paid version allows you to do more like export but isn't required for longterm daily use. I am very happy with it and will probably upgrade soon to be able to export but also because I just want to support this awesome app! Definitely recommend!\nPro tip: I read a review once that mentioned a mom who used specific emojis for each kiddo so occasionally she could sit with that kid and search for the positive posts and moments about that specific person! I LOVE that idea and it could definitely be applied to other categories or groups! Enjoy! 💚",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11254128648",
    "userName": "Jade Haruki",
    "userUrl": "https://itunes.apple.com/us/reviews/id1191015380",
    "version": "3.39.10",
    "score": 1,
    "title": "Don’t bother if you’re not willing to pay for it",
    "text": "I get not being able to edit entries from past months, but after a month passes, you can’t even look at the video entries you made back then without paying premium. Just make the entire app cost money if you’re going to do that",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11164443689",
    "userName": "Draw Master 7",
    "userUrl": "https://itunes.apple.com/us/reviews/id108860327",
    "version": "3.39.8",
    "score": 3,
    "title": "New to the app",
    "text": "I hate traditional social media and liked the idea of an app that centered gratitude that could be as private or shared as you want. I think this app could take off if they made some slight changes. The premium version should be free to increase user ship. The app design is close but needs to be more seamless and mirror apps like Instagram to help increase use. I hope these things occur and I can convince my friends and fam to leave the other apps!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11147814883",
    "userName": "limamiss",
    "userUrl": "https://itunes.apple.com/us/reviews/id228708941",
    "version": "3.39.8",
    "score": 5,
    "title": "Simple and does the trick!",
    "text": "The app keeps your memories so you can reflect on fun things!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11096678368",
    "userName": "Calbeauty",
    "userUrl": "https://itunes.apple.com/us/reviews/id296133190",
    "version": "3.39.8",
    "score": 5,
    "title": "Best gratitude journal for improving your mental health!",
    "text": "I have been using Happyfeed for several years and can honestly say that it is my favorite app. I am an LCSW and see the value in using positive psychology for improving our mental health. Keeping a gratitude journal has improved my physical, emotional and mental health. I love that I can store videos, photos and stories in my daily gratitude journal and my practice has made such a positive impact on my overall being and this is an app that I share with all of my friends, family, and colleagues. On my blog I’ve written about my daily gratitude practice and how instrumental it has been for my mental health and I always recommend HappyFeed because it’s fun, inspiring and easy to use!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11055504495",
    "userName": "Bear🧸2654873",
    "userUrl": "https://itunes.apple.com/us/reviews/id1169699252",
    "version": "3.39.6",
    "score": 5,
    "title": "Amazing 🤩 👍",
    "text": "Happy feed is the best app ever because it helps me and I also have a bunch of memories they’re and when I get a 100 day streak I will fiche you a update and ask google to make you guys that worked so hard on happy feed the top app of the year. I love happy feed it also helps me with my gratitude journals and my streak is 3 I am abt to be on streak 4 Like OMG I love this app I will tell all my friends about this amazing app because I love it this helps me with my gratuities journal and memories and j can also use it a a diary so I will give this a five 5 star ⭐️ rating . Absolutely loveing it I reckon you get this amazing app",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "11031110617",
    "userName": "Dana_C02",
    "userUrl": "https://itunes.apple.com/us/reviews/id189861701",
    "version": "3.39.6",
    "score": 5,
    "title": "Happyfeed",
    "text": "I know because it helps share life with you❤️‍🔥❤️‍🔥",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10958226454",
    "userName": "Judtcsllmemoon",
    "userUrl": "https://itunes.apple.com/us/reviews/id25377411",
    "version": "3.39.5",
    "score": 5,
    "title": "I still love this daily practice",
    "text": "I absolutely love this app. If you’re stressed, you might ignore this on those days, but that is the exact opposite of what you should do. It forces your brain to slow down and find the good in your day. It keeps everything in perspective, and it’s so nice to look back on past grateful moments and pictures.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10852898170",
    "userName": "itsxkait3ree",
    "userUrl": "https://itunes.apple.com/us/reviews/id131403649",
    "version": "3.39.1",
    "score": 5,
    "title": "Gratitude",
    "text": "Happy Feed helps me to stop each day and notice the little things, as well as the big things. I have become a more gracious person by engaging in this practice daily.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10834382451",
    "userName": "Juliet_Marie",
    "userUrl": "https://itunes.apple.com/us/reviews/id122590712",
    "version": "3.39.1",
    "score": 5,
    "title": "Amazing app for mental health!",
    "text": "Love this app so much! Also like I am not always being pestered to buy the paid version. This is great for a mental health check in at the end of the day and nice reminders to keep you happy about previous weeks you’ve had.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10826963319",
    "userName": "Stop asking me to review...",
    "userUrl": "https://itunes.apple.com/us/reviews/id296027503",
    "version": "3.39.0",
    "score": 5,
    "title": "Great alternative to Instagram",
    "text": "I stumbled upon happyfeed while looking for an alternative to Instagram. I wanted to be able to post more for myself than other people as a way to track memories and events. I also got tired of suggested videos/accounts/ads on Instagram. Happyfeed is perfect for what I was looking for! The default of every post is private, but also has an option of sharing posts with close friends. There is a focus on posting/writing about what you are grateful for which has been a cool lens to view posting through as well.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10808550189",
    "userName": "Onesassywahine",
    "userUrl": "https://itunes.apple.com/us/reviews/id33685032",
    "version": "3.39.0",
    "score": 5,
    "title": "The only app I won’t shut up about.",
    "text": "Over 5 years ago I started doing this app when I was going through a messy breakup. This app helped teach me to look for the 3 good things in my day. At first it was hard and after some time it got a little easier. Now, when I have the suckiest of days I can normally come up with 3 good things in my day that are be worth recording. They may not be big but I can find the pockets of joy to be grateful for (sunshine, pretty flower, nice interaction with a stranger, etc). I look forward to recording my 3 good things every night and looking back at past memories (some bittersweet but mostly just sweet). The practice of this app everyday chanced my outlook on life for the better. It may sound corny but it’s the one app I won’t shut up about.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10764262454",
    "userName": "AugieGirl2008",
    "userUrl": "https://itunes.apple.com/us/reviews/id1125972913",
    "version": "3.38.9",
    "score": 5,
    "title": "Delight!",
    "text": "I was trying to find something I could upload pictures to, to make a time capsule of delights that made me smile throughout the day. This app does just that. I can decide how and if I want to share with others (pods). And I can look back in a timeline and reflect on what made me happy. This app was exactly what I was looking for, and I can’t wait to see how far my delight/gratitude journal will take me! 150 days strong so far!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10704662244",
    "userName": "Mel_Ride!",
    "userUrl": "https://itunes.apple.com/us/reviews/id22781133",
    "version": "3.38.6",
    "score": 5,
    "title": "Easy journaling",
    "text": "This app is helping me stick to my daily “writing “ goal. I don’t think I’ve written more than one sentence yet, but the habit is being formed. I also like the random pop up reminders of days gone by! Thank You!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10654942299",
    "userName": "JLK1312",
    "userUrl": "https://itunes.apple.com/us/reviews/id1482914735",
    "version": "3.38.4",
    "score": 5,
    "title": "Awesome",
    "text": "I just started doing happy feed but it is such a fun thing to write about your day! And when I have pics about my day it just adds up a fun element to this AMAZING online journal.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10478159341",
    "userName": "That guy like 2",
    "userUrl": "https://itunes.apple.com/us/reviews/id391448413",
    "version": "3.37.0",
    "score": 5,
    "title": "Amazing personal journal",
    "text": "The streak feature is what really gets me to write everyday. I want to be able to look back at my life and remember everything. from the minute things i do during the day along side the pictures i take. i’m in the 500s now. and i can now look back a year and see what i was doing on each specific day. Each entry max’s out at 560 with 4 photos or one video but you can do up to 10 entries per day. The calendar view is cool to look at as you fill a whole month. If you forget to write. It doesn’t matter how long you go without writing. If you go on a week vacation and don’t have time. You get to keep your streak as long as you enter the days in the chronological order. Never skip a day. There’s also a map view that shows where the geological data of the photo was taken. Cool to see all the places i’ve been. it doesn’t track you just logs the data in the photo if it even has my favorite feature is the face ID lock. let’s me feel more comfortable writing more personal stuff in my personal daily journal. Amazing app. I recommend to all my friends",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10442918953",
    "userName": "Christie S71",
    "userUrl": "https://itunes.apple.com/us/reviews/id1268112090",
    "version": "3.36.1",
    "score": 5,
    "title": "Time hip",
    "text": "Love it",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10392549561",
    "userName": "Happyfeed Hippo",
    "userUrl": "https://itunes.apple.com/us/reviews/id1038040913",
    "version": "3.35.2",
    "score": 5,
    "title": "Great",
    "text": "This app works very very well. Love it!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10347810719",
    "userName": "jmac213",
    "userUrl": "https://itunes.apple.com/us/reviews/id42574012",
    "version": "3.35.1",
    "score": 2,
    "title": "It could be worse I suppose.",
    "text": "I don’t need daily notifications to look at old posts I made. I don’t Mond the daily reminder if I can net posted yet. This is to all app makers: need as few notifications as possible. The bare minutes please. This is annoying enough tjat I might have to find a new gratitude app. One that I am grateful for.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10330365079",
    "userName": "TheMassiveLion",
    "userUrl": "https://itunes.apple.com/us/reviews/id113853390",
    "version": "3.35.1",
    "score": 5,
    "title": "This app is truly a marvel!!",
    "text": "Just 3 positive moments a day. It makes a huge difference!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10319165308",
    "userName": "ListentotheWord",
    "userUrl": "https://itunes.apple.com/us/reviews/id542841457",
    "version": "3.35.1",
    "score": 5,
    "title": "Helping me stay in my day",
    "text": "I am using the app to take a moment of gratitude for someone or something after reading the book Burnout. And I love that I can do this daily and add a photo but also add just a short note. It fits my style.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10308056534",
    "userName": "MrsMadea",
    "userUrl": "https://itunes.apple.com/us/reviews/id1387465378",
    "version": "3.35.1",
    "score": 5,
    "title": "Great Day",
    "text": "I am happy I am going to have a great day. Positive vibes only. I am manifesting that money will come my way.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10303362533",
    "userName": "Jferlinus",
    "userUrl": "https://itunes.apple.com/us/reviews/id698192270",
    "version": "3.35.1",
    "score": 4,
    "title": "Such a wonderful app!",
    "text": "I love this app!! I recommend to anyone looking to begin a gratitude practice!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10301319072",
    "userName": "sparknglit",
    "userUrl": "https://itunes.apple.com/us/reviews/id1447369812",
    "version": "3.35.1",
    "score": 5,
    "title": "Great app",
    "text": "I love the inspiration ideas and using the app daily reminds me of all my fun adventures",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10243214992",
    "userName": "Lonnie de2345",
    "userUrl": "https://itunes.apple.com/us/reviews/id151761094",
    "version": "3.35.1",
    "score": 5,
    "title": "Happyfeed",
    "text": "Excellent app",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10241548023",
    "userName": "Julie Thomas 187",
    "userUrl": "https://itunes.apple.com/us/reviews/id1247580764",
    "version": "3.35.1",
    "score": 5,
    "title": "Happy feed",
    "text": "I’ve really enjoyed this app. Sometimes I wish there was more to it but I love being able to think about certain positive things. Sometimes it is a challenge. ❤️",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10209741223",
    "userName": "Nana1721",
    "userUrl": "https://itunes.apple.com/us/reviews/id627236058",
    "version": "3.35.0",
    "score": 5,
    "title": "Important ease of use",
    "text": "Makes me feel good, reminds me to write my passages. You can journal or just quick quote or happy thoughts. Soo easy. :)",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10196464380",
    "userName": "Jdubaz13",
    "userUrl": "https://itunes.apple.com/us/reviews/id29726089",
    "version": "3.35.0",
    "score": 5,
    "title": "Favorite App!",
    "text": "Love this app so much- I have used it everyday for over 3 years now, I love having a way to record all my happy memories that’s just for me. Also looking forward to the day I can turn it into a photo book! 😃 Great app, easy to use and a great way to spark joy each day. 💜",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10129210831",
    "userName": "Animalscantjudge",
    "userUrl": "https://itunes.apple.com/us/reviews/id1449389348",
    "version": "3.34.6",
    "score": 5,
    "title": "Yeps",
    "text": "Yeps",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10116039806",
    "userName": "P.Smith.13",
    "userUrl": "https://itunes.apple.com/us/reviews/id25029889",
    "version": "3.34.6",
    "score": 5,
    "title": "So grateful for this app!",
    "text": "I have been using this app for over 5 years. I switched to this instead of writing a journal which I found to be increasingly onerous. I love how user friendly Happyfeed is and the ability to add photos and emojis. The best part is being able to look back on any day several years ago and wax nostalgic about the past. Oh and being able to download a report of all your entries. And I also like the collage you can create with different pictures. Gosh so many things to love about this app!!! Thank you for creating it. I am so much happier for using it 😊",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10103130990",
    "userName": "adibisceglie at you",
    "userUrl": "https://itunes.apple.com/us/reviews/id692327807",
    "version": "3.34.6",
    "score": 5,
    "title": "Love it",
    "text": "I like it it’s really cool but it keeps asking for some + thing\nCan you fix",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10048829970",
    "userName": "erinlamae08",
    "userUrl": "https://itunes.apple.com/us/reviews/id127124084",
    "version": "3.34.4",
    "score": 5,
    "title": "Happy Feed Memories",
    "text": "I absolutely love it! I also love that I can keep all of my favorite photos saved to  my favorite memories for quick access",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10039816140",
    "userName": "Mrsbenjen",
    "userUrl": "https://itunes.apple.com/us/reviews/id393695485",
    "version": "3.34.4",
    "score": 5,
    "title": "First timer",
    "text": "This app was very easy to set up! I am excited to get my journal going.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10019614015",
    "userName": "BB7314",
    "userUrl": "https://itunes.apple.com/us/reviews/id566557178",
    "version": "3.43.3",
    "score": 5,
    "title": "My favorite app",
    "text": "Can’t believe I just discovered Happyfeed, it’s now my favorite app to use. I wish I’d been using it since it came out!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "10009755311",
    "userName": "ErleneA",
    "userUrl": "https://itunes.apple.com/us/reviews/id567492152",
    "version": "3.43.3",
    "score": 3,
    "title": "New Desktop Icon",
    "text": "I love the app but I don’t like the new app icon at all. Looks like a faceless space alien or insect.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9992131727",
    "userName": "Tata&Umpa",
    "userUrl": "https://itunes.apple.com/us/reviews/id1336748917",
    "version": "3.43.3",
    "score": 5,
    "title": "Memorable for sure Good or Bad days.",
    "text": "Love this App. I don’t remember to do this everyday but I do my best.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9976669352",
    "userName": "kryptonianchick",
    "userUrl": "https://itunes.apple.com/us/reviews/id309888425",
    "version": "3.43.3",
    "score": 5,
    "title": "Love it",
    "text": "I love this app.. it’s helping me with post partum.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9931473208",
    "userName": "Jazzie1016",
    "userUrl": "https://itunes.apple.com/us/reviews/id106708079",
    "version": "3.34.0",
    "score": 5,
    "title": "My favorite app",
    "text": "I love this app!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9917658155",
    "userName": "kseniia2017",
    "userUrl": "https://itunes.apple.com/us/reviews/id1279352104",
    "version": "3.34.0",
    "score": 5,
    "title": "My mental healing diary",
    "text": "I am super grateful for everyone involved into the development of this app, it helps noticing small beautiful things throughout the day. I love memories feature, every time I see it I inspire myself to write more and do not miss a day. I love how it gently pushes me reminders. As a UI UX Designer I gonna confess that this app is easy and pleasant to use, it doesn’t bother me with purchases and ads. I am just beyond grateful for the mission behind the app, grateful to use it!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9913746240",
    "userName": "Greysgal1234",
    "userUrl": "https://itunes.apple.com/us/reviews/id133363997",
    "version": "3.33.5",
    "score": 5,
    "title": "So cool :)",
    "text": "I was looking for an alternative to Instagram, something just for me. This is the perfect place to document all of my little moments, and the focus on gratitude is even better :) love this app!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9903514062",
    "userName": "leros82",
    "userUrl": "https://itunes.apple.com/us/reviews/id30590586",
    "version": "3.33.5",
    "score": 5,
    "title": "Love this app",
    "text": "I’ve tried lots of journal apps, but this seems to be the only one that has a majority of the features I’ve been looking for! I also want to give a shout-out to the developer for helping me fix my subscription when I was having issues with it not working. They responded very quickly and were able to fix the problem without issues.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9895292502",
    "userName": "Azrabee",
    "userUrl": "https://itunes.apple.com/us/reviews/id622787573",
    "version": "3.33.5",
    "score": 5,
    "title": "The best gratitude app I’ve found! So easy!",
    "text": "I’be been using this app for 5 years now and it’s completely changed how I can write down the things I’m grateful for! It’s personal and so easy to use! Love that it also serves as a remind of things in the past that I’ve been grateful for! Overall great app!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9867384474",
    "userName": "Squirrels59",
    "userUrl": "https://itunes.apple.com/us/reviews/id36947439",
    "version": "3.33.5",
    "score": 5,
    "title": "Super Quick & Easy",
    "text": "Love this App! It’s so easy to use and so adaptable to make it what you want or need for every entry.  The reason I found it was that I wanted a quick and easy way to post pictures from all over to use as gratitudes. Even reached out to support to ask a question and got an immediate personal response from the developer. Try it.. you’ll love it",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9865416344",
    "userName": "MarenMac",
    "userUrl": "https://itunes.apple.com/us/reviews/id1522884059",
    "version": "3.33.5",
    "score": 5,
    "title": "Best app I’ve downloaded",
    "text": "I downloaded this app shortly after giving birth to my first baby about a year ago. It’s become my journal and an easy way to document my days. I write down little moments about my little one and my life as a mom—and it’s really helped me slow down and find the positive happy moments. I’ve just hit my year streak. I love being able to go back and see where we were a few months ago, and now a year ago. It’s been so meaningful. Highly recommend!! I share it with all my friends. So grateful for this app.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9831570131",
    "userName": "Bandia",
    "userUrl": "https://itunes.apple.com/us/reviews/id109396492",
    "version": "3.33.4",
    "score": 1,
    "title": "Disappointed",
    "text": "Constantly drops entries",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9784418689",
    "userName": "gahavvahabh",
    "userUrl": "https://itunes.apple.com/us/reviews/id1280979772",
    "version": "3.33.2",
    "score": 5,
    "title": "Memories",
    "text": "Memories",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9735434861",
    "userName": "sw1266",
    "userUrl": "https://itunes.apple.com/us/reviews/id1205105604",
    "version": "3.31.7",
    "score": 5,
    "title": "AMAZING",
    "text": "I love this app! It’s such a great way to show gratitude and see what others are thankful for! I love it!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9735306467",
    "userName": "Love Foods God Made!",
    "userUrl": "https://itunes.apple.com/us/reviews/id724997144",
    "version": "3.31.7",
    "score": 4,
    "title": "Little confusing at first",
    "text": "A little confusing on features & how to navigate.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9720517315",
    "userName": "Lermyy",
    "userUrl": "https://itunes.apple.com/us/reviews/id353652988",
    "version": "3.31.7",
    "score": 5,
    "title": "Great alternative to Instagram",
    "text": "I like this daily tracking of photos! I do wish the wording wasn’t so “happy” focused. I’m looking for something that isn’t just a highlight reel. I want to reflect my daily life, and sometimes that’s not necessarily “happy” but it’s still worth sharing and being real. The wording adds pressure rather than space to cultivate gratitude in my opinion. Other than that it’s great!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9717969002",
    "userName": "srk+3kids",
    "userUrl": "https://itunes.apple.com/us/reviews/id103524456",
    "version": "3.31.7",
    "score": 5,
    "title": "Positivity",
    "text": "Accountability tool for my daily happy reflection! I turned off most of my notifications to maintain sense of calmness, and non-intrusiveness, but left one that I think is called the badge notification. At the end of the day, I reflect briefly while heading to bed on one thing that made me feel happy. I appreciate these small moments. Simplicity is sometimes the best. Thanks!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9676313996",
    "userName": "makvwa",
    "userUrl": "https://itunes.apple.com/us/reviews/id452024852",
    "version": "3.31.7",
    "score": 5,
    "title": "Love this app",
    "text": "I have never been able to keep a journal consistently until I started using Happyfeed. It has been so helpful for me to be consistent and to take the time to reflect on my day. Through using this app for about 9 months now I have been able to see the benefit of having the memories of both good and bad days. I appreciates it user-friendliness and how the streak screen continues to encourage you. I would recommend this for anyone who wants to be more consistent with journaling and just needs a place to start. An added bonus is the community aspect and been able to enjoy life and moments with people even when they are far away.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9672069630",
    "userName": "Tony’s Girl",
    "userUrl": "https://itunes.apple.com/us/reviews/id327650460",
    "version": "3.31.7",
    "score": 5,
    "title": "Awesomest app ever!",
    "text": "I LOVE HappyFeed! I am up to six years and running with my daily memories and I wouldn’t trade them for anything. I used to feel like I was losing my life due to memory issues; but now, I get to relive my happiest moments every single day. If I go for a day without writing in it, it feels incomplete. Some days, when I don’t have time to write, I simply use my photos to tell the story of that day. Either way, I am thrilled with the results…memories that I get to revisit over and over again. Thank you, HappyFeed! YOU ROCK!!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9650461255",
    "userName": "stel the bel",
    "userUrl": "https://itunes.apple.com/us/reviews/id1502460435",
    "version": "3.31.6",
    "score": 3,
    "title": "It’s good",
    "text": "It’s pretty good I like it you can talk to your friends and send pics I would recommend it",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9636123181",
    "userName": "LeeLee040301",
    "userUrl": "https://itunes.apple.com/us/reviews/id655663442",
    "version": "3.31.5",
    "score": 5,
    "title": "HappyFeed",
    "text": "I love this app!!! It’s adorable and user friendly, and I love the little encouragement the app gives you when you’re having some trouble with something to write. It’s so nice to scroll through and see an endless stream (or feed) of things that make me smile 🥰",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9634396406",
    "userName": "spateras",
    "userUrl": "https://itunes.apple.com/us/reviews/id208144612",
    "version": "3.31.5",
    "score": 5,
    "title": "Simple yet effective",
    "text": "I didn’t believe that writing down every day what you’re grateful for would have a profound effect on your thought patterns but it truly does. A mental health provider said to do it once a day for 30 days and see if it had an effect or not. It did and I love taking 2 min out of my day to go into the app and write down one thing. Love looking back and seeing all the joy that fills my life.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9627843662",
    "userName": "chasevaughn05",
    "userUrl": "https://itunes.apple.com/us/reviews/id1449821026",
    "version": "3.31.5",
    "score": 5,
    "title": "Amazing",
    "text": "Helps me calm down, the best app ever",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9601910315",
    "userName": "JewelPlaay",
    "userUrl": "https://itunes.apple.com/us/reviews/id1458261590",
    "version": "3.31.3",
    "score": 4,
    "title": "Good for being kind to self!",
    "text": "If you're like myself this is a good gratitude tool to use during the day because it's something you'll look forward to throughout the day.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9587459880",
    "userName": "Cheri4Homes",
    "userUrl": "https://itunes.apple.com/us/reviews/id33798631",
    "version": "3.31.2",
    "score": 5,
    "title": "Great way to reflect on the day!",
    "text": "I was looking for a way to establish a daily gratitude habit - a moment to reflect on my day that was not complicated, was actually fun to keep going, and felt good. THIS is all that! I love that I can incorporate a pic or video from the day or a few words to remember a nice moment. I can access it any time of day or anywhere (so many journals left stacked on my nightstand!). And I truly enjoy a quick reflection on the best of my day (even if it is my morning coffee!) - feels good ❤️ and makes me happy.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9586786237",
    "userName": "mmpr",
    "userUrl": "https://itunes.apple.com/us/reviews/id41255150",
    "version": "3.31.2",
    "score": 5,
    "title": "Excellent app, very responsive developer",
    "text": "I started using this app in early January 2023. I had some questions and got immediate help from the app developer.\n\nThe free version of the app is very generous in what it allows. It is helping me break free of intense worry, and rather, focus on the blessings in my life. Thank you.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9582370088",
    "userName": "brynney bears",
    "userUrl": "https://itunes.apple.com/us/reviews/id492372052",
    "version": "3.31.1",
    "score": 4,
    "title": "It has a little bugs but otherwise it’s amazing",
    "text": "This game is amazing to write your feelings. So if you have trouble with writing your feelings this is an amazing app. You can also put really cute or motivating quotes with your writing. It is a really good app, but it could use some options on the app for quotes and photos for your writing for people like me who do not love to show their face or personal life",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9579174183",
    "userName": "Sharing",
    "userUrl": "https://itunes.apple.com/us/reviews/id41365165",
    "version": "3.31.0",
    "score": 5,
    "title": "Love this app!",
    "text": "Happyfeed allows me to use photos as visual cues for my gratitude practice. Reviewing my posts keeps me connected with my deepest Self. It is unbelievably valuable! ♥️",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9551334408",
    "userName": "OGCatCity",
    "userUrl": "https://itunes.apple.com/us/reviews/id921037745",
    "version": "3.30.3",
    "score": 5,
    "title": "Nothing short of perfect",
    "text": "Downloaded this all by the recommendation from Amy Landino. Such an incredible app. I’ve been using it for about 3 years now and it’s so beautiful getting a chance to not only reflect back on the happy moments, but getting a chance to visually see those moments too! As someone who loves using pen & paper to journal, this is such a nice addition to my gratitude practice. I love being able to save these core memories and reflect back on them. The app has also made some wonderful developments in the last few years, such as adding the option for video and shaking the jar to see your past memories. Highly recommend!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9530384995",
    "userName": "Claire Niskern",
    "userUrl": "https://itunes.apple.com/us/reviews/id274084790",
    "version": "3.30.3",
    "score": 4,
    "title": "Wonderful",
    "text": "It’s a nice little way to make myself stop and remember how amazing my life is.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9518611332",
    "userName": "Charlie puff :)",
    "userUrl": "https://itunes.apple.com/us/reviews/id1489620720",
    "version": "3.30.3",
    "score": 5,
    "title": "Love the app",
    "text": "App is so good it works with habits and time love the app but maybe there could be a better if the add more features like maybe customized stuff",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9515539950",
    "userName": "CoLe027",
    "userUrl": "https://itunes.apple.com/us/reviews/id1195046768",
    "version": "3.30.3",
    "score": 5,
    "title": "Using as a Food Photo Journal",
    "text": "I couldn’t find a food photo journal that I could use with other people. I didn’t need it to track my calories or anything. I just wanted to add artsy pictures of my food somewhere to hold myself accountable and be able easily share my with my sister and see hers as well. So far HappyFeed feels pretty perfect for it! This is just the first day so we will see how it goes. I can definitely see myself using this for other things too!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9496016800",
    "userName": "Turbocaster",
    "userUrl": "https://itunes.apple.com/us/reviews/id157218923",
    "version": "3.30.3",
    "score": 5,
    "title": "Happy with Happyfeed",
    "text": "I have been using this app for four years, having achieved 1,835 days. It has become a regular part of my life that I truly look forward to every day.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9464904313",
    "userName": "Fall G@l",
    "userUrl": "https://itunes.apple.com/us/reviews/id529216609",
    "version": "3.30.1",
    "score": 5,
    "title": "My Favorite App and Place to Journal",
    "text": "After feeling so burnt out on Instagram and occasionally comparing my life and what I may be doing differently from my peers I decided to give Happyfeed a try. Honestly, it has truly helped me adopt an even greater attitude of gratitude and I enjoy journaling each day with it. I highly recommend it for those who want a break from all the normal social media buzz.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9464608621",
    "userName": "G-To-The-Max",
    "userUrl": "https://itunes.apple.com/us/reviews/id1385100610",
    "version": "3.30.1",
    "score": 5,
    "title": "Literally amazing!",
    "text": "I only had it for 2 weeks and am already in love! 😊 it allows you to reflect your on your day using a picture and you can look back on memories, but it also teaches you gratitude for even if your day was bad, you always can find the good something! And you don’t even have to get the pro version the regular versions just as good! 🤗 10 out of 10",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9459331456",
    "userName": "akia12480",
    "userUrl": "https://itunes.apple.com/us/reviews/id1483718779",
    "version": "3.30.1",
    "score": 5,
    "title": "Amazing app😍",
    "text": "The app is amazing like I said in the title and it works perfect for free",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9455885986",
    "userName": "kayle_27",
    "userUrl": "https://itunes.apple.com/us/reviews/id609777277",
    "version": "3.30.1",
    "score": 5,
    "title": "Easy way to maintain a gratitude practice!",
    "text": "I love this app! It reminds me to record what I’m grateful for and I love the ability to include photos! Thank you!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9453528418",
    "userName": "rseneta",
    "userUrl": "https://itunes.apple.com/us/reviews/id28678011",
    "version": "3.30.1",
    "score": 5,
    "title": "I love this app.",
    "text": "This app is everything I hoped for. I wanted a daily journal that I could add pictures too and export like a written journal. It does all of those things and more. I am a very visual person so the interface was important to me as well and it is very welcoming and intuitive.  I am happy to subscribe to this app and I am so excited to have 365 days of my life journaled. I love it. My entries aren’t always happy, but they are important moments in my life.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9450109106",
    "userName": "go.get.ice.cream.and.this.app",
    "userUrl": "https://itunes.apple.com/us/reviews/id1437867440",
    "version": "3.30.1",
    "score": 5,
    "title": "LOVE",
    "text": "I love Happyfeed so much! One of my favourite things is that it can give you an idea to write about daily so if I don’t know what to write about it helps a lot. For instance today it told me to write about the most positive person in your life that makes you feel happy so I wrote about my bestie. It is basically an online journal. You can also have a password/ Face ID so only you can see your journal. This app also has an OPTIONAL purchase and I didn’t buy it and no downsides. 🤍",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9426913051",
    "userName": "Kath@anywhere",
    "userUrl": "https://itunes.apple.com/us/reviews/id108289454",
    "version": "3.29.0",
    "score": 5,
    "title": "KG",
    "text": "Simple, easy to use, forgiving by one day!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9418461378",
    "userName": "I'm gonna fkin explode",
    "userUrl": "https://itunes.apple.com/us/reviews/id133924565",
    "version": "3.29.0",
    "score": 5,
    "title": "Love it",
    "text": "Great app!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9395515820",
    "userName": "bsktcs57",
    "userUrl": "https://itunes.apple.com/us/reviews/id9603964",
    "version": "3.29.0",
    "score": 5,
    "title": "I love this app! ♥️",
    "text": "I’ve tried several daily message apps and Happyfeed is the best. Most importantly, not only does it remind me to make a post, a number stays on the icon, until I do.\nI also get to put a photo (or 4) on the daily message. It’s great! ♥️",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9390217671",
    "userName": "Quintascash",
    "userUrl": "https://itunes.apple.com/us/reviews/id261514328",
    "version": "3.29.0",
    "score": 4,
    "title": "Awesome would totally recommend",
    "text": "There is only 4🌟 stars because I don’t want people to think this is a scam and people paid me to do this because That’s happens and this is not it so yaa and this is awesome",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9388313498",
    "userName": "adamwrightstuff",
    "userUrl": "https://itunes.apple.com/us/reviews/id33026601",
    "version": "3.29.0",
    "score": 5,
    "title": "[Update] gratitudes do not need to be social",
    "text": "I’ve been using this app for years and really enjoy it and pay for the monthly subscription. However, the recent update that asks you which followers you want to share your gratitudes with is not only in annoying user experience because it pops up after every gratitude but, additionally, it makes me feel like my personal gratitude. Notes are no longer personal and private.  I hope the product team considers removing this added feature or k may be on my way back to pen and paper. \n\nPerfect bite-sized daily positivity:\nThis app has beautiful UI and is simple to use. It is fun to look back on the past and see what brought you gratitude and happiness on a day in the past. Every morning I journal my short gratitude and it has changed my outlook in life 🙃",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9379586190",
    "userName": "t1a9o",
    "userUrl": "https://itunes.apple.com/us/reviews/id1302463599",
    "version": "3.29.0",
    "score": 5,
    "title": "Instagram Healthy alternative",
    "text": "This app needs more visibility! It’s so good to use!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9308481516",
    "userName": "emj200212",
    "userUrl": "https://itunes.apple.com/us/reviews/id1101533245",
    "version": "3.28.8",
    "score": 4,
    "title": "Almost perfect",
    "text": "I think the one thing that could make this app even better is if there was a way to have the notification come out at a random point each day to make you stop whatever you may be doing to think and be thankful",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9297757352",
    "userName": "Sunhinegirl",
    "userUrl": "https://itunes.apple.com/us/reviews/id1413469448",
    "version": "3.28.8",
    "score": 5,
    "title": "Happy Feed",
    "text": "Simply fun and easy to use gratitude app with prompt options and gentle reminders to journal. I like the opportunity to be part 2 random small pods which adds community and joy to my life. I value the ability to keep my entries private or choose to post to either/both pods. Happy Feed is an easy, pleasant and effective way to get in touch with gratitude each day. 🙂I am enjoying keeping my writing streak going and getting animated rewards incentivizes me 🙂",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9290009474",
    "userName": "tourist information",
    "userUrl": "https://itunes.apple.com/us/reviews/id1458243025",
    "version": "3.28.8",
    "score": 4,
    "title": "How I like this app!!!",
    "text": "I love this app just nothing is perfect in the world I love how you can share post with your friend and express your day and send daily encouragement to friends and family🤩👍💗😘🎉😍.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9203920590",
    "userName": "ShayCartier",
    "userUrl": "https://itunes.apple.com/us/reviews/id534080013",
    "version": "3.28.3",
    "score": 5,
    "title": "Happy Moments",
    "text": "I can’t see my photos anymore",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9189072960",
    "userName": "J*n*th*n",
    "userUrl": "https://itunes.apple.com/us/reviews/id221090301",
    "version": "3.28.3",
    "score": 5,
    "title": "Just what I was looking for",
    "text": "I’ve been trying to do this kind of thing for years on my own, collecting one image from each day that represents what I love - Happyfeed does it for me !  Wish I had discovered it sooner",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9072172027",
    "userName": "Danny61794",
    "userUrl": "https://itunes.apple.com/us/reviews/id36847479",
    "version": "3.27.12",
    "score": 5,
    "title": "Easy peasy",
    "text": "It’s great to be able to jot down a grateful thought as soon as it pops into my mind and not having to wait until I get to my journal at home.  Plus seeing past entries is neat. I’m loving this app!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "9041749105",
    "userName": "CJ&Bj",
    "userUrl": "https://itunes.apple.com/us/reviews/id100870616",
    "version": "3.27.10",
    "score": 5,
    "title": "So helpful!",
    "text": "Tracking what I accomplish *to relax* each day, having photos of the progress I make each day, *and* having it all in one place? This app makes me feel better about taking time from The Other Checklists If Doom to rest and do something enjoyable each day. I've been recommending it everywhere (especially to my fellow crafting friends?).",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8989913355",
    "userName": "LLFFLL88",
    "userUrl": "https://itunes.apple.com/us/reviews/id27383036",
    "version": "3.27.9",
    "score": 5,
    "title": "KISS",
    "text": "Keep it simple, silly.  Simple, smart, easy to use, and a quick way to remind you of what you should appreciate each day.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8989308938",
    "userName": "christhesingerforjesus",
    "userUrl": "https://itunes.apple.com/us/reviews/id971413702",
    "version": "3.27.9",
    "score": 4,
    "title": "One thing missing",
    "text": "It doesn’t allow you to share video! Once this feature is possible it will be a 5 star app!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8969816159",
    "userName": "pepyllihc",
    "userUrl": "https://itunes.apple.com/us/reviews/id498116358",
    "version": "3.27.7",
    "score": 5,
    "title": "Happyfeed",
    "text": "Gives me more meaning to life!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8965835342",
    "userName": "JSBTerp",
    "userUrl": "https://itunes.apple.com/us/reviews/id422568366",
    "version": "3.27.7",
    "score": 5,
    "title": "I love it!!",
    "text": "I haven’t missed a day since I downloaded this app. It makes it easy for me to remember what to be grateful for.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8964488129",
    "userName": "TrumpisthePeople'sPresident",
    "userUrl": "https://itunes.apple.com/us/reviews/id224377055",
    "version": "3.27.6",
    "score": 5,
    "title": "Love this App!",
    "text": "It makes me HAPPY!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8925872159",
    "userName": "Heavy user80010",
    "userUrl": "https://itunes.apple.com/us/reviews/id32158826",
    "version": "3.27.5",
    "score": 5,
    "title": "Great app",
    "text": "I love how this app reminds you to reflect on a happy day.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8925509675",
    "userName": "Kat -ri M",
    "userUrl": "https://itunes.apple.com/us/reviews/id1206457990",
    "version": "3.27.5",
    "score": 5,
    "title": "Awesome",
    "text": "This app is so great I post on it a lot and I just got it it’s also great because then you can really keep those memories cause I have more time for journaling on the phone. With a picture and a quick caption then writing in a notebook!! I just wish you could access the calendar without having to get the plus version cause I don’t have the money cause I’m a kid not saying all kids don’t have money but I wish that was accessible. But otherwise love it!! Thank you so much for this app it really brightens my day!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8894592543",
    "userName": "WW Shopper",
    "userUrl": "https://itunes.apple.com/us/reviews/id17900843",
    "version": "3.27.3",
    "score": 5,
    "title": "A Great App",
    "text": "Highly recommend. Journaling is not an easy habit to form. I will buy a notebook intended for journaling, write for a day or three then life gets in the way and before I know it, 5 months will have passed. Then I sit there staring at the notebook and think—damn, so much has happened I don’t have time to sit and journal all of it. Sound familiar? This app (sort of) solved that problem for me. It gives me a prompt, I jot down a few things and add a photo (I like to include photos bc it gives me nice reminders of that specific moment in time). And what do you know, I look back and realize that I have been keeping up with my journaling. It is better than nothing! Give it a try!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8891163746",
    "userName": "dawn early",
    "userUrl": "https://itunes.apple.com/us/reviews/id1126585410",
    "version": "3.27.3",
    "score": 5,
    "title": "Happy feed",
    "text": "It’s fun to write about my day even though I am almost 60 years old",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8881237978",
    "userName": "Aud Ball Ham",
    "userUrl": "https://itunes.apple.com/us/reviews/id143128584",
    "version": "3.27.2",
    "score": 5,
    "title": "So Helpful",
    "text": "I rarely follow through with writing things but this app is so easy and inspirational. Love this.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8834596382",
    "userName": "Marisaaaaa",
    "userUrl": "https://itunes.apple.com/us/reviews/id160320818",
    "version": "3.27.0",
    "score": 5,
    "title": "Changed my life!",
    "text": "Like other reviews, I love this app and feel it has changed my life. I have been in therapy for a long time. I have my ups and downs, but this app has made the quickest improvement in my mood. I love the photo feature! It makes looking at my happiness feed more satisfying, it forces my camera roll to be more joyful, and by the act of taking a photo and looking at them, i get exponentially more joy out of the app/happiness reason. It makes the happiness feel more concrete, tangible, like, look at this real actual moment in time that caused you joy, it is less fleeting than a positive thought, it allows you hold onto the joy more. Because of the app I go through my day really seeking out a positive, which really makes me spend more of my headspace on something good, which has a truly positive effect on my mood. I have only been using it for about a month or two and I started to notice a change a few weeks in. I love the reminders of what made me happy a month ago, I hope over time it will give me notification for 6 months ago, a year ago, 3 months, etc. Normally a month the item is so recent I haven’t had the chance to forget it. which i guess is good but it would like to get a random reminder of what made you happy six months or a year ago. I paid for the full version and it is entirely worth it. I’ve had days that i didn’t think were that great but then when I realized I counted up the maximum, ten good things that day, it changed my perspective on how the day went.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8827602356",
    "userName": "K8 💫",
    "userUrl": "https://itunes.apple.com/us/reviews/id492386081",
    "version": "3.27.0",
    "score": 5,
    "title": "HappyFeed",
    "text": "I’ve been using HappyFeed for nearly 4 years and it’s a crucial part of my daily routine. Having an “attitude of gratitude” will take you so far in life.  This app helps you to make it a regular practice in your day.  I love the option to add pictures.  I also love that you can set a reminder to use the app each day.  Even on the darkest days it’s important to count your blessings.  🌈",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8781193627",
    "userName": "Lanlko",
    "userUrl": "https://itunes.apple.com/us/reviews/id531962464",
    "version": "3.26.3",
    "score": 5,
    "title": "Happyfeed",
    "text": "Awesome App",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8749754791",
    "userName": "seeeezoo",
    "userUrl": "https://itunes.apple.com/us/reviews/id1004506179",
    "version": "3.26.2",
    "score": 5,
    "title": "The world when you practice positivity",
    "text": "This app stops the world for a few minutes and asks you to think of all the large and small good things that happen in a day. So much to be thankful for, see it!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8732449084",
    "userName": "Zack zack 123",
    "userUrl": "https://itunes.apple.com/us/reviews/id11546929",
    "version": "3.26.1",
    "score": 5,
    "title": "The cure for so much",
    "text": "This is the first app review I’ve ever written and it’s because of how important this app has become to me. I swear by this app. It forces me to focus on good things. It helps me remember, which is especially hard as I get older. It requires that I find something to celebrate even when the world feels like crap. It gives me a routine. It allows me to make some moments holy in the most secular of ways. If I’m having a good time, I stop to take a picture and post it here. If I’m with someone else, I tell them that I’m marking a good moment in my life with them in that picture. It makes everything that much sweeter. And it’s the exact right amount of time to dedicate each day.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8726959791",
    "userName": "krizzen7",
    "userUrl": "https://itunes.apple.com/us/reviews/id28771500",
    "version": "3.26.1",
    "score": 5,
    "title": "photos",
    "text": "Soo happy to have found a gratitude app that allows me to put in photos!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8678413549",
    "userName": "Lemoncole",
    "userUrl": "https://itunes.apple.com/us/reviews/id186664232",
    "version": "3.25.6",
    "score": 5,
    "title": "Absolutely Lovely",
    "text": "This is incredible. I wish I had discovered this app far sooner. The ability to create entries with pictures is the perfect combination of gratitude and reflection.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8663431733",
    "userName": "happyfeeder",
    "userUrl": "https://itunes.apple.com/us/reviews/id161473587",
    "version": "3.25.6",
    "score": 5,
    "title": "I’ve using this app for 5 years!",
    "text": "It’s really nice to look on what made me happy years ago",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8651451807",
    "userName": "Seal36262",
    "userUrl": "https://itunes.apple.com/us/reviews/id351926752",
    "version": "3.25.6",
    "score": 5,
    "title": "Cute :)",
    "text": "Like a diary but easier. I use it for myself so I don’t know much about connecting with friends, but that seems like another fun feature. Can’t wait to check back in a few months or a year to see how many pictures and memories I’ve collected ^^",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8631432812",
    "userName": "Tobya W.",
    "userUrl": "https://itunes.apple.com/us/reviews/id40099213",
    "version": "3.25.5",
    "score": 5,
    "title": "Gratitude",
    "text": "I enjoy writing daily gratitude entries. My favorite part of the app is the days in memory. I get reminders of my past gratitude prompts. It helps me reflect on past accomplishments.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8630769792",
    "userName": "Mrs. App CRlTIC",
    "userUrl": "https://itunes.apple.com/us/reviews/id1362931459",
    "version": "3.25.5",
    "score": 5,
    "title": "Yay!",
    "text": "I love this app! It’s so good to write in when your bored, and it shows the positive side of things. It is great!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8613657659",
    "userName": "softballtlc",
    "userUrl": "https://itunes.apple.com/us/reviews/id915789367",
    "version": "3.25.3",
    "score": 5,
    "title": "Love this Uplifting Social Media App",
    "text": "I love this because it centers around lifting spirits and creating connections between other kind supportive people. I love so much about it. I love that I’m given cues each day on positive thought revoking ideas to journal about. It brings up things I may not have thought about. Amazing and love it! I don’t even like to call it social media, because of all the negative aspects that come along with other social media sites. I think the creators of this should coin the term Social Uplifting Community or something like that! Don’t let the term Social media plague this community! ❤️😊",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8575001615",
    "userName": "Tgrady52",
    "userUrl": "https://itunes.apple.com/us/reviews/id12751277",
    "version": "3.25.3",
    "score": 5,
    "title": "HappyFeed",
    "text": "Why not!  Daily reminders to smile and share.  We all need a little or a lot of happiness!!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8557026631",
    "userName": "JZmom14",
    "userUrl": "https://itunes.apple.com/us/reviews/id180648997",
    "version": "3.25.2",
    "score": 5,
    "title": "Thumbs up!",
    "text": "Just what I was looking for!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8547449249",
    "userName": "Darcy Farrow",
    "userUrl": "https://itunes.apple.com/us/reviews/id178138046",
    "version": "3.25.2",
    "score": 5,
    "title": "Happyfeed",
    "text": "I love this app!  A gratitude journal is so necessary for living through our troubled times, for healing or just for living a good life.  This app makes it so easy!  It’s right at your fingertips every night, it doesn’t require anything of you but to write 3-5 things you’re grateful for each day and it keeps track of how many days you’ve written.  It lets you add photos and edit if you wish.  It also lets you go back if you miss a few days.  \nThank-you for this!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8508505108",
    "userName": "kimmy goods",
    "userUrl": "https://itunes.apple.com/us/reviews/id1342119031",
    "version": "3.25.0",
    "score": 5,
    "title": "Loving it",
    "text": "My teen daughter (who isn’t allowed to have social media) and I are both using the app and we have having so much fun sharing joyful tidbits from our days. I’m hoping I can get more family to use the app so our pod can be bigger but if it just stays the two of us that is great by me.",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8415933890",
    "userName": "Sheri B10",
    "userUrl": "https://itunes.apple.com/us/reviews/id452484292",
    "version": "3.22.2",
    "score": 5,
    "title": "One of my favorite apps!",
    "text": "I love that this helps me focus on and remember what’s important 🥰 I just upgraded to plus after around 3 months using it every day. Thanks for a great app without ads ✨👏🏼",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  },
  {
    "id": "8397193078",
    "userName": "Solgaleo7",
    "userUrl": "https://itunes.apple.com/us/reviews/id546370112",
    "version": "3.22.2",
    "score": 5,
    "title": "Finally, a journaling app that works for me",
    "text": "Happyfeed has stuck for me better than any other app like it I’ve tried simply because it’s so easy to use. I’m the type of person to get overwhelmed by apps with lots of bells and whistles or ones that expect long entries so this app’s a perfect fit for me. Plus, recording the good things that happen every day has helped me be more grateful and sets the days apart in my mind so I don’t fall into a rut so easily. Overall it’s worked great for me and I highly recommend it to anyone who’s had similar issues with other apps. :)\nAs of writing this I have just reached a streak of 300 days in the app. Here’s to a few hundred more!",
    "url": "https://itunes.apple.com/us/review?id=707073943&type=Purple%20Software"
  }
]